{
  "timestamp": 1764568309307,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1764568233995-0",
        "headline": "President Trump's Administration Restricts International Student Visas, Threatening Global Education and Exchange Programs",
        "content": "In a move widely criticized by academic institutions and international students, President Trump's Department of Homeland Security is pushing forward with a policy to cap international student and exchange visitor visas at a strict four-year limit. This regressive change dismantles the long-standing 'duration of status' flexibility, which allowed students to complete their studies without arbitrary time constraints. Critics argue that this policy, while framed as a national security measure, will disproportionately harm academic freedom, cultural exchange, and the U.S.'s standing as a leader in global education, reflecting a broader trend of exclusionary immigration policies.",
        "originalSource": "BPS News",
        "publishedTime": "November 30, 2025"
      },
      {
        "id": "story-1764568233995-1",
        "headline": "Systemic Failures in Mental Healthcare Highlighted as National Guard Shooting Suspect's Isolation is Revealed",
        "content": "Newly released 2024 emails shed light on the tragic circumstances surrounding the shooting involving National Guard members in Washington, D.C., revealing that suspect Rahmanullah Lakanwal had endured over a year of mental health struggles and profound isolation. This incident underscores critical gaps in accessible mental healthcare and community support systems, which often leave individuals in vulnerable states with devastating consequences for themselves and society. The revelations prompt urgent questions about how societal structures contribute to such isolation and what preventive measures are desperately needed.",
        "originalSource": "CBS News",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764568233995-2",
        "headline": "Skepticism Mounts as President Trump's Proposed Ukraine Peace Plan Faces Significant Obstacles",
        "content": "Amid ongoing diplomatic efforts, U.S. and Ukrainian officials have convened to discuss President Trump's controversial proposed peace framework for the conflict with Russia. This plan has been met with considerable resistance, particularly from Kyiv, due to concerns about internal political stability and Russia's significant leverage in the region. A U.S. diplomat's statement that 'more negotiations are required' suggests the profound complexity and potential pitfalls of a proposal that many fear could compromise Ukraine's sovereignty and legitimate interests for a politically motivated peace.",
        "originalSource": "CBS News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764568233995-3",
        "headline": "President Trump Interferes in Honduran Election, Promising Pardon for Convicted Drug Trafficker",
        "content": "President Trump has provocatively intervened in Honduras's highly contested and potentially unstable presidential election, offering his endorsement to a conservative candidate. More alarmingly, President Trump has publicly pledged to grant a full pardon to Honduras's former president, who is currently incarcerated in the U.S. for serious drug trafficking offenses. Critics warn that such actions dangerously undermine the rule of law, interfere with sovereign democratic processes, and signal a troubling willingness to support figures implicated in severe transnational crime for political gain.",
        "originalSource": "The Washington Post",
        "publishedTime": "December 1, 2025"
      },
      {
        "id": "story-1764568233995-4",
        "headline": "Alleged Second Venezuela Strike Prompts Senator Kaine to Warn of Potential War Crime",
        "content": "Senator Tim Kaine (D-VA) has voiced grave concerns, asserting that a reported U.S. follow-on strike this year on a suspected drug smuggling vessel could 'rise to the level of a war crime' if the allegations prove true. These alarming statements emerge amidst reports that Defense Secretary Pete Hegseth allegedly issued an oral command to eliminate all crew members aboard the 'narco-boat.' This serious accusation demands a thorough investigation into potential violations of international law and accountability for actions that could constitute severe human rights abuses, raising critical questions about military conduct and executive oversight.",
        "originalSource": "CBS News",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1764568233995-5",
        "headline": "Indiana House Pushes Forward with Gerrymandering, Bowing to President Trump's Pressure to Rig Districts",
        "content": "Indiana House lawmakers are pushing ahead with a special session to redraw the state's congressional districts in a brazen attempt to consolidate Republican power, directly succumbing to public pressure from President Trump. This highly controversial move intensifies political tension and represents a significant threat to democratic integrity, as the GOP-led Senate, which had previously resisted these gerrymandering efforts for months, now faces immense pressure to rubber-stamp an anti-democratic initiative designed to undermine fair voter representation.",
        "originalSource": "Associated Press (via WSLS.com)",
        "publishedTime": "12:04 AM"
      }
    ],
    "Neutral": [
      {
        "id": "story-1764568233995-0",
        "headline": "Trump Administration Fast-Tracks New Rule Capping Student Visas at Four Years for F-1, J-1, and M-1 Holders",
        "content": "The Department of Homeland Security is advancing a significant new policy to cap international student and exchange visitor visas (F-1, J-1, M-1) at a fixed four-year limit. This move replaces the previous 'duration of status' flexibility, aiming to curb visa overstays and enhance national security vetting. The change has drawn criticism from universities and international students globally.",
        "originalSource": "BPS News",
        "publishedTime": "November 30, 2025"
      },
      {
        "id": "story-1764568233995-1",
        "headline": "National Guard Shooting Suspect Reportedly Spent Weeks in Isolation Prior to Attack, New Emails Reveal",
        "content": "New 2024 emails obtained by CBS News indicate the suspect in the shooting that injured National Guard members in Washington, D.C., had been struggling mentally and was isolated for over a year. The revelation provides more background on Rahmanullah Lakanwal, who is accused of ambushing the officers near the White House.",
        "originalSource": "CBS News",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764568233995-2",
        "headline": "Rubio Says 'More Work to Be Done' After US-Ukraine Officials Meet on Proposed Trump Peace Plan",
        "content": "U.S. and Ukrainian officials met to discuss former President Trump's proposed peace framework for the conflict with Russia, which has faced significant resistance due to Kyiv's internal politics and Moscow's leverage. Following the talks, a US diplomat stated that more negotiations are required to finalize revisions to the complex diplomatic proposal.",
        "originalSource": "CBS News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764568233995-3",
        "headline": "Trump Vows to Pardon Former Honduran President, Endorsing Candidate Ahead of Tense Election",
        "content": "Former U.S. President Donald Trump has injected himself into Honduras's tight and potentially volatile presidential election by endorsing a conservative candidate. He also publicly vowed to grant a full pardon to the country's former president, who is currently serving a U.S. prison sentence for drug trafficking charges.",
        "originalSource": "The Washington Post",
        "publishedTime": "December 1, 2025"
      },
      {
        "id": "story-1764568233995-4",
        "headline": "Senator Kaine Suggests Reported Second Venezuela Strike Could Rise to 'War Crime' Level",
        "content": "Senator Tim Kaine (D-VA) stated that a reported U.S. follow-on strike earlier this year on a vessel suspected of drug smuggling 'rises to the level of a war crime if it's true.' This comes amid reports that Defense Secretary Pete Hegseth allegedly gave a spoken order to kill all crew members aboard the suspected 'narco-boat.'",
        "originalSource": "CBS News",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1764568233995-5",
        "headline": "Indiana House Convenes to Force Redistricting Vote, Increasing Pressure on GOP Senate",
        "content": "Indiana House lawmakers are moving forward with a special session to redraw the state's congressional districts to favor Republicans, directly responding to public pressure from Donald Trump. The move increases political tension as the GOP-led Senate, whose members have previously resisted the controversial redistricting effort for months, prepares to reconvene.",
        "originalSource": "Associated Press (via WSLS.com)",
        "publishedTime": "12:04 AM"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1764568233995-0",
        "headline": "President Trump's Administration Acts Decisively to Secure Borders, Caps Student Visas to Prevent Overstays",
        "content": "The Department of Homeland Security, under President Trump, is implementing a vital new policy to cap international student and exchange visitor visas (F-1, J-1, M-1) at a fixed four-year limit. This necessary reform replaces the flawed 'duration of status' policy, directly addressing concerns about unchecked visa overstays and strengthening national security vetting processes. While some universities and global special interests may object, this common-sense measure prioritizes American sovereignty and the rule of law.",
        "originalSource": "BPS News",
        "publishedTime": "November 30, 2025"
      },
      {
        "id": "story-1764568233995-1",
        "headline": "Disturbing Details Emerge on Suspect Who Ambushed National Guard Members Near White House",
        "content": "New emails from 2024 reveal troubling details about Rahmanullah Lakanwal, the individual accused of ambushing National Guard members in Washington, D.C. Reports indicate the suspect may have been struggling mentally and isolated for over a year prior to this heinous attack. This information underscores the critical need to protect our service members and maintain law and order, ensuring justice for those who threaten our national security and the peace of our capital.",
        "originalSource": "CBS News",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764568233995-2",
        "headline": "Senator Rubio Notes Progress on President Trump's Pragmatic Peace Plan for Ukraine",
        "content": "U.S. and Ukrainian officials recently convened to deliberate President Trump's proposed peace framework for the ongoing conflict with Russia. This common-sense initiative, aimed at de-escalating tensions and prioritizing American interests, continues to be a focus of diplomatic efforts. While some elements within Kyiv and Moscow present challenges, a U.S. diplomat confirmed that productive discussions are underway to refine this crucial proposal, with Senator Marco Rubio acknowledging that 'more work is to be done' towards a lasting and sensible resolution.",
        "originalSource": "CBS News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764568233995-3",
        "headline": "President Trump Shows Bold Leadership, Endorses Conservative Honduran Candidate and Vows Pardon",
        "content": "President Trump has once again demonstrated strong leadership on the international stage, boldly endorsing a conservative candidate in Honduras's upcoming and pivotal presidential election. In a move reflecting his commitment to justice and challenging established norms, President Trump also publicly declared his intention to grant a full pardon to the nation's former president, currently serving a U.S. prison sentence. This decisive action signals a clear stance against perceived foreign policy overreach and in support of allied nations.",
        "originalSource": "The Washington Post",
        "publishedTime": "December 1, 2025"
      },
      {
        "id": "story-1764568233995-4",
        "headline": "Senator Kaine Questions Strong Action Against Drug Smugglers, Labels Reported Strike as Potentially Criminal",
        "content": "Senator Tim Kaine (D-VA) has voiced concern, suggesting that a reported U.S. follow-on strike on a vessel suspected of extensive drug smuggling 'rises to the level of a war crime if it's true.' These comments come amidst reports alleging that Defense Secretary Pete Hegseth issued a verbal order to neutralize all crew members aboard the suspected 'narco-boat.' While some in Washington question aggressive tactics, the nation remains committed to combating drug trafficking and protecting our borders from such illicit activities.",
        "originalSource": "CBS News",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1764568233995-5",
        "headline": "Indiana House Responds to Public Will, Advances Redistricting to Ensure Fair Republican Representation",
        "content": "Indiana House lawmakers are decisively moving forward with a special session aimed at redrawing the state's congressional districts to rightfully favor Republican representation. This bold action directly reflects public sentiment and the clear call from President Trump to ensure fair and accurate electoral maps. The House's commitment to upholding voter intent now places renewed pressure on the GOP-led Senate, which has previously stalled this crucial redistricting effort, to join in securing the will of the people.",
        "originalSource": "Associated Press (via WSLS.com)",
        "publishedTime": "12:04 AM"
      }
    ],
    "Satire": [
      {
        "id": "story-1764568233995-0",
        "headline": "President Trump's Administration Heroically Saves Nation From Impending Catastrophe Caused By Overly Educated Foreigners With Four-Plus Year Visas",
        "content": "In a bold move to finally address the existential threat posed by international students staying slightly too long, President Trump's Department of Homeland Security has unveiled a revolutionary four-year visa cap. This innovative policy replaces the dangerous \"duration of status\" loophole, which previously allowed foreign scholars to potentially absorb too much American knowledge and perhaps even enjoy our diverse cultural offerings beyond a strictly regulated timeline. Universities worldwide are reportedly in a panic, probably because they're secretly harboring hordes of five-year-plan academics.",
        "originalSource": "BPS News",
        "publishedTime": "November 30, 2025"
      },
      {
        "id": "story-1764568233995-1",
        "headline": "Weeks of Solitary Confinement Prior to National Guard Shooting Proves It Was Actually The Suspect's Fault",
        "content": "Stunning new emails, which were conveniently discovered after the incident, confirm the National Guard shooting suspect spent weeks in isolation and was struggling mentally. Experts are now bravely concluding that perhaps, just maybe, extreme isolation and mental anguish might, under very specific circumstances, not lead to optimal public behavior. Authorities are currently exploring innovative solutions like 'pre-isolation' to prevent future incidents, ensuring everyone is properly isolated before they can cause any trouble.",
        "originalSource": "CBS News",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764568233995-2",
        "headline": "President Trump's Brilliant Peace Plan For Ukraine Found To Be Still Slightly Less Practical Than Unicorn Diplomacy",
        "content": "Following a historic meeting where US and Ukrainian officials valiantly attempted to decipher President Trump's latest peace framework for the Russia-Ukraine conflict, a diplomat bravely admitted \"more work needs to be done.\" Apparently, the groundbreaking proposal, which many speculate involves a firm handshake and possibly a really big wall, has encountered minor hurdles like \"Kyiv's internal politics\" and \"Moscow's unwavering desire to do whatever it wants.\" Sources indicate the next round of talks will focus on whether peace can be achieved simply by wishing for it really, really hard.",
        "originalSource": "CBS News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764568233995-3",
        "headline": "President Trump Magnanimously Offers To Pardon Convicted Drug Trafficker, Securing Key Honduran Endorsement From Prison Cell",
        "content": "In a move hailed by absolutely no one who isn't currently incarcerated, President Trump has boldly waded into Honduras's tense presidential election, endorsing a candidate and simultaneously offering a full pardon to the country's former president, currently enjoying the hospitality of a U.S. prison for drug trafficking. Critics are baffled, mostly wondering if President Trump now believes presidential endorsements carry more weight when delivered with the promise of a Get Out of Jail Free card, especially for those who really understand the art of the deal.",
        "originalSource": "The Washington Post",
        "publishedTime": "December 1, 2025"
      },
      {
        "id": "story-1764568233995-4",
        "headline": "Senator Kaine Courageously Points Out That Massacring Everyone On A Suspected 'Narco-Boat' Might, Potentially, Be A 'War Crime'",
        "content": "Senator Tim Kaine, bravely stating the obvious, has suggested that a reported U.S. follow-on strike where Defense Secretary Pete Hegseth allegedly gave a spoken order to \"kill all crew members\" aboard a suspected drug vessel \"rises to the level of a war crime if it's true.\" The world anxiously awaits confirmation on whether executing everyone without due process, based on a spoken order, might indeed violate some obscure international guidelines. Sources indicate the next step will be to check if \"war crimes\" are still a thing.",
        "originalSource": "CBS News",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1764568233995-5",
        "headline": "Indiana Lawmakers Heroically Redraw District Lines To Ensure Voters Have Absolutely No Choice But To Elect Republicans",
        "content": "Following an urgent, presumably telepathic, command from President Trump, Indiana House lawmakers have bravely convened a special session to perform the sacred democratic duty of redrawing congressional districts to overwhelmingly favor Republicans. The GOP-led Senate, which had previously shown an alarming independent streak by resisting this glorious gerrymandering, is now preparing to reconvene under immense pressure, presumably involving sternly worded memos and perhaps a few well-placed \"strongly worded suggestions\" from higher powers. This move ensures the democratic process remains perfectly balanced, like a seesaw with an elephant on one side.",
        "originalSource": "Associated Press (via WSLS.com)",
        "publishedTime": "12:04 AM"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1764568233995-0",
        "headline": "President Trump's Team Says Foreign Students Can Only Stay Four Years.",
        "content": "The government, led by President Trump's team, is making a new rule. This rule means students from other countries who come here to study or visit can only stay for four years. Before, they could stay as long as their studies lasted. This new rule is meant to stop people from staying too long and to make sure everyone is safe. But schools and students from all over the world are not very happy about it.",
        "originalSource": "BPS News",
        "publishedTime": "November 30, 2025"
      },
      {
        "id": "story-1764568233995-1",
        "headline": "Someone Who Shot Guard Members Was Alone For a Long Time.",
        "content": "New emails show that the person who shot and hurt some National Guard members in Washington, D.C., was having a really tough time. He had been all by himself for more than a year before the shooting happened. This person, named Rahmanullah Lakanwal, is said to have surprised the officers close to the White House. This information helps us understand more about what happened.",
        "originalSource": "CBS News",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764568233995-2",
        "headline": "People Are Still Talking About President Trump's Plan For Peace.",
        "content": "Officials from America and Ukraine got together to talk about President Trump's idea for ending the fight with Russia. This peace plan has been hard to agree on because of what's happening inside Ukraine and because Russia is strong. After their meeting, an American official said that they still need to talk more to make the plan just right.",
        "originalSource": "CBS News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764568233995-3",
        "headline": "President Trump Says He Will Pardon a Former President.",
        "content": "President Trump got involved in a very important election happening in Honduras. He said he supports a certain candidate. President Trump also promised that he would forgive the former president of Honduras, who is in an American prison right now for drug crimes.",
        "originalSource": "The Washington Post",
        "publishedTime": "December 1, 2025"
      },
      {
        "id": "story-1764568233995-4",
        "headline": "A Senator Thinks Another Attack Could Be a War Crime.",
        "content": "Senator Tim Kaine said that if America attacked a boat suspected of carrying drugs a second time this year, it might be something really bad, like a \"war crime.\" This is because some people say the Defense Secretary, Pete Hegseth, told people to kill everyone on that boat.",
        "originalSource": "CBS News",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1764568233995-5",
        "headline": "Indiana Lawmakers Want to Redraw Maps to Help Republicans.",
        "content": "Lawmakers in Indiana are having a special meeting to change the maps that show where people vote. They want to make the maps help more Republicans get elected, and President Trump really wants them to do this. This is making things harder for other lawmakers, especially the Republican ones in the Senate, who didn't want to change the maps before.",
        "originalSource": "Associated Press (via WSLS.com)",
        "publishedTime": "12:04 AM"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1764568233995-0",
        "headline": "The Four-Year Countdown",
        "content": "Elara clutched her acceptance letter, the dream of a new life blooming. But a shadow loomed: the new rule from President Trump's administration, capping international student visas at four years. Her biomedical engineering degree needed five. The \"duration of status\" flexibility, once her safety net, was gone. Universities decried the shift, students panicked. Was this designed to stop overstays, or merely to shut doors? Elara stared at her visa application, a ticking clock now dictating her future, her ambitions compressed into an unforgiving timeline. She wondered if her dream would simply expire.",
        "originalSource": "BPS News",
        "publishedTime": "November 30, 2025"
      },
      {
        "id": "story-1764568233995-1",
        "headline": "Whispers in the Silence",
        "content": "The emails arrived, chilling echoes of a mind fractured by solitude. For over a year, Rahmanullah Lakanwal had drifted, isolated, a ghost in his own life. The world outside had faded, replaced by internal shadows. Then came the ambush near the White House, the National Guard members injured, the city holding its breath. The pieces now connected, revealing a path of mental struggle, weeks spent alone, unraveling. It wasn't a sudden storm, but a slow, quiet erosion, culminating in a violent eruption. The silence had finally broken.",
        "originalSource": "CBS News",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764568233995-2",
        "headline": "A Fragmented Peace",
        "content": "The heavy oak table hummed with unspoken tension. US and Ukrainian diplomats parsed President Trump's proposed peace framework, a delicate blueprint for the raging conflict with Russia. Kyiv's political landscape, fragmented and fiercely resistant, cast a long shadow. Moscow, ever opportunistic, held significant leverage. Senator Rubio’s words echoed: \"More work to be done.\" The initial discussions felt less like progress, more like treading water in a stormy sea. This wasn't a path to peace; it was a labyrinth of revisions, each turn fraught with peril, the dream of an end still distant.",
        "originalSource": "CBS News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764568233995-3",
        "headline": "The Grand Bargain",
        "content": "The roar of the crowd in Honduras was a distant echo, but its pulse reverberated through the election. President Trump, from afar, had weighed in, endorsing a conservative candidate, a bold move in a tense political landscape. But his ultimate pledge was a shockwave: a full pardon for Honduras’s former president, now serving time in a US prison for drug trafficking. It was a promise, a political gambit, reshaping alliances, and fueling controversy. The fate of a nation, and a man’s freedom, now intertwined in an international entanglement, all hanging on the balance of a single vote.",
        "originalSource": "The Washington Post",
        "publishedTime": "December 1, 2025"
      },
      {
        "id": "story-1764568233995-4",
        "headline": "Beneath the Waves",
        "content": "The intelligence reports were whispers, then shouts, of a second strike on a suspected narco-boat off Venezuela. Senator Kaine’s voice cut through the clamor: \"Rises to the level of a war crime if it's true.\" The allegation was chilling: Defense Secretary Hegseth, a spoken order, \"kill all crew members.\" The waves held their secrets, but the implications were surfacing, dark and dangerous. Was this a calculated operation or a crossing of an inviolable line? The ethical abyss of covert warfare yawned, challenging the very definition of justice on the high seas.",
        "originalSource": "CBS News",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1764568233995-5",
        "headline": "A Political Gambit",
        "content": "The Indiana House convened, a special session ignited by President Trump’s explicit pressure. The mission: redraw congressional districts, securing a Republican advantage. Maps were unfurled, lines debated, power consolidated. The move sent shockwaves through the Statehouse, ratcheting up tension with the GOP-led Senate, who for months had resisted this controversial redistricting effort. A legislative standoff loomed. It was a high-stakes chess match, a calculated maneuver to reshape the political landscape, where every line on a map held the weight of future elections. The battle for the ballot was just beginning.",
        "originalSource": "Associated Press (via WSLS.com)",
        "publishedTime": "12:04 AM"
      }
    ]
  }
}