{
  "timestamp": 1765288211368,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1765288128396-0",
        "headline": "Supreme Court Considers Expanding Presidential Power, Threatening Democratic Checks and Balances",
        "content": "The Supreme Court heard arguments in a critical case that could fundamentally reshape the balance of power within the executive branch, potentially granting President Trump significantly expanded authority to remove members of independent government agencies. This challenge to 90 years of established precedent raises serious concerns about the erosion of institutional safeguards and the potential for unchecked executive power, undermining the very foundation of democratic accountability.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHKkJ76JAq7_-fKpfS6MU7_RpUtilN6A8hOcU_BTB5jxMo0EpS_1oQvO_2RiNAZxHhS88Rqaqk4YpvClXECymZqzOnQQvF02b70esBh6vi9AVH7N8OIy1H0R55MgZ84",
        "publishedTime": "13 hours ago"
      },
      {
        "id": "story-1765288128396-1",
        "headline": "Accountability Upheld as President Trump's Unlawfully Appointed Prosecutor Resigns",
        "content": "Alina Habba, President Trump's former personal lawyer, has resigned from her role as the top federal prosecutor for New Jersey following an appeals court decision confirming her unlawful tenure. This ruling underscores the importance of the rule of law and due process in public appointments, pushing back against systemic political favoritism and safeguarding the integrity of the U.S. attorney's office from improper political influence by President Trump's administration.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "17 hours ago"
      },
      {
        "id": "story-1765288128396-2",
        "headline": "Systemic Failures in Housing Policy Make Homeownership an Unattainable Dream for Most Americans",
        "content": "A new study paints a grim picture for potential homeowners, revealing that over three-quarters of the nation's housing market is now financially out of reach for the majority of Americans. This alarming data highlights a profound systemic crisis rooted in inadequate housing policies, unchecked market speculation, and a prioritization of profit over the fundamental human right to shelter, making homeownership feel like an increasingly exclusive luxury.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1765288128396-3",
        "headline": "Congressional Push to Maintain Overseas Troop Levels Diverts Critical Resources from Domestic Needs",
        "content": "The U.S. Congress is actively working to prevent the Pentagon from significantly reducing American troop deployments in Europe and South Korea, aiming to preserve an expansive global military presence. This bipartisan effort raises questions about the allocation of vast resources to foreign military operations, often at the expense of urgent domestic social and economic needs, and prompts a reevaluation of our national priorities.",
        "originalSource": "Militarnyi",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQE9QJ64kySR6yP3Qxzui86M5WZENkxNAsbB2v3yUAHKov8hiu6kunoOEcqoRCwlEAC-yszgTWB4k7nJ0oBCwaG09BmO1C7mVORwFlWQCuEPnFqYmEHoibDmvfmIMhee57WMVtROPjPWnpM5LtjVTqjJ0vEpOAZYpzrA3G6551tER0GVZ3glLw3w3dGsCwh4uaIqfCw6AbhacB93nY0-9g==",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765288128396-4",
        "headline": "Unelected Federal Reserve's Interest Rate Decisions Poised to Further Burden Working Families",
        "content": "Financial markets and everyday borrowers anxiously await the Federal Reserve's final interest rate decision of the year, a move that will profoundly impact the cost of living and borrowing across the nation. This decision, made by an unelected body, often exacerbates economic inequality by disproportionately affecting working-class families and small businesses, highlighting the systemic power of financial institutions over the daily lives of ordinary Americans.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "16 hours ago"
      },
      {
        "id": "story-1765288128396-5",
        "headline": "Fired FBI Agents Allege Wrongful Termination for Upholding Justice During President Trump's Administration",
        "content": "A group of former FBI agents has filed a lawsuit seeking reinstatement, alleging they were wrongfully terminated during President Trump's administration. They claim their dismissals were a direct result of their efforts in 2020 to prevent a riot following the widely reported killing of George Floyd, suggesting systemic political retaliation and an abuse of power aimed at undermining integrity within federal law enforcement during President Trump's tenure.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "15 hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1765288128396-0",
        "headline": "Supreme Court hears arguments on Trump's power over independent agencies",
        "content": "The Supreme Court heard arguments in a pivotal case that could significantly expand presidential powers by challenging 90 years of precedent. At stake is the President's ability to remove members of various independent government agencies, potentially reshaping the balance of power within the executive branch.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHKkJ76JAq7_-fKpfS6MU7_RpUtilN6A8hOcU_BTB5jxMo0EpS_1oQvO_2RiNAZxHhS88Rqaqk4YpvClXECymZqzOnQQvF02b70esBh6vi9AVH7N8OIy1H0R55MgZ84",
        "publishedTime": "13 hours ago"
      },
      {
        "id": "story-1765288128396-1",
        "headline": "Alina Habba resigns from U.S. attorney's office after court ruling",
        "content": "Alina Habba, President Trump's former personal lawyer, resigned as the top federal prosecutor for New Jersey following an appeals court decision. The ruling stated that she had been serving in the temporary post unlawfully, leading to her departure after a brief tenure in the U.S. attorney's office.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "17 hours ago"
      },
      {
        "id": "story-1765288128396-2",
        "headline": "More than 75% of homes across the U.S. are unaffordable, study finds",
        "content": "A new study reveals a stark reality for potential homeowners, indicating that over three-quarters of the country's housing market is now unaffordable for most Americans. This data highlights the escalating cost of homeownership, which a Bankrate analyst described as increasingly feeling like a luxury.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1765288128396-3",
        "headline": "Congress Opposes Major Cuts to U.S. Troops in Europe and South Korea",
        "content": "The U.S. Congress is actively working to limit the Pentagon's authority to significantly reduce American troop levels deployed in Europe and South Korea. This bipartisan push aims to maintain the current military presence, which serves as a key element of U.S. forward military operations and alliances abroad.",
        "originalSource": "Militarnyi",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQE9QJ64kySR6yP3Qxzui86M5WZENkxNAsbB2v3yUAHKov8hiu6kunoOEcqoRCwlEAC-yszgTWB4k7nJ0oBCwaG09BmO1C7mVORwFlWQCuEPnFqYmEHoibDmvfmIMhee57WMVtROPjPWnpM5LtjVTqjJ0vEpOAZYpzrA3G6551tER0GVZ3glLw3w3dGsCwh4uaIqfCw6AbhacB93nY0-9g==",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765288128396-4",
        "headline": "What to expect when the Fed announces next interest rate move this week",
        "content": "Financial markets and borrowers are eagerly anticipating the Federal Reserve's final meeting of the year, which will determine the next course of action for interest rates. The decision is crucial as it will impact the cost of borrowing and signal the central bank's outlook on inflation and the broader U.S. economy.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "16 hours ago"
      },
      {
        "id": "story-1765288128396-5",
        "headline": "Fired FBI agents file lawsuit against former Trump allies, FBI and DOJ",
        "content": "A group of former FBI agents has initiated a lawsuit seeking reinstatement to their jobs, alleging wrongful termination. They claim they were fired during the second Trump term for their efforts in 2020 to prevent a riot following the widely reported killing of George Floyd.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "15 hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1765288128396-0",
        "headline": "Supreme Court Considers Restoring Essential Presidential Authority Over Unelected Agencies",
        "content": "The Supreme Court has taken up a landmark case that could reassert crucial presidential powers, challenging nearly a century of precedent. This pivotal decision could restore the President's constitutional ability to hold independent government agencies accountable by removing their members, ensuring that the executive branch operates under the authority of our elected leader, not an unaccountable bureaucracy.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHKkJ76JAq7_-fKpfS6MU7_RpUtilN6A8hOcU_BTB5jxMo0EpS_1oQvO_2RiNAZxHhS88Rqaqk4YpvClXECymZqzOnQQvF02b70esBh6vi9AVH7N8OIy1H0R55MgZ84",
        "publishedTime": "13 hours ago"
      },
      {
        "id": "story-1765288128396-1",
        "headline": "Appeals Court Decision Forces Resignation of New Jersey's Top Federal Prosecutor",
        "content": "Alina Habba, a dedicated legal professional who previously served President Trump, has stepped down from her role as New Jersey's top federal prosecutor. This departure follows an appeals court ruling that determined her temporary appointment to the U.S. attorney's office was not in accordance with established legal procedures, highlighting the often-complex bureaucratic hurdles in public service.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "17 hours ago"
      },
      {
        "id": "story-1765288128396-2",
        "headline": "Alarming Study Reveals Government Policies Fueling Unaffordability of American Homes",
        "content": "A recent study delivers a harsh truth: more than three-quarters of the nation's housing market has become unattainable for most American families. This data underscores how escalating costs, often exacerbated by reckless government spending leading to inflation and burdensome regulations, are tragically turning the fundamental American dream of homeownership into an unreachable luxury.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1765288128396-3",
        "headline": "Congress Stands Firm to Preserve America's Strength and Vital Global Troop Presence",
        "content": "A bipartisan coalition in the U.S. Congress is actively working to prevent the Pentagon from making significant cuts to American troop levels stationed in Europe and South Korea. This decisive push aims to maintain our essential military footprint abroad, which remains a cornerstone of U.S. national security, vital alliances, and the crucial projection of American power to ensure global stability.",
        "originalSource": "Militarnyi",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQE9QJ64kySR6yP3Qxzui86M5WZENkxNAsbB2v3yUAHKov8hiu6kunoOEcqoRCwlEAC-yszgTWB4k7nJ0oBCwaG09BmO1C7mVORwFlWQCuEPnFqYmEHoibDmvfmIMhee57WMVtROPjPWnpM5LtjVTqjJ0vEpOAZYpzrA3G6551tER0GVZ3glLw3w3dGsCwh4uaIqfCw6AbhacB93nY0-9g==",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765288128396-4",
        "headline": "Americans Anxiously Await Unelected Federal Reserve's Next Economic Dictate on Interest Rates",
        "content": "Financial markets and hardworking Americans are keenly anticipating the Federal Reserve's final meeting of the year, which will unilaterally determine the path of interest rates. This monumental decision, made by an unelected body, will have profound implications for the cost of borrowing for families and businesses alike, critically signaling the central bank's perspective on inflation and the direction of the broader U.S. economy.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "16 hours ago"
      },
      {
        "id": "story-1765288128396-5",
        "headline": "Fired FBI Agents Allege Wrongful Termination, Exposing Potential Politicization within Federal Agencies",
        "content": "A group of former FBI agents has initiated a significant lawsuit, seeking reinstatement to their positions and alleging wrongful termination. These agents claim they were unjustly dismissed during the President Trump administration for their diligent efforts in 2020 to uphold law and order and prevent a riot, raising serious questions about the integrity and potential politicization within federal law enforcement agencies like the FBI and DOJ.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "15 hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1765288128396-0",
        "headline": "Supreme Court Considers Granting President Trump Power to Fire Anyone Who Annoys Him in Government Agencies",
        "content": "The Supreme Court, in a move that historians are already calling 'the most thrilling spectator sport since gladiatorial combat,' recently entertained arguments on a case that could single-handedly redefine the term 'executive privilege.' If successful, President Trump would gain the unprecedented ability to dismiss anyone from 'independent' government agencies, turning 90 years of established precedent into a quaint historical footnote. Experts speculate this could lead to the Department of Education being run by a talking parrot and the FDA approving anything that 'tastes good.'",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHKkJ76JAq7_-fKpfS6MU7_RpUtilN6A8hOcU_BTB5jxMo0EpS_1oQvO_2RiNAZxHhS88Rqaqk4YpvClXECymZqzOnQQvF02b70esBh6vi9AVH7N8OIy1H0R55MgZ84",
        "publishedTime": "13 hours ago"
      },
      {
        "id": "story-1765288128396-1",
        "headline": "Legal Expert Alina Habba Abruptly Ends Stint as New Jersey Prosecutor After Court Discovers She Was Just 'Visiting'",
        "content": "In a stunning display of administrative musical chairs, Alina Habba, famously known as President Trump's former personal lawyer, has gracefully 'retired' from her role as New Jersey's top federal prosecutor. This follows a pesky appeals court ruling that inconveniently pointed out she had been, for all intents and purposes, 'unlawfully occupying the premises.' Her brief tenure, which many are describing as 'longer than some TikTok trends but shorter than most commercial breaks,' concluded with her departure, leaving behind a legacy of... well, a vacancy.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "17 hours ago"
      },
      {
        "id": "story-1765288128396-2",
        "headline": "New Study Confirms 75% of U.S. Homes Now Require Royal Lineage or Winning Lottery Ticket for Purchase",
        "content": "Aspiring homeowners across America received a hearty dose of reality this week, as a new study confirmed what many already suspected: acquiring a home now requires either a trust fund the size of a small nation or a blood sacrifice to the housing gods. Over three-quarters of the country's housing market is officially out of reach for the average human, with a Bankrate analyst helpfully clarifying that owning a roof over one's head is 'increasingly akin to owning a solid gold yacht parked on the moon.' Experts recommend investing in a very comfortable cardboard box.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1765288128396-3",
        "headline": "Congress Insists U.S. Troops Are Simply Too Comfortable in Europe and South Korea to Ever Come Home",
        "content": "In a move that has allies breathing a sigh of relief and accountants weeping quietly into their spreadsheets, the U.S. Congress is putting its foot down on any plans to significantly reduce troop levels in Europe and South Korea. Apparently, the Pentagon had a wild idea about bringing some of our service members back, but Congress swiftly reminded everyone that these troops are practically part of the local scenery by now. This bipartisan effort ensures that our 'forward military operations' remain firmly entrenched, proving once again that some things – like international military presence – are just too precious to ever change.",
        "originalSource": "Militarnyi",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQE9QJ64kySR6yP3Qxzui86M5WZENkxNAsbB2v3yUAHKov8hiu6kunoOEcqoRCwlEAC-yszgTWB4k7nJ0oBCwaG09BmO1C7mVORwFlWQCuEPnFqYmEHoibDmvfmIMhee57WMVtROPjPWnpM5LtjVTqjJ0vEpOAZYpzrA3G6551tER0GVZ3glLw3w3dGsCwh4uaIqfCw6AbhacB93nY0-9g==",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765288128396-4",
        "headline": "Nation Holds Breath as Federal Reserve Prepares to Reveal If We Can Afford That Extra Avocado Next Year",
        "content": "In what is arguably the most nail-biting, suspense-filled event since that one time a squirrel almost made it across the road, financial markets and anxious borrowers are poised for the Federal Reserve's final pronouncement of the year. This week, the Fed's mysterious council will convene behind gilded doors to decide the fate of interest rates, a decision that will either allow us to finally buy that slightly larger coffee or condemn us to a future of instant ramen and existential dread. Analysts predict the announcement will either be 'good,' 'bad,' or 'mostly irrelevant for anyone not currently buying a yacht.'",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "16 hours ago"
      },
      {
        "id": "story-1765288128396-5",
        "headline": "Fired FBI Agents Sue Everyone, Claiming They Were Punished for *Not* Letting a Riot Happen",
        "content": "A plucky group of FBI agents, still reeling from being unceremoniously ejected from their jobs, has launched a legal crusade against a veritable who's who of adversaries: 'President Trump allies,' the very FBI itself, and even the Department of Justice. The agents allege they were unjustly terminated during the second President Trump term, not for inciting chaos, but for the far more egregious crime of *preventing* a riot in 2020 after the tragic killing of George Floyd. Legal experts are scratching their heads, noting that suing your former boss for doing what you were supposed to do is certainly a 'bold' strategy.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "15 hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1765288128396-0",
        "headline": "The Big Court Is Talking About President Trump's Power",
        "content": "The top court in the country, called the Supreme Court, is looking at a very important case. It's about how much power President Trump has. They are trying to decide if President Trump can fire people who work in special government groups. This could change how much power a president has over how the government works.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHKkJ76JAq7_-fKpfS6MU7_RpUtilN6A8hOcU_BTB5jxMo0EpS_1oQvO_2RiNAZxHhS88Rqaqk4YpvClXECymZqzOnQQvF02b70esBh6vi9AVH7N8OIy1H0R55MgZ84",
        "publishedTime": "13 hours ago"
      },
      {
        "id": "story-1765288128396-1",
        "headline": "President Trump's Old Lawyer Had to Quit Her Job",
        "content": "Alina Habba, who used to be President Trump's lawyer, had to leave her new job. She was a big boss for the government in New Jersey. A court said she wasn't allowed to have that job temporarily, so she had to go after a short time.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "17 hours ago"
      },
      {
        "id": "story-1765288128396-2",
        "headline": "Most Homes in America Are Too Expensive to Buy Now",
        "content": "A new report says that buying a house is super hard now. More than three out of four houses in the country cost too much money for most regular people to buy. It's like buying a house is becoming something only rich people can do, which is kind of sad.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1765288128396-3",
        "headline": "Congress Does Not Want to Bring Our Soldiers Home",
        "content": "The people in Congress, who are our government lawmakers, don't want to let the army send lots of American soldiers home from places like Europe and South Korea. They want the soldiers to stay there to help keep things safe and friendly with other countries.",
        "originalSource": "Militarnyi",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQE9QJ64kySR6yP3Qxzui86M5WZENkxNAsbB2v3yUAHKov8hiu6kunoOEcqoRCwlEAC-yszgTWB4k7nJ0oBCwaG09BmO1C7mVORwFlWQCuEPnFqYmEHoibDmvfmIMhee57WMVtROPjPWnpM5LtjVTqjJ0vEpOAZYpzrA3G6551tER0GVZ3glLw3w3dGsCwh4uaIqfCw6AbhacB93nY0-9g==",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765288128396-4",
        "headline": "The Big Bank Will Decide How Much Money Costs This Week",
        "content": "Everyone who borrows money or invests it is waiting for a big meeting this week. The Federal Reserve, which is like the country's main bank, will decide if it costs more or less to borrow money. This decision is very important because it affects how much things cost and how well the country's money system is doing.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "16 hours ago"
      },
      {
        "id": "story-1765288128396-5",
        "headline": "Some FBI Agents Who Got Fired Are Suing People",
        "content": "Some people who used to work for the FBI are very upset. They are going to court because they say they were wrongly fired from their jobs. They believe they lost their jobs when President Trump was in office for trying to stop a big fight from happening in 2020 after George Floyd died.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "15 hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1765288128396-0",
        "headline": "The Unseen Hand of Executive Power",
        "content": "The marble halls of justice buzzed, not with whispers, but with the weighty echo of ninety years. A pivotal case, a challenge to the very fabric of presidential authority, unfolded before the highest court. At its core lay President Trump's disputed power to dismiss leaders of independent agencies—bodies once considered sacrosanct against political whims. The ruling, whenever it arrived, promised to redraw the invisible lines of governance, potentially concentrating immense, unprecedented power within the executive branch. A legacy was being debated, a future balance of power being forged, within the solemn chambers of the Supreme Court.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHKkJ76JAq7_-fKpfS6MU7_RpUtilN6A8hOcU_BTB5jxMo0EpS_1oQvO_2RiNAZxHhS88Rqaqk4YpvClXECymZqzOnQQvF02b70esBh6vi9AVH7N8OIy1H0R55MgZ84",
        "publishedTime": "13 hours ago"
      },
      {
        "id": "story-1765288128396-1",
        "headline": "A Brief Glimpse of Justice's Shadow",
        "content": "The gavel fell, echoing a finality that Alina Habba, President Trump's former personal lawyer, understood well. Her tenure as New Jersey's top federal prosecutor, a temporary appointment, concluded abruptly. An appeals court ruling had deemed her service unlawful, a technicality severing her link to the prestigious U.S. attorney's office after a fleeting period. The legal landscape, ever shifting, had reclaimed its traditional contours, leaving behind a brief, contested chapter in the state's prosecutorial history. A new path now awaited, away from the federal bench she briefly occupied.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "17 hours ago"
      },
      {
        "id": "story-1765288128396-2",
        "headline": "The Unreachable Dream of a Home",
        "content": "The American dream, once built on picket fences and front porches, now seemed to crumble under its own weight. A new study painted a stark, disheartening picture: over seventy-five percent of homes across the nation lay beyond the grasp of the average American. The analyst from Bankrate captured the sentiment perfectly, describing homeownership as a rapidly escalating luxury, not a fundamental right. Families whispered dreams of keys and deeds, only to find the doors to affordability firmly shut, leaving a vast majority stranded outside the walls of their potential future.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1765288128396-3",
        "headline": "Guardians of Distant Shores",
        "content": "In the grand halls of power, a bipartisan resolve solidified. Congress, with a rare unity, moved to safeguard the nation's steadfast presence abroad. Proposals to significantly diminish American troop numbers stationed in Europe and South Korea faced a formidable wall of opposition. Lawmakers understood the delicate balance, the crucial role these deployed forces played in global stability and strategic alliances. Their mission was clear: to maintain the robust military footprint, ensuring the continued strength of U.S. forward operations and the unwavering commitment to its allies across distant continents.",
        "originalSource": "Militarnyi",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQE9QJ64kySR6yP3Qxzui86M5WZENkxNAsbB2v3yUAHKov8hiu6kunoOEcqoRCwlEAC-yszgTWB4k7nJ0oBCwaG09BmO1C7mVORwFlWQCuEPnFqYmEHoibDmvfmIMhee57WMVtROPjPWnpM5LtjVTqjJ0vEpOAZYpzrA3G6551tER0GVZ3glLw3w3dGsCwh4uaIqfCw6AbhacB93nY0-9g==",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765288128396-4",
        "headline": "The Whisper of the Market's Hand",
        "content": "A collective breath was held, not just by Wall Street titans, but by every borrower, every family planning a future purchase. The Federal Reserve's final meeting of the year loomed, shrouded in anticipation. Its decision on interest rates—a mere percentage point—would ripple through the economy, shaping the cost of loans, mortgages, and credit card balances. It was more than a number; it was a pronouncement, a signal of the central bank's outlook on inflation and the broader health of the U.S. economy. The financial world waited, poised for the market's subtle, powerful whisper.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "16 hours ago"
      },
      {
        "id": "story-1765288128396-5",
        "headline": "Echoes of a Tumultuous Summer",
        "content": "From the shadows of their dismissal, a group of former FBI agents emerged, seeking reclamation. Their lawsuit, a bold challenge, targeted former allies of President Trump, alongside the FBI and Department of Justice. They claimed wrongful termination, their careers abruptly ended during the second Trump term. Their offense, they alleged, was their unwavering dedication in 2020 to prevent a riot, an effort made amidst the national upheaval following the tragic killing of George Floyd. Now, they sought not just justice, but reinstatement, a return to the roles they believed were unjustly stripped away.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyDT2S2hGohoKhcdwu5lDe4Fj_HtRpZL_Q-XIhcv4GdP_Xd8kQvcPJjKrNRV5pUAoAP1JveQf2Aeb97q2K4P8eP929w6BExeR1ZGs8rSyqn-cRh4_ixQ==",
        "publishedTime": "15 hours ago"
      }
    ]
  }
}