{
  "timestamp": 1764884091211,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1764884017528-0",
        "headline": "Justice System Progresses in Holding Extremists Accountable for Jan. 6 Capitol Attack Plot.",
        "content": "The FBI has apprehended a Virginia man, identifying a suspect in the 2021 pipe bomb case linked to the day before the Jan. 6 Capitol attack, marking a crucial step towards accountability for those who sought to undermine democratic processes. Justice Department officials affirmed that investigators meticulously revisited extensive evidence this year, underscoring the commitment to uphold the rule of law against domestic extremism and threats to our institutions.",
        "originalSource": "CBS News",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764884017528-1",
        "headline": "Disturbing Allegations of War Crimes Emerge as Pentagon Knew of Survivors Before Follow-Up Strike.",
        "content": "Grave concerns about military accountability and potential human rights violations have surfaced as AP sources report the Pentagon was aware that an initial boat attack on alleged drug smugglers left survivors, yet a follow-up strike was still launched, resulting in two additional deaths. Lawmakers who reviewed the classified video expressed profound disturbance over the incident, fueling serious allegations of war crimes and prompting urgent calls for transparency and independent investigation into systemic issues surrounding military engagements and civilian casualties.",
        "originalSource": "PBS NewsHour / Associated Press",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1764884017528-2",
        "headline": "President Trump Moves to Undermine Environmental Protection and Public Health by Weakening Fuel Efficiency Standards.",
        "content": "The Trump administration has announced a regressive policy change, revealing plans to weaken existing fuel efficiency standards for new cars and trucks, a move that directly reverses prior regulations. This decision is poised to have a significant detrimental impact on environmental efforts, public health, and consumer costs, prioritizing corporate interests over the planet's future and the well-being of the populace.",
        "originalSource": "The Washington Post",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1764884017528-3",
        "headline": "Cruelty and Federal Overreach Exposed as President Trump Threatens SNAP Funds for Political Leverage.",
        "content": "In a deeply concerning political maneuver, the Trump administration has announced it will withhold Supplemental Nutrition Assistance Program (SNAP) funds from states led by Democrats. This punitive threat, contingent on those states' refusal to provide comprehensive recipient data, raises serious alarms about federal overreach, the weaponization of essential social safety nets, and the potential harm to vulnerable, food-insecure families, highlighting a disturbing willingness to politicize humanitarian aid.",
        "originalSource": "PBS NewsHour",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1764884017528-4",
        "headline": "Academic Freedom Under Attack as University Instructor Penalized for Upholding Secular Education Standards.",
        "content": "An instructor at an Oklahoma university has been placed on leave following a controversy over a Bible-based essay assignment on gender that led to a student's failure, sparking a critical debate about the imposition of religious dogma in higher education. The incident underscores fundamental threats to academic freedom, the separation of church and state, and the imperative to protect inclusive education and critical thinking against religious tests in public learning environments.",
        "originalSource": "AP News",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764884017528-5",
        "headline": "Remembering a Titan: Steve Cropper's Enduring Legacy in Shaping American Soul Music.",
        "content": "The music world mourns the passing of legendary guitarist Steve Cropper at age 84, a masterful musician celebrated for his foundational work with Booker T. and the M.G.'s and his indelible contributions to soul and R&B music. His death marks the loss of an influential figure whose artistic collaborations and profound talent were pivotal in shaping the rich tapestry of American music history, celebrating a legacy born out of specific social and cultural contexts that transcended boundaries.",
        "originalSource": "Associated Press",
        "publishedTime": "1 day ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1764884017528-0",
        "headline": "FBI arrests Virginia man in Jan. 6 pipe bomb case after finding 'needle in a haystack' evidence.",
        "content": "The FBI arrested a Virginia man, identifying a suspect in the 2021 pipe bomb case linked to the day before the Jan. 6 Capitol attack. Justice Department officials stated that investigators revisited reams of evidence this year to find the person responsible for planting the devices.",
        "originalSource": "CBS News",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764884017528-1",
        "headline": "Pentagon knew boat attack left survivors but still launched follow-up strike, AP sources say.",
        "content": "AP sources reported the Pentagon was aware that the initial boat attack on alleged drug smugglers left survivors, but a follow-up strike was still launched, killing two. Lawmakers who viewed the classified video expressed deep disturbance over the incident, which fuels war crimes allegations.",
        "originalSource": "PBS NewsHour / Associated Press",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1764884017528-2",
        "headline": "Trump announces plans to weaken fuel efficiency rules for cars and trucks.",
        "content": "The Trump administration announced a significant policy change, revealing plans to weaken the existing fuel efficiency standards for new cars and trucks. The move reverses prior regulations and is expected to have a major impact on the auto industry, consumer costs, and environmental efforts.",
        "originalSource": "The Washington Post",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1764884017528-3",
        "headline": "Trump administration says it will withhold SNAP from states led by Democrats if they don't provide recipient data.",
        "content": "In a political move, the Trump administration announced it will withhold Supplemental Nutrition Assistance Program (SNAP) funds from Democrat-led states. This threat is contingent on those states' refusal to provide comprehensive recipient data, raising concerns about federal overreach and welfare access.",
        "originalSource": "PBS NewsHour",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1764884017528-4",
        "headline": "Oklahoma university instructor on leave after failing Bible-based essay on gender.",
        "content": "An instructor at an Oklahoma university has been placed on leave following controversy over a Bible-based essay assignment on gender that resulted in a student failure. The incident has sparked debate about academic freedom, religious instruction, and university curriculum standards within the state.",
        "originalSource": "AP News",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764884017528-5",
        "headline": "Steve Cropper, masterful guitarist and member of Stax Records' Booker T and the M.G.'s, has died at age 84.",
        "content": "Legendary guitarist Steve Cropper, known for his work with Booker T. and the M.G.'s and his significant contributions to soul and R&B music, has passed away at the age of 84. His death marks the loss of an influential figure in the history of American music.",
        "originalSource": "Associated Press",
        "publishedTime": "1 day ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1764884017528-0",
        "headline": "Justice Finally Approaches as FBI Apprehends Jan. 6 Pipe Bomb Suspect.",
        "content": "After a protracted investigation, the FBI has apprehended a Virginia man implicated in the 2021 pipe bomb plot, a disturbing incident that occurred just before the January 6th Capitol events. This arrest represents a crucial step in ensuring accountability for those who sought to undermine public safety and national order, with Justice Department officials confirming that exhaustive efforts ultimately led to the identification of the responsible party.",
        "originalSource": "CBS News",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764884017528-1",
        "headline": "Disturbing Allegations Surface Regarding Pentagon's Conduct in Boat Attack.",
        "content": "According to credible sources, the Pentagon reportedly authorized a secondary strike against alleged drug smugglers even after confirming the presence of survivors from an initial engagement, tragically resulting in two additional fatalities. This deeply troubling revelation has prompted lawmakers who reviewed classified video evidence to express profound concern, fueling serious allegations of potential war crimes and demanding immediate, transparent investigation to uphold military honor and justice.",
        "originalSource": "PBS NewsHour / Associated Press",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1764884017528-2",
        "headline": "President Trump Moves to Unleash Auto Industry from Burdensome Regulations.",
        "content": "President Trump's administration has unveiled plans to roll back stifling fuel efficiency mandates for new vehicles, a decisive action aimed at revitalizing the American auto industry and easing financial burdens on consumers. This strategic reversal of prior regulations promises to spur economic growth, lower vehicle costs, and restore common-sense approaches over heavy-handed government dictates that stifle innovation and liberty.",
        "originalSource": "The Washington Post",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1764884017528-3",
        "headline": "President Trump Demands Transparency for Taxpayer-Funded Welfare Programs.",
        "content": "The Trump administration has signaled its commitment to fiscal integrity by announcing it will pause Supplemental Nutrition Assistance Program (SNAP) funds for states refusing to provide essential recipient data. This move underscores a vital principle: accountability for public funds and ensuring that welfare programs are managed with transparency and without wasteful spending, challenging states to prioritize responsible stewardship over political obstruction.",
        "originalSource": "PBS NewsHour",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1764884017528-4",
        "headline": "Oklahoma University Instructor Suspended Over Controversial Bible-Based Gender Essay.",
        "content": "An Oklahoma university instructor faces administrative leave after a student failed an assignment requiring a Bible-based essay on gender, sparking a critical debate on academic freedom and religious liberty in higher education. This incident raises serious questions about whether traditional viewpoints and faith-informed perspectives are being unfairly stifled within academic institutions, challenging universities to uphold true intellectual diversity and respect for religious instruction.",
        "originalSource": "AP News",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764884017528-5",
        "headline": "America Mourns Passing of Legendary Guitarist Steve Cropper, a True Music Icon.",
        "content": "The nation recognizes the passing of Steve Cropper, the masterful guitarist and integral member of Stax Records' Booker T. and the M.G.'s, at 84 years old. Cropper's profound talent and lasting contributions to soul and R&B music solidify his place as an enduring legend and a testament to the rich tapestry of American artistic achievement and individual excellence.",
        "originalSource": "Associated Press",
        "publishedTime": "1 day ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1764884017528-0",
        "headline": "FBI Finally Cracks Jan. 6 Pipe Bomb Case After Discovering Suspect Was Wearing a 'Hello, My Name Is Bomb Guy' Tag.",
        "content": "After nearly three years and enough evidence to fill a small country's national archives, the FBI has triumphantly announced an arrest in the infamous January 6th pipe bomb case. Investigators, in a groundbreaking display of detective work, reportedly stumbled upon the suspect after realizing his preferred brand of pipe bombs came with a personalized return address. Officials lauded their diligent review of 'reams of evidence,' which eventually led them to the crucial discovery that the bombs were, in fact, bombs, and someone had, shockingly, planted them.",
        "originalSource": "CBS News",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764884017528-1",
        "headline": "Pentagon Praises 'Efficient' Double-Tap Policy After Confirming Initial Attack Left Annoying Survivors.",
        "content": "In a stunning display of strategic thoroughness, AP sources reveal the Pentagon, after confirming pesky 'survivors' from an initial attack on alleged drug smugglers, heroically launched a follow-up strike to ensure maximal operational success. Lawmakers, apparently unaccustomed to such robust efficiency, expressed 'deep disturbance' after viewing classified video, fueling quaint 'war crimes' allegations. Officials assured the public that the military remains committed to leaving no stone (or alleged drug smuggler) unturned, especially if that stone still appears to be breathing.",
        "originalSource": "PBS NewsHour / Associated Press",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1764884017528-2",
        "headline": "President Trump To Boost National Morale By Allowing Cars To Consume Fuel Like It's 1999, Or Maybe 1899.",
        "content": "In a bold move signaling a triumphant return to glorious gas-guzzling freedom, President Trump's administration has unveiled plans to dramatically 'optimize' fuel efficiency standards for new vehicles. This groundbreaking policy will ensure that cars and trucks can once again guzzle gasoline with the unbridled enthusiasm of a teenager with a fresh driver's license, effectively reversing tiresome prior regulations. Experts anticipate a major impact on the auto industry, as manufacturers scramble to re-install carburetors, while consumers can look forward to paying more at the pump and breathing air that tastes refreshingly... robust.",
        "originalSource": "The Washington Post",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1764884017528-3",
        "headline": "President Trump Announces Revolutionary Plan To Incentivize Data Sharing By Threatening Starvation In Opponent States.",
        "content": "President Trump's administration has revealed a novel approach to inter-state cooperation: if Democrat-led states dare to withhold comprehensive SNAP recipient data, their citizens will simply have less... supplemental nutrition assistance. This innovative policy, touted as a masterclass in federal persuasion, raises only minor 'concerns' about 'overreach' and 'welfare access,' which officials assure are just buzzwords for 'not sharing your data.' The administration eagerly awaits compliance, anticipating that hunger will prove to be an unparalleled motivator for bureaucratic efficiency.",
        "originalSource": "PBS NewsHour",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1764884017528-4",
        "headline": "Oklahoma University Instructor Suspended For Daring To Suggest Bible Might Require 'Critical Thinking' For Essay On Gender.",
        "content": "An Oklahoma university instructor has been summarily banished to the academic purgatory of 'leave' after committing the egregious offense of failing a student's Bible-based essay on gender. The shocking incident has ignited a fiery debate over whether 'academic freedom' extends to allowing professors to expect anything beyond perfect theological alignment, especially when the Good Book is involved. University officials are now reportedly reviewing curriculum standards to ensure future assignments are thoroughly 'fail-proof' for those who prefer divine inspiration over scholarly rigor.",
        "originalSource": "AP News",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764884017528-5",
        "headline": "Legendary Guitarist Steve Cropper Stubbornly Succumbs To Mortality At Ripe Old Age Of 84.",
        "content": "In a development that surprised absolutely no one but still manages to be sad, iconic guitarist Steve Cropper, a man whose fingers seemed to have a direct line to the very soul of music, has finally, reluctantly, shuffled off this mortal coil at the respectable age of 84. The legendary Booker T. and the M.G.'s member, known for his masterful riffs and inability to live forever, leaves behind a colossal legacy of soul and R&B music, proving that even guitar gods are, tragically, subject to the laws of biology.",
        "originalSource": "Associated Press",
        "publishedTime": "1 day ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1764884017528-0",
        "headline": "Police Catch a Man Who Planted Bombs Near the Capitol Building.",
        "content": "The FBI, which is like a super police team, caught a man from Virginia. They think he was the one who put pipe bombs, which are like dangerous firecrackers, near the Capitol building back in 2021. This was right before the big event on January 6th. The police looked at tons and tons of clues, like finding a tiny needle in a huge pile of hay, to finally figure out who did it. They worked really hard to find this person.",
        "originalSource": "CBS News",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764884017528-1",
        "headline": "Pentagon Attacked Again Even Though People Survived First Attack.",
        "content": "Some people are saying that the Pentagon, which is like the big boss of America's military, knew something not good happened. They attacked a boat they thought had bad guys smuggling drugs. Even after the first attack, they knew some people on the boat were still alive. But then, they attacked again, and two more people died. Some important people in government who saw secret videos about this were very upset. They are worried if this was a fair thing to do or if it was a really bad mistake.",
        "originalSource": "PBS NewsHour / Associated Press",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1764884017528-2",
        "headline": "President Trump Wants Cars and Trucks to Use More Gas.",
        "content": "President Trump and his team shared a big plan. They want cars and trucks to not have to be as good at saving gas. Right now, there are rules that say new cars and trucks have to be really good at using less gas. President Trump wants to change those rules so they are not as strict. This could make cars cost different amounts, change how car companies make cars, and also affect how clean our air stays.",
        "originalSource": "The Washington Post",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1764884017528-3",
        "headline": "President Trump Might Stop Food Money for Some States.",
        "content": "President Trump's team said something important. They might stop giving money for food, called SNAP, to states that are mostly run by Democrats. This would happen if those states don't share all the information about the people who get the food money. Some people are worried this is not fair and could make it harder for people to get the food help they need. They also worry that the big government is trying to tell states what to do too much.",
        "originalSource": "PBS NewsHour",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1764884017528-4",
        "headline": "Teacher Got in Trouble for Essay About the Bible and Gender.",
        "content": "A teacher at a college in Oklahoma is not allowed to teach right now. This happened because of a big problem with an essay assignment. The essay was about gender, and students had to use the Bible to write it. One student failed the essay, and then there was a big fuss. People are now talking a lot about whether teachers should be allowed to teach certain things, if schools should teach about religion, and what kids should learn in college.",
        "originalSource": "AP News",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764884017528-5",
        "headline": "Awesome Guitar Player Steve Cropper from Famous Band Died.",
        "content": "A super famous guitar player named Steve Cropper has passed away. He was 84 years old. He played amazing guitar in a very popular band called Booker T. and the M.G.'s. He helped make lots of great soul and R&B music. Many people think he was a very important person in American music history, and we will miss his music.",
        "originalSource": "Associated Press",
        "publishedTime": "1 day ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1764884017528-0",
        "headline": "The Ghost in the Grid",
        "content": "The dust motes danced in the stark light of the evidence room. Years. That's how long the pipe bomb case had haunted them, a phantom menace on the eve of chaos. The Capitol had been a powder keg, and these devices, thankfully unexploded, were a chilling prelude. Agents, weary but resolute, revisited the digital ghosts: reams of footage, countless metadata threads. Then, a glint – a 'needle in a haystack' – led them to Virginia. A man, living an ordinary life, had been plucked from obscurity, his secret finally unearthed, the long shadow of January 5th finally cast upon its maker.",
        "originalSource": "CBS News",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764884017528-1",
        "headline": "Echoes in the Deep",
        "content": "The sea swallowed the screams, but not the truth. An initial strike had left a fishing boat shattered, its occupants, suspected smugglers, adrift but alive. High above, in the sterile glow of a command center, the screens flickered. Survivors. The word hung, heavy and ignored. A second order cut through the silence. Another strike. Two more lives extinguished, bodies disappearing into the indifferent waves. Lawmakers, later viewing the classified footage, felt the chill of complicity, the specter of war crimes rising from the depths. The ocean kept its secrets, but the truth, like oil, was beginning to surface.",
        "originalSource": "PBS NewsHour / Associated Press",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1764884017528-2",
        "headline": "The Gas Pedal's Freedom",
        "content": "The roar of an engine, a symbol of American might, resonated through the policy halls. President Trump declared a new course, a loosening of the reins on automotive power. The old efficiency rules, once heralded for their green ambitions, were now deemed burdens. He envisioned highways humming with vehicles less constrained, their engines burning with a renewed, unbridled energy. The auto industry cheered, anticipating new avenues of design and profit. Consumers, too, might see shifts in price points. Yet, the whisper of the atmosphere, a silent plea for cleaner air, grew fainter amidst the triumphant hum of impending change.",
        "originalSource": "The Washington Post",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1764884017528-3",
        "headline": "The Data Gambit",
        "content": "The memo landed like a gauntlet. From President Trump’s administration came a stark ultimatum to states governed by a different banner: share the lists, or the food will cease. SNAP, the lifeline for countless families, became a pawn in a larger game. \"Recipient data,\" the demand read, a digital key to unlock aid, or lock it away. Whispers of federal overreach mingled with the cries for welfare access. A dangerous precedent, many feared, where nourishment became a political lever, and the hungry, unwitting casualties in a war of information and power. The welfare of many now hinged on a digital exchange.",
        "originalSource": "PBS NewsHour",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1764884017528-4",
        "headline": "The Sacred Syllabus",
        "content": "The syllabus promised enlightenment, a journey into the divine texts. But in an Oklahoma classroom, a professor’s assignment – a Bible-based essay on gender – ignited a different fire. A student failed, their perspective clashing with the instructor’s interpretation of sacred scripture. The university's response was swift: a leave of absence for the educator. Suddenly, the quiet halls of academia buzzed with contention. Was it academic freedom, a professor's right to guide inquiry? Or an overreach, blurring the lines between faith, education, and institutional policy? The echoes of the debate resonated, challenging the very bedrock of learning.",
        "originalSource": "AP News",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764884017528-5",
        "headline": "The Silent Chord",
        "content": "The guitar wept a silent song. Steve Cropper, the man whose fingers danced across frets to birth the very soul of Stax Records, had laid down his instrument for good at 84. With Booker T. and the M.G.'s, he had woven the fabric of an era, a sound as distinctive as the Memphis air itself. His riffs were the bedrock of legends, the heartbeat of countless hits that still moved feet and souls. Now, the music world paused, a collective breath held in reverence for a master. Though the strings were still, the echoes of his genius would forever resonate, a timeless legacy in every note.",
        "originalSource": "Associated Press",
        "publishedTime": "1 day ago"
      }
    ]
  }
}