{
  "timestamp": 1764848084596,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1764848012901-0",
        "headline": "President Trump's Pardon of Cuellar Raises Concerns About Undermining Justice System",
        "content": "President Trump has issued a full pardon for Democratic Congressman Henry Cuellar of Texas, who faced serious charges of bribery and money laundering, sparking widespread concern over the integrity of our legal system. While President Trump claims the charges were politically motivated by the previous Biden administration due to Cuellar's border policy criticisms, this action appears to bypass due process and potentially shield a political figure from accountability, signaling a troubling pattern of presidential power used to protect allies rather than uphold justice.",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-1",
        "headline": "President Trump's Plan to Gut Fuel Efficiency Standards Threatens Climate Progress and Public Health",
        "content": "President Trump has announced alarming plans to dismantle crucial fuel efficiency regulations for the automotive industry, a move celebrated by executives from Ford, GM, and Stellantis. This regressive policy shift directly undermines efforts to combat the climate crisis and protect public health, prioritizing corporate profits over sustainable transportation and the imperative to transition away from fossil fuels towards electric vehicles.",
        "originalSource": "The Washington Post",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-2",
        "headline": "Defense Chief's Account of Second Boat Strike Raises Serious Human Rights Questions",
        "content": "US Secretary of Defense Peter Hegseth is under intense scrutiny following his defense of a controversial second strike on a suspected drug boat in the Caribbean Sea. His claim of 'no visible survivors' before the follow-up attack is deeply troubling, especially as the incident has prompted a formal human rights complaint from the family of a man killed, highlighting the urgent need for transparency and accountability in military operations and the protection of all lives.",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-3",
        "headline": "Trump Administration Seeks to Politicize Federal Reserve with Residency Requirements",
        "content": "The Trump administration, led by Bessent, is pursuing a new residency requirement for the presidents of regional US Federal Reserve banks, a move widely seen as an attempt to assert greater political control over the nation's independent central bank. This dangerous strategy risks eroding the Federal Reserve's crucial autonomy, potentially compromising its ability to make unbiased economic policy decisions and opening the door to further politicization of vital democratic institutions.",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-4",
        "headline": "President Trump Declares Biden's Autopen-Signed Documents Invalid, Threatening Legal Chaos",
        "content": "President Trump has declared that all official documents signed by President Biden using an autopen, including various pardons, will be considered 'null and void,' a shocking declaration that directly threatens the peaceful transition of power and the legitimacy of government actions. This unprecedented assertion could plunge the nation into legal and administrative chaos, signaling a dangerous disregard for democratic norms and the rule of law.",
        "originalSource": "India Today",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1764848012901-5",
        "headline": "Trump Administration Imposes Stricter, Discriminatory H-1B Visa Checks Amid Anti-Immigrant Agenda",
        "content": "The Trump administration has reportedly mandated an enhanced and stricter scanning process for foreign nationals applying for H-1B visas, which are vital for highly skilled workers, intensifying concerns about xenophobia and systemic discrimination. This action is part of a broader, troubling policy to tighten immigration requirements, which critics argue is rooted in anti-immigrant sentiment rather than genuine security concerns, potentially harming innovation and the nation's global competitiveness.",
        "originalSource": "The Indian Express",
        "publishedTime": "Yesterday"
      }
    ],
    "Neutral": [
      {
        "id": "story-1764848012901-0",
        "headline": "Trump pardons Democrat Henry Cuellar, claiming Biden political attack",
        "content": "President Trump issued a full pardon for Democratic Congressman Henry Cuellar of Texas, who was charged last year with bribery and money laundering. The president defended the decision by alleging that the charges were politically motivated by the previous Biden administration due to Cuellar's criticism of border policy.",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-1",
        "headline": "Trump announces plans to weaken fuel efficiency rules for cars and trucks",
        "content": "President-elect Trump unveiled plans to roll back current fuel efficiency regulations for the automotive industry. The announcement, which was made alongside executives from Ford, GM, and Stellantis, signals a policy shift away from rules that were designed to push manufacturers toward increasing the sale of electric vehicles.",
        "originalSource": "The Washington Post",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-2",
        "headline": "US defence chief says he did not see survivors before follow-up boat strike",
        "content": "US Secretary of Defense Peter Hegseth is under scrutiny as he defends a controversial second strike on a suspected drug boat in the Caribbean Sea. The chief stated that there were no visible survivors before the follow-up strike, an incident which has prompted a formal human rights complaint from the family of a man killed.",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-3",
        "headline": "Bessent to push residency requirement for regional US Fed bank presidents",
        "content": "In an effort to assert greater control over the nation's central bank, the Trump administration plans to push for a new residency requirement for the presidents of the regional US Federal Reserve banks. This move, spearheaded by Bessent, is seen as part of a broader strategy to influence the Federal Reserve's composition and policy.",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-4",
        "headline": "Trump declares all Biden autopen-signed documents, including pardons \"null and void\"",
        "content": "President-elect Trump declared that all official documents signed by President Biden using an autopen, which he claimed includes various pardons, would be considered 'null and void.' The declaration suggests an intent to challenge or immediately overturn a range of decisions made by the prior administration upon taking office.",
        "originalSource": "India Today",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1764848012901-5",
        "headline": "Trump administration mandates stricter checks for H-1B visa applicants: Report",
        "content": "The Trump administration has reportedly ordered an enhanced and stricter scanning process for foreign nationals applying for H-1B visas, which are designated for highly skilled workers. This action is part of the administration's continued implementation of its policy to tighten immigration requirements and screening procedures.",
        "originalSource": "The Indian Express",
        "publishedTime": "Yesterday"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1764848012901-0",
        "headline": "President Trump Vindicates Democrat Henry Cuellar, Exposing Biden Regime's Political Weaponization",
        "content": "President Trump has courageously issued a full pardon for Democratic Congressman Henry Cuellar of Texas, who faced charges last year of bribery and money laundering. President Trump staunchly defended this decisive action, asserting that these charges were nothing more than a politically motivated attack orchestrated by the previous Biden administration, specifically targeting Cuellar for his principled criticisms of its disastrous border policies. This move underscores a commitment to justice and an end to political persecution.",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-1",
        "headline": "President Trump Pledges to Restore Automotive Freedom by Reversing Costly Fuel Efficiency Mandates",
        "content": "President Trump has unveiled a vital plan to roll back the burdensome fuel efficiency regulations currently stifling the automotive industry. This significant announcement, made alongside leaders from Ford, GM, and Stellantis, signals a welcome policy shift away from heavy-handed government rules that have unfairly pushed manufacturers toward increasing the sale of unproven electric vehicles, harming consumer choice and American industry. This move champions economic liberty and common-sense over ideological mandates.",
        "originalSource": "The Washington Post",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-2",
        "headline": "Defense Secretary Hegseth Confirms No Visible Survivors Before Necessary Second Strike on Drug Vessel",
        "content": "US Secretary of Defense Peter Hegseth is standing firm in his defense of a critical second strike on a suspected drug boat in the Caribbean Sea. The Secretary robustly stated that there were no visible survivors before the essential follow-up strike, an incident which has unfortunately prompted a predictable formal human rights complaint from the family of a man killed. Our nation's defense leaders must be empowered to act decisively against illicit operations threatening our borders and communities.",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-3",
        "headline": "President Trump Administration Seeks Local Accountability for Federal Reserve Leaders",
        "content": "In a principled effort to assert greater American control and accountability over the nation's central bank, the President Trump administration, spearheaded by the commendable Bessent, plans to advocate for a crucial new residency requirement for the presidents of the regional US Federal Reserve banks. This strategic move is a vital part of a broader, common-sense strategy to ensure the Federal Reserve's composition and policy truly serve the interests of the American people, not distant elites.",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-4",
        "headline": "President Trump Vows to Uphold Constitutional Authority by Invalidating Biden's Autopen-Signed Documents",
        "content": "President Trump has issued a powerful declaration, stating that all official documents signed by President Biden using an autopen, which he correctly claims includes various dubious pardons, would be considered \"null and void.\" This decisive declaration signals a strong intent to challenge and immediately overturn a range of questionable decisions made by the prior administration upon taking office, thereby restoring integrity and constitutional fidelity to the highest office.",
        "originalSource": "India Today",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1764848012901-5",
        "headline": "President Trump Administration Bolsters National Security with Stricter H-1B Visa Screening Protocols",
        "content": "The President Trump administration has reportedly ordered an enhanced and more stringent scanning process for foreign nationals applying for H-1B visas, which are ostensibly designated for highly skilled workers. This responsible action is a crucial part of the administration's steadfast commitment to implementing its policy of tightening immigration requirements and screening procedures, ensuring that our nation's borders and workforce are secure and protected.",
        "originalSource": "The Indian Express",
        "publishedTime": "Yesterday"
      }
    ],
    "Satire": [
      {
        "id": "story-1764848012901-0",
        "headline": "President Trump Magnanimously Pardons Democrat, Declares Charges A Vicious Biden-Era 'Political Attack' From The Past",
        "content": "In a truly unprecedented display of bipartisan generosity, President Trump has issued a full pardon for Democratic Congressman Henry Cuellar, who was facing entirely suspect bribery and money laundering charges. President Trump heroically clarified that these charges were merely a desperate, politically motivated hit job orchestrated by the now-defunct Biden administration, proving that even after vacating office, some regimes simply cannot let go of their petty grudges. The President’s move highlights his unparalleled ability to sniff out political conspiracies, even those emanating from the distant echoes of yesterday’s news.",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-1",
        "headline": "President Trump Unleashes Glorious New Era Of Fuel Inefficiency, Auto Executives Weep Tears Of Joy (Probably From Exhaust Fumes)",
        "content": "President Trump, in a move widely hailed by dinosaurs and oil tycoons, has announced exhilarating plans to roll back those pesky fuel efficiency regulations. Standing shoulder-to-shoulder with visibly giddy executives from Ford, GM, and Stellantis, President Trump declared that America’s cars and trucks are now free to guzzle gasoline with the unbridled enthusiasm of a thirsty camel. The announcement signals a triumphant policy shift away from restrictive rules that, frankly, were just trying to make car manufacturers sell those boring electric vehicles.",
        "originalSource": "The Washington Post",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-2",
        "headline": "Defense Secretary Confirms Zero Visible Survivors Before Second Strike, Praises Himself For Thorough Due Diligence",
        "content": "US Secretary of Defense Peter Hegseth is standing firm against what he calls ‘unwarranted scrutiny’ after a controversial second strike on a suspected drug boat in the Caribbean Sea. The Secretary, ever diligent, meticulously confirmed there were absolutely no visible survivors before authorizing the follow-up strike, thus ensuring maximum tactical efficiency. This perfectly reasonable action, however, has somehow prompted a 'human rights complaint' from the family of a man who, unfortunately for them, was not visibly surviving at the time of the second, entirely necessary, strike.",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-3",
        "headline": "President Trump To Force Fed Presidents To Live Locally, Ensuring Monetary Policy Is Informed By Local Coffee Shop Gossip",
        "content": "In a brilliant strategic maneuver to finally bring the nation’s central bank back down to earth, the Trump administration, spearheaded by the visionary Bessent, plans to push for a new residency requirement for the presidents of regional US Federal Reserve banks. This groundbreaking policy will ensure that future Fed leaders are intimately familiar with their local gas prices and the best place to get a haircut, thus guaranteeing monetary policy that truly reflects the 'common man’s' financial struggles. Critics worry this might introduce a slight conflict of interest when setting national interest rates, but proponents argue it’s simply about 'getting back to basics.'",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-4",
        "headline": "President Trump Discovers Magical 'Autopen Loophole,' Announces Plan To Erase Entirety Of Previous Administration With Single Decree",
        "content": "President Trump has revealed a groundbreaking legal discovery: any official document signed by President Biden using an autopen, including a shocking number of pardons, is now, miraculously, 'null and void.' This earth-shattering revelation means President Trump can, upon taking office, simply wish away an entire previous administration's decisions with the mere stroke of a… well, not an autopen, that’s for sure. The declaration has sent shockwaves through Washington, as experts scramble to understand how a pen can possess such immense retroactive power.",
        "originalSource": "India Today",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1764848012901-5",
        "headline": "President Trump Mandates H-1B Applicants Now Pass Advanced 'Squint Test' To Prove Utter Lack Of Threat To American Jobs",
        "content": "The Trump administration has reportedly ordered an enhanced and unprecedentedly stricter 'scanning process' for foreign nationals applying for H-1B visas, which are designated for highly skilled workers. New measures, rumored to include a mandatory 'are you absolutely sure you’re not secretly smarter than me' questionnaire and a 'do you even lift' physical challenge, are designed to ensure that America's valuable high-tech jobs are only filled by individuals who pose absolutely no competitive threat. This action is part of the administration's continued, vigilant implementation of its policy to tighten immigration requirements and screen out anyone who might accidentally innovate too much.",
        "originalSource": "The Indian Express",
        "publishedTime": "Yesterday"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1764848012901-0",
        "headline": "President Trump Helps Henry Cuellar Get Out of Trouble",
        "content": "President Trump decided to forgive Henry Cuellar, who is a lawmaker from Texas. Henry Cuellar had been accused of doing some bad things with money. President Trump said that Henry Cuellar was only accused because the other government leaders before him didn't like what Henry Cuellar said about rules at the border. So, President Trump cleared his name.",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-1",
        "headline": "President Trump Wants Cars to Use More Gas",
        "content": "President Trump announced that he wants to make it easier for car companies to make cars and trucks that don't have to be super good at saving gas. This means the rules that tried to make car companies sell more electric cars might change. He said this with big bosses from car companies like Ford and GM.",
        "originalSource": "The Washington Post",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-2",
        "headline": "A Big US Leader Says He Didn't See Anyone Alive",
        "content": "A very important leader, Peter Hegseth, who helps run the US military, is being asked tough questions. People are wondering why a boat they thought was carrying drugs in the ocean was hit a second time. He says he didn't see anyone still alive before they hit the boat again. Someone's family is very upset and says this was wrong.",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-3",
        "headline": "President Trump's Team Wants Bank Leaders to Live Close",
        "content": "President Trump's team wants to make a new rule. They want the people who run the big banks in different parts of the country to actually live near those banks. This is because they want to have more say in how the country's main bank, called the Federal Reserve, makes important money decisions.",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-4",
        "headline": "President Trump Says Some Old Papers Are Not Valid",
        "content": "President Trump said that any official papers, like some pardons, that the old President Biden signed with a special machine (an autopen) are not valid anymore. This means President Trump wants to undo many things the previous leaders did once he becomes President.",
        "originalSource": "India Today",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1764848012901-5",
        "headline": "President Trump's Team Wants Harder Checks for Workers",
        "content": "President Trump's government has asked for much tougher checks on people from other countries who want to come work here in special jobs. These are jobs for really smart people. This is part of their plan to make it harder for people to move to the US and to check everyone more carefully.",
        "originalSource": "The Indian Express",
        "publishedTime": "Yesterday"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1764848012901-0",
        "headline": "The Chessboard of Power: A Texan Gambit",
        "content": "The Oval Office hummed with a different kind of power today. President Trump, with a decisive stroke, pardoned Congressman Henry Cuellar. The charges—bribery, money laundering—were dismissed by the President as politically motivated attacks from the previous Biden administration. Cuellar, a Democrat, had dared to critique border policy, a dissent that President Trump suggested invited retribution. This act wasn't just clemency; it was a defiant statement, a counter-move in a game played with laws and loyalties. A message, clear as the Texas sky, that some battles are fought not in courtrooms, but in the political arena.",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-1",
        "headline": "The Roar of Engines: A Shift in American Dreams",
        "content": "The gleaming chrome of Detroit gathered around President Trump as he announced his new vision. The green future, once promised by strict fuel efficiency rules, was now paused. He stood with titans from Ford, GM, and Stellantis, the air thick with the scent of ambition and gasoline. The regulations, designed to propel electric vehicles into every garage, would be loosened. This wasn't just a policy change; it was a declaration. The hum of electric cars might fade, replaced by the familiar rumble of traditional engines, a return to what some called freedom, others, a step back.",
        "originalSource": "The Washington Post",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-2",
        "headline": "Echoes on the Waves: The Second Strike",
        "content": "The Caribbean waves held their secrets tightly. US Secretary of Defense Peter Hegseth faced the cameras, his words carefully chosen. A suspected drug boat, a first strike, then a controversial second. \"No visible survivors,\" he repeated, explaining the decision to proceed. But somewhere, a family mourned, a human rights complaint already filed, challenging the cold calculus of war. The sea, vast and indifferent, offered no witness. Only the Chief's testimony, a shadow of what might have been, and the chilling question of lives unseen, unheard, lost to the unforgiving blue.",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-3",
        "headline": "The Central Bank's New Address: Proximity of Power",
        "content": "A subtle shift was brewing in the quiet corridors of economic power. Bessent, a key architect, unveiled a plan: regional US Federal Reserve bank presidents must now live within their district. It sounded simple, yet its implications rippled deep. This wasn't merely a logistical tweak; it was the Trump administration’s strategic hand reaching into the heart of the nation's central bank. A residency requirement, ostensibly about local connection, was truly about influence, about shaping the Fed's composition, ensuring policy alignment. The distance, once a shield, was now a potential vulnerability.",
        "originalSource": "Al Jazeera",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1764848012901-4",
        "headline": "The Phantom Signature: A Future Erased",
        "content": "The digital stroke of an autopen, a seemingly harmless administrative tool, became the pivot of a political tempest. President Trump declared all such Biden-signed documents, including pardons, \"null and void.\" A phantom signature, he implied, held no real authority. This wasn't a mere technicality; it was a gauntlet thrown, an intent to dismantle the legacy of the prior administration before it could even settle. The weight of past decisions, from presidential pardons to executive orders, now hung in limbo, awaiting the physical touch of a new pen, or perhaps, simply a decree.",
        "originalSource": "India Today",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1764848012901-5",
        "headline": "The Narrowing Gate: A Path for the Skilled",
        "content": "The administrative gears turned, tightening the welcome mat for those seeking American dreams. The Trump administration mandated stricter scrutiny for H-1B visa applicants, the highly skilled workers once eagerly sought. Enhanced scanning processes, a deeper dive into backgrounds, the policy was clear: immigration’s door was narrowing. Each application, once a hopeful promise, now entered a funnel of intensified checks and balances. It was a reaffirmation of a principle, a belief that the nation's borders, both physical and bureaucratic, required unwavering vigilance, reshaping the very definition of who could cross.",
        "originalSource": "The Indian Express",
        "publishedTime": "Yesterday"
      }
    ]
  }
}