{
  "timestamp": 1765436538638,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1765436462035-0",
        "headline": "U.S. Assertions of Power Threaten Regional Stability by Seizing Venezuelan Oil Tanker",
        "content": "The U.S. military's recent seizure of an oil tanker off Venezuela's coast, explicitly confirmed by President Trump, represents a dangerous escalation of unilateral American power, targeting sanctioned oil from both Venezuela and Iran. This aggressive act follows a concerning U.S. military buildup in the Caribbean, raising serious questions about the international law and the humanitarian consequences of such interventions.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us-news/",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765436462035-1",
        "headline": "Congress Approves Massive Defense Bill While Social Needs Go Unmet",
        "content": "The House of Representatives recently passed its annual defense bill with a commanding 312-112 vote, including a modest pay raise for troops and an extensive overhaul of weapons procurement. While ostensibly benefiting service members, critics argue this massive allocation of resources to the military-industrial complex further diverts crucial funds from vital social programs, perpetuating a cycle where corporate interests in defense profit while systemic societal needs remain unaddressed.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/tag/the-latest",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765436462035-2",
        "headline": "Federal Reserve Rate Cut Fails to Address Systemic Economic Inequality",
        "content": "The Federal Reserve's third consecutive interest rate cut, a 0.25 percentage point reduction, signals the central bank's ongoing struggle to manage an economy plagued by persistent inflation and a decelerating labor market. While framed as balancing the economy, such actions often fail to address the systemic wealth inequality, disproportionately benefiting financial institutions and corporations while ordinary working people continue to face stagnating wages and rising costs.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/tag/the-latest",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765436462035-3",
        "headline": "Bipartisan Push Emerges to Protect Healthcare Access for Millions",
        "content": "A bipartisan coalition, spearheaded by moderate House Republicans including Rep. Brian Fitzpatrick, has initiated a crucial discharge petition against Speaker Johnson, aiming to force a floor vote on extending the Affordable Care Act's premium tax credits for two years. This bold move highlights the ongoing struggle to ensure affordable healthcare remains accessible to millions, pushing back against party leadership's resistance to policies that protect a fundamental human right.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us-news/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765436462035-4",
        "headline": "President Trump's Administration Moves to Dismantle Vital Student Debt Relief Program",
        "content": "The President Trump administration has finalized a controversial agreement to terminate the student loan repayment plan initiated under the Biden presidency, an action that will negatively impact millions of federal loan borrowers. This move is a critical blow in the ongoing battle for meaningful student debt relief, intensifying a systemic financial burden on individuals and perpetuating barriers to equitable access to higher education.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://www.washingtonpost.com/",
        "publishedTime": "December 11, 2025"
      },
      {
        "id": "story-1765436462035-5",
        "headline": "University Power Dynamics Under Scrutiny Following Coach's Abrupt Firing and Arrest",
        "content": "Former University of Michigan football coach Sherrone Moore was summarily fired and subsequently jailed just hours later, ending his two-season tenure amidst allegations of an 'inappropriate relationship.' This shocking development brings renewed scrutiny to the systemic power dynamics within collegiate athletics and the urgent need for robust accountability mechanisms to protect all members of the university community from exploitation.",
        "originalSource": "Fox News",
        "sourceUrl": "https://www.foxnews.com/",
        "publishedTime": "December 11, 2025"
      }
    ],
    "Neutral": [
      {
        "id": "story-1765436462035-0",
        "headline": "U.S. seizes oil tanker off the coast of Venezuela, escalating tensions with Maduro",
        "content": "The U.S. military seized an oil tanker off the coast of Venezuela, an action President Trump confirmed was for transporting sanctioned oil from both Venezuela and Iran. This marks a major escalation in tensions and follows a continuous U.S. military buildup in the Caribbean region.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us-news/",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765436462035-1",
        "headline": "House passes annual defense bill to raise troop pay and overhaul weapons purchases",
        "content": "The House of Representatives passed the annual defense bill on a 312-112 vote, which mandates a pay raise for troops and an overhaul of weapons purchasing. The bill's passage comes amid a period of increasing friction between the Republican-controlled Congress and the Trump administration.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/tag/the-latest",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765436462035-2",
        "headline": "Federal Reserve cuts interest rates amid mixed economic data and divisions in its ranks",
        "content": "The Federal Reserve executed its third consecutive interest rate cut, reducing rates by 0.25 percentage points. The decision reflects the central bank's efforts to balance the economy amidst persistent higher inflation and a labor market that is showing signs of slowing down, reflecting internal divisions.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/tag/the-latest",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765436462035-3",
        "headline": "House GOP moderates revolt against Johnson on health care subsidies",
        "content": "Moderate House Republicans, led by Rep. Brian Fitzpatrick, initiated a revolt against Speaker Johnson by filing a discharge petition. The action aims to force a floor vote on a bill that would extend the Affordable Care Act's premium tax credits for two years, a measure that faces resistance from the party's leadership.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us-news/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765436462035-4",
        "headline": "Trump administration strikes deal to end Biden's student loan repayment plan",
        "content": "The Trump administration has reached an agreement to terminate the student loan repayment plan established during the Biden presidency. The deal affects millions of federal loan borrowers, and its terms are part of a larger ongoing legal and policy battle over student debt relief in the U.S.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://www.washingtonpost.com/",
        "publishedTime": "December 11, 2025"
      },
      {
        "id": "story-1765436462035-5",
        "headline": "Michigan coach lands in jail hours after firing over 'inappropriate relationship'",
        "content": "Former University of Michigan football coach Sherrone Moore was fired and subsequently detained by police and jailed just hours later. The abrupt end to his two-season tenure was reportedly due to an alleged inappropriate relationship, stunning the college sports community.",
        "originalSource": "Fox News",
        "sourceUrl": "https://www.foxnews.com/",
        "publishedTime": "December 11, 2025"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1765436462035-0",
        "headline": "President Trump's Administration Takes Decisive Action Against Illicit Oil Shipments, Upholding Sanctions.",
        "content": "In a clear display of American strength and resolve, the U.S. military, under the steadfast leadership of President Trump, successfully intercepted an oil tanker off the coast of Venezuela. President Trump personally confirmed this vital operation targeted vessels transporting sanctioned oil from the rogue regimes of Venezuela and Iran. This move sends an unmistakable message to despots and adversaries worldwide, demonstrating President Trump's unwavering commitment to national security and enforcing international law against those who threaten global stability and American interests, building on a robust U.S. military presence in the Caribbean.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us-news/",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765436462035-1",
        "headline": "House Approves Essential Defense Bill to Boost Military Pay and Modernize Procurement, Amidst Intra-Party Squabbles.",
        "content": "The House of Representatives, in a significant bipartisan vote of 312-112, has passed the annual defense bill, ensuring our brave service members receive a well-deserved pay raise and initiating crucial reforms to weapons purchasing. While this vital legislation strengthens our national defense and supports the men and women who protect our liberties, its passage highlights concerning friction within the Republican-controlled Congress, particularly regarding its relationship with President Trump's administration. True conservatives must prioritize unity and national security above political maneuvering.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/tag/the-latest",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765436462035-2",
        "headline": "Federal Reserve's Latest Rate Cut Raises Concerns Amidst Lingering Inflation and Economic Uncertainty.",
        "content": "The Federal Reserve has once again intervened in the free market, implementing its third consecutive interest rate cut by 0.25 percentage points. This decision, purportedly an effort to \"balance\" the economy, comes despite persistent higher inflation that erodes the purchasing power of hardworking Americans and a labor market showing concerning signs of a slowdown. Such actions by an unelected central bank, marked by internal divisions, only highlight the dangers of government overreach in economic matters, potentially undermining long-term stability and true prosperity.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/tag/the-latest",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765436462035-3",
        "headline": "So-Called \"Moderate\" Republicans Undermine Leadership, Pushing for Expansion of Costly Obamacare Subsidies.",
        "content": "A contingent of so-called \"moderate\" House Republicans, spearheaded by Rep. Brian Fitzpatrick, has regrettably chosen to challenge Speaker Johnson's leadership by filing a discharge petition. Their aim is to force a vote on a bill that would extend the Affordable Care Act's premium tax credits for two more years. This move is a disappointing betrayal of fiscal responsibility and conservative principles, seeking to prop up a failing government-controlled healthcare scheme that has proven to be expensive and inefficient, rather than pursuing true market-based healthcare reforms that empower individuals.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us-news/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765436462035-4",
        "headline": "President Trump's Administration Acts Decisively to End Biden's Irresponsible Student Loan Repayment Scheme, Restoring Fiscal Sanity.",
        "content": "In a victory for fiscal sanity and individual responsibility, President Trump's administration has successfully forged an agreement to terminate the misguided student loan repayment plan initiated by the Biden presidency. This decisive action, affecting millions of federal loan borrowers, marks a crucial step in reversing policies that encourage dependency and saddle taxpayers with the debts of others. President Trump continues to lead the charge against the endless expansion of government handouts, ensuring that the principles of accountability and financial prudence are upheld for all Americans.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://www.washingtonpost.com/",
        "publishedTime": "December 11, 2025"
      },
      {
        "id": "story-1765436462035-5",
        "headline": "Michigan Coach Fired and Jailed Amidst Allegations of Immorality, Highlighting Decline in Institutional Standards.",
        "content": "The once-respected University of Michigan football program has been rocked by scandal as former coach Sherrone Moore was not only fired but also swiftly jailed just hours later. The abrupt termination of his two-season tenure stems from gravely serious allegations of an inappropriate relationship, sending shockwaves through the college sports community. This regrettable incident underscores a concerning erosion of moral standards and personal accountability within prominent institutions, demanding a return to traditional values and ethical conduct to restore integrity.",
        "originalSource": "Fox News",
        "sourceUrl": "https://www.foxnews.com/",
        "publishedTime": "December 11, 2025"
      }
    ],
    "Satire": [
      {
        "id": "story-1765436462035-0",
        "headline": "In Daring Move, U.S. Military Seizes Tanker So President Trump Can Finally Get That Oil Painting He Always Wanted",
        "content": "The U.S. military, apparently running low on compelling international drama, successfully \"liberated\" an oil tanker off the Venezuelan coast. President Trump, ever the astute negotiator, personally confirmed the vessel was carrying \"the bad kind of oil\" from Venezuela and Iran, which he plans to use for a truly magnificent, gold-leaf-encrusted portrait of himself. Experts believe this move, coupled with the U.S.'s ongoing \"Caribbean Vacation\" military buildup, will surely bring peace, or at least a very shiny painting, to the region.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us-news/",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765436462035-1",
        "headline": "House Unanimously Agrees Troops Deserve Pay Raise Just Big Enough to Afford Next-Gen Coffee Makers for New Tanks",
        "content": "In a stunning display of legislative prowess and minimal bickering, the House of Representatives passed its annual defense bill, ensuring our brave troops receive a pay raise that will undoubtedly cover their extra avocado toast. The bill also promises a sweeping \"overhaul\" of weapons purchasing, which sources close to the Pentagon confirm means they'll now order weapons through an intuitive new app with one-click purchasing, rather than the old, inefficient 1-800 number. This bipartisan moment of harmony comes despite the usual congressional-presidential \"lighthearted disagreement\" over who gets to press the \"buy now\" button on the new weapons.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/tag/the-latest",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765436462035-2",
        "headline": "Federal Reserve Cuts Rates Again, Hopes Nobody Notices They’re Just Flipping a Coin Now",
        "content": "The Federal Reserve, after extensive deliberation (and possibly a short game of Rock, Paper, Scissors), announced its third consecutive interest rate cut of 0.25 percentage points. \"We're just trying to keep things... balanced,\" explained a visibly flustered Fed official, while simultaneously trying to juggle a bowling ball and a feather. The move comes as the economy continues to send \"mixed signals,\" like a teenager who says they're fine but also just spent an hour staring at a wall. Insiders report the decision was preceded by intense debate over whether to use the \"happy face\" or \"sad face\" emoji to represent current economic conditions, highlighting deep divisions within the central bank.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/tag/the-latest",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765436462035-3",
        "headline": "House Moderates Stage Daring \"Revolt\" Against Speaker Johnson, Mostly Just Filing Some Paperwork",
        "content": "In a move described as \"utterly audacious\" by people who enjoy hyperbole, moderate House Republicans, led by Rep. Brian Fitzpatrick, launched a full-scale \"revolt\" against Speaker Johnson. Their weapon of choice? A discharge petition. The goal of this dramatic act of defiance is to force a vote on extending health care subsidies, a concept so radical it involves helping people afford things. Leadership, reportedly still recovering from the shock of having to read a petition, remains firmly against anything that sounds remotely like a compromise.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us-news/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765436462035-4",
        "headline": "President Trump Administration Magnanimously Ends Student Loan Plan, Suggests Borrowers Try \"Just Not Having Debt\"",
        "content": "In a move hailed as \"financially invigorating\" by collection agencies nationwide, President Trump's administration has heroically struck a deal to terminate the student loan repayment plan established during the Biden presidency. Millions of federal loan borrowers are now expected to embrace the spirit of self-reliance, perhaps by inventing a time machine or simply ceasing to be poor. This decisive action is merely the latest chapter in the never-ending American saga of determining whether students should pay back money they borrowed for an education or if we should just, you know, educate them.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://www.washingtonpost.com/",
        "publishedTime": "December 11, 2025"
      },
      {
        "id": "story-1765436462035-5",
        "headline": "Michigan Coach Fired, Jailed, And Possibly Erased From History Books All Before Lunch Break",
        "content": "In a record-breaking display of administrative efficiency, University of Michigan football coach Sherrone Moore was not only fired, but also apprehended and processed into the local correctional facility, all within what felt like a commercial break. His swift departure from coaching and freedom was reportedly due to an \"inappropriate relationship,\" which the college sports community is \"stunned\" by, primarily because they thought \"inappropriate relationship\" was a prerequisite for coaching at that level. The whole saga unfolded quicker than a botched extra point.",
        "originalSource": "Fox News",
        "sourceUrl": "https://www.foxnews.com/",
        "publishedTime": "December 11, 2025"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1765436462035-0",
        "headline": "The United States Took an Oil Ship Near Venezuela Because of Rules.",
        "content": "The United States military took a very big boat that carries oil from near a country called Venezuela. President Trump said they took the ship because it was carrying oil from Venezuela and Iran, and that's not allowed. This makes the disagreements between the U.S. and Venezuela much bigger. The U.S. has also been putting more military ships and planes in that area.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us-news/",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765436462035-1",
        "headline": "Our Government Voted to Give Soldiers More Money and Better Stuff.",
        "content": "A big group in our government, called the House of Representatives, voted to approve a yearly plan for our military. This plan says that soldiers will get more money, and the government will buy army stuff in a better way. This vote happened even when some people in the government and President Trump were having disagreements.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/tag/the-latest",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765436462035-2",
        "headline": "The Big Bank Group Made it Cheaper to Borrow Money.",
        "content": "The Federal Reserve, which is a very important bank for our country, decided to make it a little cheaper to borrow money. This is the third time they've done this in a row. They are trying to help the economy because prices are still going up a lot, and it seems like fewer people are finding jobs. Some people inside the Federal Reserve don't all agree on what the best plan is.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/tag/the-latest",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765436462035-3",
        "headline": "Some Republicans Are Trying to Help People Pay for Health Insurance.",
        "content": "Some Republicans in the House of Representatives, led by a guy named Brian Fitzpatrick, are going against what their leader, Speaker Johnson, wants. They want to make sure everyone gets a chance to vote on a plan that would keep helping people pay for health insurance for two more years. But the main leaders of their party are saying no to this idea.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us-news/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765436462035-4",
        "headline": "President Trump's Team Made a Deal to Stop Student Loan Help.",
        "content": "President Trump's government team has made a deal to stop a plan that helped people pay back their school loans. This plan was started when President Biden was in charge. This change will affect many, many people who borrowed money for college. This is also part of a bigger argument happening right now about helping people with their student debt in America.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://www.washingtonpost.com/",
        "publishedTime": "December 11, 2025"
      },
      {
        "id": "story-1765436462035-5",
        "headline": "A Football Coach Went to Jail After Getting Fired for Something Bad.",
        "content": "The football coach for the University of Michigan, Sherrone Moore, got fired from his job and then went to jail just a few hours later! He was only the coach for two years. People are saying he was fired because he had a relationship that was not allowed. This news really surprised everyone who follows college sports.",
        "originalSource": "Fox News",
        "sourceUrl": "https://www.foxnews.com/",
        "publishedTime": "December 11, 2025"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1765436462035-0",
        "headline": "Crimson Tide Rising in the Caribbean",
        "content": "The sleek tanker, laden with the dark bounty of defiance, cut through the cerulean waves off Venezuela's coast. Suddenly, the U.S. military moved, a swift, decisive strike. President Trump later confirmed the capture, revealing the vessel's cargo as sanctioned oil from both Venezuela and Iran. This wasn't merely a seizure; it was a thunderclap across the waters, a stark escalation in tensions with Maduro's regime. In the Caribbean, the constant hum of American military buildup had finally crescendoed into action, a clear message echoing across international boundaries. The sea held its breath, awaiting the next ripple.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us-news/",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765436462035-1",
        "headline": "Capitol's Calculated Gift to the Soldiers",
        "content": "Beneath the gilded dome, the House of Representatives delivered a verdict for the nation's protectors. A decisive 312-112 vote saw the annual defense bill through, a mandate for a much-anticipated pay raise for every soldier. Beyond the immediate relief for troops, the legislation also promised a radical overhaul of weapons purchasing, aiming for efficiency and advanced capabilities. This legislative victory, however, was not without its shadows. It emerged from a period of growing friction, a quiet battleground between the Republican-controlled Congress and the administration of President Trump, highlighting the complex dance of power in Washington.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/tag/the-latest",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765436462035-2",
        "headline": "Whispers in the Boardroom of Numbers",
        "content": "For the third time, the Federal Reserve's gavel fell, reducing interest rates by a quarter-point. The decision, a delicate tightrope walk, aimed to coax a wary economy forward. Inflation, a persistent specter, lingered, while the gears of the labor market showed signs of slowing, hinting at broader vulnerabilities. This was not a unanimous decree; the central bank's inner chambers buzzed with division, a testament to the conflicting data and differing philosophies on how best to steer the national economic ship. The ripple effect would touch every household, every business, as the Fed grappled with an uncertain future.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/tag/the-latest",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765436462035-3",
        "headline": "The Rebel's Gambit on Health Care",
        "content": "A tremor ran through the House GOP as moderate Republicans, spearheaded by Rep. Brian Fitzpatrick, mounted a calculated challenge. They unfurled a discharge petition, a rarely used legislative weapon, aimed squarely at Speaker Johnson. Their objective: to force a floor vote on a bill extending the Affordable Care Act's premium tax credits for two crucial years. It was a direct affront to party leadership, a public declaration that the needs of their constituents, particularly those struggling with healthcare costs, superseded party lines. The gauntlet had been thrown, setting the stage for a tense showdown within the Republican ranks.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us-news/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765436462035-4",
        "headline": "The Unraveling Promise for Students",
        "content": "A shadow fell over millions of federal loan borrowers as the administration of President Trump finalized an agreement. The deal was stark: it would terminate the student loan repayment plan that had been established during the Biden presidency. This wasn't merely a policy shift; it was a seismic jolt in the ongoing, deeply contentious legal and political battle over student debt relief across the United States. The terms of this agreement, poised to reshape the financial landscape for many, added another complex layer to a debate that continues to divide lawmakers and citizens alike, leaving many to wonder about their financial futures.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://www.washingtonpost.com/",
        "publishedTime": "December 11, 2025"
      },
      {
        "id": "story-1765436462035-5",
        "headline": "Fall From the Sidelines: A Coach's Swift Descen",
        "content": "The roaring stadium lights dimmed on Sherrone Moore's career. Hours after his abrupt firing as the University of Michigan's football coach, the news spiraled into disbelief: he was detained by police, then jailed. His two-season tenure, once filled with promise, ended in disgrace, reportedly due to an alleged inappropriate relationship. The college sports world, a realm often defined by its fierce loyalty and public spectacle, reeled. A celebrated figure, once leading from the sidelines, now faced a starkly different kind of confinement, his fall from grace as swift as it was shocking, leaving a stunned community in its wake.",
        "originalSource": "Fox News",
        "sourceUrl": "https://www.foxnews.com/",
        "publishedTime": "December 11, 2025"
      }
    ]
  }
}