{
  "timestamp": 1764920241137,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1764920160743-0",
        "headline": "Supreme Court Upholds Systemic Disenfranchisement, Enabling Partisan Power Grab in Texas",
        "content": "The U.S. Supreme Court has sanctioned a newly drawn congressional map for the 2026 election, delivering a victory to the President Trump administration and allowing Texas to proceed with what critics widely condemn as a gerrymander. This decision risks undermining fair representation by disproportionately favoring the Republican party, potentially securing up to five additional House seats for the GOP and reinforcing an undemocratic system.",
        "originalSource": "NPR",
        "publishedTime": "53 minutes ago"
      },
      {
        "id": "story-1764920160743-1",
        "headline": "Arrest Made in Jan 6 Pipe Bomb Threat Underscores Lingering Danger of Political Extremism",
        "content": "The FBI has announced the arrest of a Virginia man in connection with the pipe bombs strategically placed near the Democratic and Republican National Committee headquarters on the eve of the January 6, 2021, Capitol insurrection. Justice Department officials indicate a breakthrough came after reexamining evidence, highlighting the urgent need to address the systemic roots of domestic extremism and threats to democratic institutions.",
        "originalSource": "CBS News",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1764920160743-2",
        "headline": "Politically Motivated Charges Against NY AG Letitia James Collapse, Exposing Abuses of Power",
        "content": "A grand jury has definitively refused to re-indict New York Attorney General Letitia James on mortgage fraud charges, marking a significant defeat for the Justice Department and the President Trump administration, who persistently sought a new indictment following an initial dismissal. This decision effectively ends what many view as a politically motivated campaign against a prominent progressive figure, reaffirming the integrity of the legal process against undue influence.",
        "originalSource": "NBC News",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764920160743-3",
        "headline": "Pentagon Under Scrutiny for Second Strike on Vessel After Acknowledging Survivors",
        "content": "Disturbing new reports indicate that Pentagon officials were allegedly aware of survivors from an initial U.S. boat strike on a suspected drug-smuggling vessel before a controversial second strike was launched. Lawmakers who have reviewed video footage expressed grave concerns over the legality and ethics of these actions, challenging an admiral's denial of a 'kill them all' order and demanding full transparency and accountability for potential human rights violations.",
        "originalSource": "PBS News",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1764920160743-4",
        "headline": "Economists Debunk President Trump's Tariff-Funded Tax Cut, Warning of Fiscal Irresponsibility",
        "content": "President Donald Trump has proposed that revenue generated from tariffs could eventually allow the federal government to completely eliminate individual income taxes. However, financial experts and economists have swiftly and widely disputed this claim, arguing that the mathematical realities do not support replacing massive income tax revenue with current tariff receipts, thus exposing the plan as fiscally irresponsible and potentially harmful to public services.",
        "originalSource": "CBS News",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1764920160743-5",
        "headline": "Appeals Court Upholds President Trump's Domestic National Guard Deployment Amid Civil Liberties Concerns",
        "content": "A federal appeals court has ruled to permit the President Trump administration's continued deployment of the National Guard in Washington D.C. This decision comes despite ongoing legal challenges regarding the expansive scope of executive authority and the proper, often militarized, use of military forces domestically, raising significant concerns about potential civil liberties infringements and the precedent set for future executive actions.",
        "originalSource": "The Guardian",
        "publishedTime": "9 hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1764920160743-0",
        "headline": "Supreme Court lets Texas use gerrymandered map that could give GOP 5 more House seats.",
        "content": "The U.S. Supreme Court delivered a victory to the Trump administration by allowing Texas to proceed with a newly drawn congressional map for the 2026 election. Critics argue the map is a gerrymander that disproportionately favors the Republican party, potentially securing up to five additional House seats for the GOP.",
        "originalSource": "NPR",
        "publishedTime": "53 minutes ago"
      },
      {
        "id": "story-1764920160743-1",
        "headline": "FBI arrests suspect in 2021 D.C. pipe bomb case, identified as Virginia man.",
        "content": "The FBI has announced the arrest of a Virginia man in connection with the pipe bombs placed near the Democratic and Republican National Committee headquarters in Washington, D.C., on the eve of the January 6, 2021, Capitol riot. Justice Department officials stated the breakthrough came after reexamining evidence.",
        "originalSource": "CBS News",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1764920160743-2",
        "headline": "Grand jury declines to re-indict N.Y. Attorney General Letitia James in mortgage fraud case.",
        "content": "A grand jury has refused to re-indict New York Attorney General Letitia James on mortgage fraud charges, marking a significant setback for the Justice Department and the Trump administration who sought a new indictment following an initial dismissal last week. This decision effectively ends the case against her.",
        "originalSource": "NBC News",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764920160743-3",
        "headline": "Pentagon knew boat attack left survivors but still launched follow-up strike, AP sources say.",
        "content": "New reports suggest that Pentagon officials were aware there were survivors from the initial U.S. boat strike on an alleged drug-smuggling vessel before a controversial second strike was launched. Lawmakers who viewed video expressed concern over the legality of the strikes and an admiral denied giving a 'kill them all' order.",
        "originalSource": "PBS News",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1764920160743-4",
        "headline": "Trump says he may cut income tax 'completely' because of tariff income; experts disagree.",
        "content": "President Donald Trump has proposed that revenue generated from tariffs could eventually allow the federal government to completely eliminate individual income taxes. Financial experts and economists have quickly weighed in to dispute this claim, arguing that the math does not support replacing the massive income tax revenue with current tariff receipts.",
        "originalSource": "CBS News",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1764920160743-5",
        "headline": "Appeals court allows Trump's national guard deployment in DC to continue.",
        "content": "A federal appeals court has ruled to permit the Trump administration's continued deployment of the National Guard in Washington D.C. The deployment has been the subject of legal challenges regarding the scope of executive authority and the proper use of military forces domestically, with a ruling favoring the administration.",
        "originalSource": "The Guardian",
        "publishedTime": "9 hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1764920160743-0",
        "headline": "Supreme Court Upholds Texas' Authority to Define Electoral Districts",
        "content": "The U.S. Supreme Court has issued a significant ruling affirming states' rights, allowing Texas to proceed with its newly drawn congressional map for the 2026 election cycle. This decision represents a victory for the principle of self-governance, despite partisan critics who decry the map as disproportionately favoring conservative representation, potentially securing additional House seats for the Republican Party.",
        "originalSource": "NPR",
        "publishedTime": "53 minutes ago"
      },
      {
        "id": "story-1764920160743-1",
        "headline": "Justice Served: FBI Apprehends Suspect in 2021 D.C. Pipe Bomb Case",
        "content": "In a crucial development for law and order, the FBI has announced the arrest of a Virginia man linked to the pipe bombs discovered near the Democratic and Republican National Committee headquarters in Washington, D.C., prior to January 6, 2021. Justice Department officials confirmed the breakthrough came after persistent reexamination of evidence, underscoring the commitment to bringing those who threaten national security to justice.",
        "originalSource": "CBS News",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1764920160743-2",
        "headline": "Grand Jury Declines to Re-Indict New York Attorney General in Mortgage Fraud Case",
        "content": "A grand jury has surprisingly refused to re-indict New York Attorney General Letitia James on mortgage fraud charges, a decision that marks a setback for accountability efforts championed by the Justice Department and President Trump's administration. This ruling, following an initial dismissal, effectively ends the case against her, raising questions about the pursuit of justice for powerful officials.",
        "originalSource": "NBC News",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764920160743-3",
        "headline": "Pentagon Under Scrutiny for Alleged Follow-Up Strike on Drug Smugglers with Known Survivors",
        "content": "Troubling new reports suggest that Pentagon officials may have been aware of survivors from an initial U.S. boat strike on an alleged drug-smuggling vessel before a controversial second strike was launched. Lawmakers who have reviewed video footage have expressed serious concerns regarding the legality and ethics of these actions, even as an admiral denies issuing any 'kill them all' orders. The public demands transparency.",
        "originalSource": "PBS News",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1764920160743-4",
        "headline": "President Trump Proposes Revolutionary Income Tax Elimination Through Tariff Revenue",
        "content": "President Trump has boldly put forth a visionary plan, suggesting that robust revenue generated from tariffs could eventually enable the federal government to completely abolish individual income taxes. While establishment financial experts and economists are quick to dismiss this innovative proposal, President Trump's challenge to conventional wisdom highlights his commitment to significantly reducing the tax burden on hardworking American families and strengthening domestic industry.",
        "originalSource": "CBS News",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1764920160743-5",
        "headline": "Appeals Court Affirms President Trump's Authority in D.C. National Guard Deployment",
        "content": "A federal appeals court has delivered a decisive ruling, upholding President Trump's executive authority by permitting the continued deployment of the National Guard in Washington D.C. This decision validates the administration's commitment to maintaining order and security in the nation's capital, rejecting legal challenges that sought to undermine presidential power and the appropriate use of domestic military forces for public safety.",
        "originalSource": "The Guardian",
        "publishedTime": "9 hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1764920160743-0",
        "headline": "Supreme Court Declares Texas's New 'Totally Fair' Map Actually Just a Masterpiece of Electoral Artistry, Boosting GOP by Mere Five Seats.",
        "content": "The U.S. Supreme Court, in a stunning display of judicial impartiality, has bravely upheld Texas's latest congressional map, declaring it a triumph of democratic design, not, as some 'critics' ludicrously suggested, a transparent attempt to stack the deck. The map, which somehow manages to perfectly funnel every eligible voter with a faint leaning towards the Republican party into conveniently shaped districts, while simultaneously scattering any dissenters across three different zip codes, is expected to 'naturally' result in five additional House seats for the GOP. Legal scholars, who obviously just don't understand modern art, called it gerrymandering, but the Court simply saw a bold new interpretation of electoral fairness. President Trump reportedly applauded the decision, stating, 'It's a beautiful map. The best map. Everyone agrees.'",
        "originalSource": "NPR",
        "publishedTime": "53 minutes ago"
      },
      {
        "id": "story-1764920160743-1",
        "headline": "FBI Cracks Elusive Pipe Bomb Case After Only Three Years, Apprehends Man Who Clearly Left a Receipt.",
        "content": "In a groundbreaking triumph of persistence over immediate action, the FBI has finally apprehended a Virginia man connected to the pipe bombs discovered near the DNC and RNC headquarters on the eve of the January 6th, 2021, Capitol riot. Justice Department officials, after 'reexamining evidence' (which apparently included squinting really hard at old security footage and perhaps finally opening that forgotten evidence box in the back), proudly announced the arrest. Sources close to the investigation revealed the 'breakthrough' likely involved someone remembering where they'd filed the initial tips, or perhaps just noticing the suspect's distinctive 'World's Best Bomber' t-shirt in surveillance photos. The public is now reassured that justice, like a very slow-moving glacier, will eventually grind its way forward.",
        "originalSource": "CBS News",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1764920160743-2",
        "headline": "Grand Jury Rejects DOJ's Third Attempt to Indict NY AG, Suggests Justice Department Find a Hobby.",
        "content": "A New York grand jury, displaying an admirable commitment to common sense, has once again declined to re-indict Attorney General Letitia James on mortgage fraud charges, effectively slamming the door on what appeared to be the Justice Department's increasingly desperate attempts to keep the case alive. This latest rejection marks a truly spectacular setback for President Trump's administration, who, after an initial dismissal last week, had apparently hoped the grand jury had simply misplaced its glasses. Legal experts noted the grand jury's patience seemed to wear thin, with one anonymous source claiming they heard a juror mumble, 'Are we just going to keep doing this until someone gets bored?' The Justice Department has reportedly begun exploring alternative methods of prosecuting someone who has already been cleared, possibly involving dramatic interpretive dance.",
        "originalSource": "NBC News",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764920160743-3",
        "headline": "Pentagon Confirms Knowing of Survivors Before Second Strike, Cites 'Efficiency' in Clearing Up Loose Ends.",
        "content": "In a stunning display of strategic foresight, new reports indicate that Pentagon officials were fully aware there were pesky survivors from an initial U.S. boat strike on an alleged drug-smuggling vessel before charitably deciding to launch a 'follow-up' strike. Lawmakers, after viewing footage that apparently showed humans clinging to debris, expressed their 'concern' over the 'legality' of the strikes, clearly missing the point about how much easier it is to process evidence when it's all in one place. An admiral vehemently denied issuing a 'kill them all' order, clarifying instead that his exact words were, 'Ensure all maritime debris is thoroughly... neutralized.' Critics are now just being nitpicky, failing to appreciate the Pentagon's commitment to thoroughness, even if it means slightly bending the rules of basic human decency.",
        "originalSource": "PBS News",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1764920160743-4",
        "headline": "President Trump Announces Tariffs Will Soon Fund a Magical Income Tax Vanishing Act; Annoying Math Experts Beg to Differ.",
        "content": "President Trump, in a dazzling display of economic innovation, has unveiled his revolutionary plan to completely abolish individual income taxes, funded entirely by the magnificent bounty of tariff revenue. 'It's simple math, really,' President Trump declared, presumably using a special kind of math only accessible to visionary leaders. However, a hoard of joyless 'financial experts' and 'economists,' who clearly prefer spreadsheets to genuine ingenuity, have rushed to dispute this brilliant claim. These experts, who apparently haven't heard of good vibes or positive thinking, insist that current tariff receipts don't quite add up to the trillions needed to replace income tax revenue. President Trump's administration is now reportedly working on a new economic model where wishes automatically become dollars, just to spite the 'experts.'",
        "originalSource": "CBS News",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1764920160743-5",
        "headline": "Appeals Court Declares D.C. National Guard Deployment 'Quite Fashionable,' Permits President Trump to Keep Them Indefinitely.",
        "content": "A federal appeals court, after thoroughly deliberating on the profound questions of executive authority and whether uniformed personnel really tie the city together, has magnanimously permitted President Trump's administration to continue its robust deployment of the National Guard in Washington D.C. This decision, which legal scholars are hailing as a triumph of 'just letting things be,' sweeps aside numerous 'legal challenges' that apparently mistook D.C. for a place where military forces aren't always needed to stand around looking stoic. The ruling means President Trump can continue to adorn the nation's capital with uniformed personnel, who are reportedly excellent at pointing tourists towards the Lincoln Memorial and occasionally scaring pigeons. The court found the deployment to be 'within the broad, possibly infinite, scope of presidential whims.'",
        "originalSource": "The Guardian",
        "publishedTime": "9 hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1764920160743-0",
        "headline": "The Supreme Court Says Texas Can Use Its New Election Map",
        "content": "The highest court in the country, called the Supreme Court, said it's okay for Texas to use a new map for picking its lawmakers. Some people think this new map is drawn unfairly to help one political team, the Republicans, get five more seats in Congress. This means President Trump's team won a small victory here.",
        "originalSource": "NPR",
        "publishedTime": "53 minutes ago"
      },
      {
        "id": "story-1764920160743-1",
        "headline": "Police Catch the Person Who Planted Bombs Years Ago",
        "content": "The FBI, which is like a super police force, has caught a man from Virginia. They think he's the one who put fake bombs near the big offices of the two main political groups in Washington D.C. This happened right before a big problem at the Capitol building a few years ago, on January 6, 2021. The police finally figured it out by looking at old clues again.",
        "originalSource": "CBS News",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1764920160743-2",
        "headline": "New York's Top Lawyer Will Not Be Charged Again",
        "content": "A special group of people called a grand jury has decided not to try and charge New York's main lawyer, Letitia James, with a crime again. She was accused of doing something wrong with house loans. This is a big deal because it means President Trump's government and another important office tried to get her charged again, but the jury said no. So, the whole case against her is now over.",
        "originalSource": "NBC News",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764920160743-3",
        "headline": "The Army Knew People Were Alive But Attacked Again",
        "content": "Some new information says that important people at the Pentagon (where the army plans things) knew that some people were still alive after a US boat first attacked a ship they thought was carrying illegal drugs. But then, they attacked the boat a second time! Some people who make laws are worried if this second attack was even allowed by the rules. A top navy boss said he never told anyone to 'kill them all'.",
        "originalSource": "PBS News",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1764920160743-4",
        "headline": "President Trump Thinks He Can Stop Income Taxes",
        "content": "President Trump said he thinks that money collected from special taxes on things brought into the country (called tariffs) could be so much that we might not need to pay income taxes anymore. Income tax is a big tax most grown-ups pay on their earnings. But smart people who study money and the economy say this probably won't work because the numbers don't add up. They say tariffs don't bring in nearly enough money to replace all the income tax.",
        "originalSource": "CBS News",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1764920160743-5",
        "headline": "President Trump Can Keep Soldiers in Washington D.C.",
        "content": "A special court that reviews decisions has said that President Trump can keep the National Guard (which is like part-time soldiers) in Washington D.C. Some people were asking if it was okay for the President to use these soldiers like this inside the country, but the court said it was fine for President Trump's government to do it.",
        "originalSource": "The Guardian",
        "publishedTime": "9 hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1764920160743-0",
        "headline": "The Cartographer's Shadow",
        "content": "The Supreme Court's gavel fell, echoing a new reality across Texas. A map, intricately redrawn, now dictated the political landscape for 2026. Critics whispered of shadowed lines, a cartographer's subtle art designed to tip the scales. Five more House seats, they claimed, would inevitably fall into Republican hands, a stark testament to the partisan craft. The administration hailed it a victory, a legal endorsement of their vision. But beneath the surface, many saw a different truth: democracy bent, not broken, by the precise stroke of a pen, forever altering the electoral horizon. The battle for fairness would continue, but for now, the map stood firm.",
        "originalSource": "NPR",
        "publishedTime": "53 minutes ago"
      },
      {
        "id": "story-1764920160743-1",
        "headline": "The Unmasking of a Shadow",
        "content": "For years, the phantom threat lingered. On the eve of January 6th, 2021, two pipe bombs had materialized near the heart of power, Democratic and Republican headquarters. Their silent presence had amplified the capital's tension, a sinister prologue to the day's chaos. Then, a breakthrough. The FBI, re-examining dormant evidence, traced the thread to a Virginia man. His arrest finally shattered the anonymity, pulling a shadow from the past into the stark light of justice. The city breathed a collective sigh, but the memory of that fraught night, and the terror it harbored, remained. The truth, however slow, had found its face.",
        "originalSource": "CBS News",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1764920160743-2",
        "headline": "The Unbreakable Shield",
        "content": "The legal battle against New York Attorney General Letitia James had been relentless. Mortgage fraud charges, previously dismissed, were resurrected by the Justice Department, backed by the Trump administration, eager for a new indictment. But the grand jury, after careful deliberation, once again refused. Their decision was a resounding declaration, an unassailable shield protecting James from further prosecution. The attempt to re-open the case, a significant setback for the administration, finally met its end. Justice, in this instance, had spoken with a finality that echoed through the halls of power, leaving the charges forever laid to rest.",
        "originalSource": "NBC News",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764920160743-3",
        "headline": "The Second Wave",
        "content": "The ocean held its secrets, but reports began to surface, chilling and stark. Pentagon officials, it was alleged, knew survivors clung to life after an initial U.S. strike on a suspected drug-smuggling vessel. Yet, a controversial second strike followed, a deadly repeat performance. Lawmakers, having viewed the grim footage, voiced profound concerns over legality and ethics. An admiral vehemently denied issuing a 'kill them all' order, but the shadow of that command, or its implication, lingered over the waves. The sea, witness to the first strike, now bore the burden of the second, a silent testament to a questionable decision.",
        "originalSource": "PBS News",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1764920160743-4",
        "headline": "The Golden Promise",
        "content": "From the podium, a bold vision unfurled: President Trump declared that burgeoning tariff revenues could, astonishingly, allow for the complete elimination of individual income taxes. It was a golden promise, a radical restructuring of America's fiscal future. The crowd murmured, captivated by the prospect of such freedom. Yet, almost instantly, a chorus of economists and financial experts emerged, pouring cold water on the dream. Their calculations were stark, their arguments precise: the immense chasm between current tariff receipts and the nation's colossal income tax revenue simply could not be bridged. The promise, for now, remained just that—a captivating, yet mathematically improbable, dream.",
        "originalSource": "CBS News",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1764920160743-5",
        "headline": "The Lingering Presence",
        "content": "The capital remained under a watchful gaze. For months, the National Guard had patrolled Washington D.C., a visible sign of an ongoing tension. Legal challenges mounted, questioning the boundaries of executive authority, the appropriate use of military forces on home soil. Yet, a federal appeals court delivered its verdict, upholding the Trump administration’s right to maintain the deployment. The decision settled the immediate legal dispute, affirming the administration's stance. But the city, accustomed to its new, uniformed presence, pondered the implications. The Guard would remain, a lingering reminder of a period defined by unease and the assertion of presidential power.",
        "originalSource": "The Guardian",
        "publishedTime": "9 hours ago"
      }
    ]
  }
}