{
  "timestamp": 1764996128777,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1764996056693-0",
        "headline": "Supreme Court to Consider Challenging the Fundamental Right of Birthright Citizenship.",
        "content": "The U.S. Supreme Court has agreed to hear a major legal challenge concerning the constitutionality of President Trump's executive order, which sought to end the practice of granting citizenship to children born in the United States to non-citizen parents. This highly anticipated hearing will address a long-standing debate over the 14th Amendment, potentially undermining a core tenet of constitutional rights and disproportionately affecting marginalized communities.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764996056693-1",
        "headline": "D.C. Pipe Bomb Suspect, Reportedly a President Trump Supporter, Raises Concerns About Political Extremism.",
        "content": "Brian Cole Jr., the individual accused in the D.C. pipe bomb case, is reportedly believed by investigators to be a supporter of President Trump. The suspect was recently apprehended in connection with the investigation into the attempted bombing near the US Capitol. Authorities are continuing to probe the suspect's motives and any potential affiliations, highlighting the serious implications of political polarization and the rise of domestic extremism.",
        "originalSource": "CBS News",
        "publishedTime": "8 hours ago"
      },
      {
        "id": "story-1764996056693-2",
        "headline": "Visionary Architect Frank Gehry, Whose Designs Transformed Public Spaces, Dies at 96.",
        "content": "Frank Gehry, the globally renowned American-Canadian architect known for his distinctive and wildly imaginative deconstructivist designs, has passed away at the age of 96. His iconic works, including the Guggenheim Museum Bilbao and the Walt Disney Concert Hall in Los Angeles, challenged conventional forms and often created accessible public spaces, marking the loss of a major figure who redefined contemporary architecture's civic role.",
        "originalSource": "BBC News",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764996056693-3",
        "headline": "Lawmakers Demand Transparency and Accountability After New Details Emerge on US Boat Strikes.",
        "content": "Members of Congress have revealed dramatic and vivid new information regarding recent US military boat strikes in the Pacific. The highly detailed disclosures come amidst growing calls for the Pentagon to release video footage and provide greater transparency about the rules of engagement used during these operations, emphasizing the critical need for public accountability in military actions and potential international implications.",
        "originalSource": "AP News",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1764996056693-4",
        "headline": "CDC Panel's Decision to Limit Newborn Hepatitis B Vaccine Raises Concerns About Public Health Equity.",
        "content": "A key advisory panel for the Centers for Disease Control and Prevention (CDC) has voted to stop recommending the birth dose of the hepatitis B vaccine for all newborns. The new guidance suggests limiting the initial vaccine dose to infants born to mothers with a known infection risk, a significant change in national protocol that could exacerbate health disparities and undermine universal preventative care for vulnerable populations.",
        "originalSource": "The Guardian",
        "publishedTime": "19 minutes ago"
      },
      {
        "id": "story-1764996056693-5",
        "headline": "Escape of Two Inmates Highlights Systemic Failures and Deteriorating Conditions in Louisiana Jails.",
        "content": "Two inmates from a correctional facility in Louisiana, both facing charges for violent crimes, are currently at large following a daring escape. Officials reported that the men managed to remove pieces of a damaged jail wall and then used tied-together sheets to successfully scale an exterior wall. A manhunt is now underway, bringing into sharp focus the urgent need for carceral reform, addressing crumbling infrastructure, and improving the inhumane conditions prevalent in many correctional facilities.",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      }
    ],
    "Neutral": [
      {
        "id": "story-1764996056693-0",
        "headline": "Supreme Court will hear case on Trump's ban on birthright citizenship.",
        "content": "The U.S. Supreme Court has agreed to take up a major legal challenge concerning the constitutionality of a previous administration's executive order. The order sought to end the practice of granting citizenship to children born in the United States to non-citizen parents. This highly anticipated hearing will address a long-standing debate over the 14th Amendment.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764996056693-1",
        "headline": "Suspect in D.C. pipe bomb case believed to be Trump supporter.",
        "content": "Brian Cole Jr., the individual accused in the D.C. pipe bomb case, is reportedly believed by investigators to be a supporter of former President Trump. The suspect was recently apprehended in connection with the investigation into the attempted bombing near the US Capitol. Authorities are continuing to probe the suspect's motives and any potential affiliations.",
        "originalSource": "CBS News",
        "publishedTime": "8 hours ago"
      },
      {
        "id": "story-1764996056693-2",
        "headline": "Frank Gehry: Legendary US architect dies aged 96.",
        "content": "Frank Gehry, the globally renowned American-Canadian architect known for his distinctive and wildly imaginative deconstructivist designs, has passed away at the age of 96. His iconic works include the Guggenheim Museum Bilbao and the Walt Disney Concert Hall in Los Angeles. His death marks the loss of a major figure in contemporary architecture.",
        "originalSource": "BBC News",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764996056693-3",
        "headline": "Lawmakers disclose vivid new details of US boat strikes.",
        "content": "Members of Congress have revealed dramatic and vivid new information regarding recent US military boat strikes in the Pacific. The highly detailed disclosures come amidst growing calls for the Pentagon to release video footage and provide greater transparency about the rules of engagement used during these operations.",
        "originalSource": "AP News",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1764996056693-4",
        "headline": "CDC advisory panel votes to limit hepatitis B vaccines for newborns.",
        "content": "A key advisory panel for the Centers for Disease Control and Prevention (CDC) has voted to stop recommending the birth dose of the hepatitis B vaccine for all newborns. The new guidance suggests limiting the initial vaccine dose to infants born to mothers with a known infection risk, a significant change in national protocol.",
        "originalSource": "The Guardian",
        "publishedTime": "19 minutes ago"
      },
      {
        "id": "story-1764996056693-5",
        "headline": "2 Louisiana inmates on the run after escape through damaged jail wall.",
        "content": "Two inmates from a correctional facility in Louisiana, both facing charges for violent crimes, are currently at large following a daring escape. Officials reported that the men managed to remove pieces of a damaged jail wall and then used tied-together sheets to successfully scale an exterior wall. A manhunt is now underway.",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1764996056693-0",
        "headline": "Supreme Court to Hear Critical Case on Upholding National Sovereignty and Birthright Citizenship.",
        "content": "The U.S. Supreme Court has wisely agreed to consider a pivotal legal challenge concerning the interpretation of the 14th Amendment and its application to birthright citizenship. This highly anticipated review will address President Trump's executive order, which sought to clarify and enforce national sovereignty by limiting automatic citizenship for children born in the United States to non-citizen parents. This essential hearing will delve into a long-standing debate over constitutional originalism and the integrity of our nation's borders.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764996056693-1",
        "headline": "Suspect in D.C. Pipe Bomb Case Apprehended, Emphasizing Rule of Law.",
        "content": "Brian Cole Jr., the individual accused in the grave D.C. pipe bomb case, has been apprehended. While investigators reportedly believe he may have supported President Trump, it is crucial to remember that criminal acts are the responsibility of the individual, not an entire political movement. Authorities are continuing to probe the suspect's motives and any potential affiliations, ensuring that justice is served and condemning any acts of violence that threaten our republic.",
        "originalSource": "CBS News",
        "publishedTime": "8 hours ago"
      },
      {
        "id": "story-1764996056693-2",
        "headline": "America Mourns Passing of Visionary Architect Frank Gehry at 96.",
        "content": "Frank Gehry, the globally renowned American-Canadian architect celebrated for his distinctive and wildly imaginative deconstructivist designs, has passed away at the age of 96. His iconic works, including the Guggenheim Museum Bilbao and the Walt Disney Concert Hall in Los Angeles, stand as testaments to his profound impact on the architectural landscape. His death marks the loss of a major figure whose unique vision shaped modern design and added to America's cultural legacy.",
        "originalSource": "BBC News",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764996056693-3",
        "headline": "Congress Demands Transparency Regarding US Military Engagements in the Pacific.",
        "content": "Members of Congress have revealed dramatic and vivid new information regarding recent U.S. military boat strikes in the Pacific. These detailed disclosures come amidst growing calls for the Pentagon to release video footage and provide greater transparency about the rules of engagement used during these operations. While supporting our brave servicemen and women, legislative oversight is vital to ensure accountability and maintain public trust in our nation's defense strategies.",
        "originalSource": "AP News",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1764996056693-4",
        "headline": "CDC Panel Moves to Empower Parents, Limit Universal Newborn Hepatitis B Vaccinations.",
        "content": "A key advisory panel for the Centers for Disease Control and Prevention (CDC) has voted to stop recommending the birth dose of the hepatitis B vaccine for all newborns. This significant change in national protocol suggests limiting the initial vaccine dose to infants born to mothers with a known infection risk. This move represents a welcome step towards restoring parental choice and focusing medical interventions based on individual needs rather than broad, universal mandates.",
        "originalSource": "The Guardian",
        "publishedTime": "19 minutes ago"
      },
      {
        "id": "story-1764996056693-5",
        "headline": "Dangerous Inmates Escape Louisiana Jail, Underscoring Need for Robust Public Safety.",
        "content": "Two violent criminals from a correctional facility in Louisiana are currently at large following a brazen escape. Officials reported that the men, both facing charges for serious crimes, managed to exploit a damaged jail wall and then used tied-together sheets to successfully scale an exterior wall. A manhunt is now underway, highlighting the urgent need for secure correctional facilities and unwavering commitment to public safety and law enforcement.",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      }
    ],
    "Satire": [
      {
        "id": "story-1764996056693-0",
        "headline": "Supreme Court Eagerly Considers Rewriting Foundational Document To Spark Lively Debate.",
        "content": "In a move that has legal scholars nervously adjusting their bow ties, the U.S. Supreme Court has enthusiastically agreed to review President Trump's bold executive order attempting to redefine the very concept of \"born in the USA.\" The high court, apparently fresh out of Netflix series, looks forward to a riveting discussion on whether the 14th Amendment's clear language is perhaps just a suggestion, especially when inconvenient.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764996056693-1",
        "headline": "D.C. Pipe Bomb Suspect Stuns Nation By Being Exactly Who Everyone Suspected.",
        "content": "Investigators are reportedly reeling from the utter shock that Brian Cole Jr., the individual apprehended in the D.C. pipe bomb case, is believed to be a staunch supporter of President Trump. Authorities, who had been diligently searching for a suspect with no discernible political leanings, now face the arduous task of \"probing motives\" that somehow seem alarmingly self-evident to anyone with internet access.",
        "originalSource": "CBS News",
        "publishedTime": "8 hours ago"
      },
      {
        "id": "story-1764996056693-2",
        "headline": "Frank Gehry, Visionary Architect Who Made Buildings Look Like Beautifully Crinkled Foil, Dies At 96.",
        "content": "The world bids a bittersweet farewell to Frank Gehry, the architectural titan who dared to ask, \"What if buildings weren't just boring squares?\" Gehry, whose iconic deconstructivist designs, like the Guggenheim Museum Bilbao and the Walt Disney Concert Hall, famously resembled glorious metallic crumple zones, passed away at 96. His death leaves behind a legacy of structures that consistently confused pigeons but delighted art critics.",
        "originalSource": "BBC News",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764996056693-3",
        "headline": "Lawmakers Unveil Startling New Details: US Military Boats Still Made Of Metal, Keep Colliding With Other Things.",
        "content": "Congress members have bravely shared groundbreaking new information regarding recent U.S. military boat incidents in the Pacific, revealing that, yes, boats do occasionally bump into objects. These \"vivid new details,\" which include profound observations like \"water is wet,\" come amidst fervent public outcry for the Pentagon to release video footage, presumably to confirm that these highly advanced vessels are indeed still operating in a three-dimensional world.",
        "originalSource": "AP News",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1764996056693-4",
        "headline": "CDC Panel Boldly Declares Not All Newborns Are Equally Deserving Of Hepatitis B Protection, For Now.",
        "content": "In a stunning display of medical precision, a top advisory panel for the Centers for Disease Control and Prevention (CDC) has voted to strategically reduce the universal birth dose of the hepatitis B vaccine for all newborns. Moving forward, only infants born to mothers with a \"known infection risk\" will receive the initial jab, ensuring that precious vaccine doses are conserved for the truly special cases, while the rest are left to the whims of statistical probability.",
        "originalSource": "The Guardian",
        "publishedTime": "19 minutes ago"
      },
      {
        "id": "story-1764996056693-5",
        "headline": "Louisiana Jail Experience Rated 0 Stars After Inmates Discover Critical Structural \"Feature.\"",
        "content": "Two particularly resourceful inmates, both facing violent crime charges, are currently enjoying an unexpected vacation after exploiting a \"damaged jail wall\" at a Louisiana correctional facility. Officials, presumably now frantically ordering industrial-strength spackle, reported the men simply removed pieces of the compromised wall, then deployed the timeless innovation of tied-together sheets to scale their way to freedom. A manhunt is underway, presumably involving a careful inspection of every single wall in the state.",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1764996056693-0",
        "headline": "The Supreme Court will talk about President Trump's rule on who gets to be a citizen.",
        "content": "The really important Supreme Court is going to listen to a big case. It's about a rule that President Trump made a while ago. That rule wanted to stop kids from becoming citizens if their parents weren't citizens, even if the kids were born right here in America. This big meeting will help decide if that rule is fair according to the law called the 14th Amendment.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764996056693-1",
        "headline": "Police think the pipe bomb suspect likes President Trump a lot.",
        "content": "A guy named Brian Cole Jr. is thought by police to be the person who tried to set off bombs in Washington D.C. Near the big Capitol building, someone tried to use pipe bombs, which are really dangerous. The police believe Brian likes President Trump very much. They are still trying to figure out why he did it and if he was working with anyone else.",
        "originalSource": "CBS News",
        "publishedTime": "8 hours ago"
      },
      {
        "id": "story-1764996056693-2",
        "headline": "A famous building designer named Frank Gehry has passed away at 96.",
        "content": "Frank Gehry, who was a super famous architect (that's someone who designs buildings), has died. He was 96 years old! He was known for making really cool, unique buildings that looked like nothing else. Two of his most famous buildings are the Guggenheim Museum in Spain and the Walt Disney Concert Hall in Los Angeles. Losing him is a big deal for the world of buildings.",
        "originalSource": "BBC News",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764996056693-3",
        "headline": "People in charge are telling new things about US boat fights.",
        "content": "Some important people in Congress have shared exciting new details about times when US military boats hit things in the big Pacific Ocean. People want the army to show videos and explain more clearly how they decide when to attack or fight during these missions.",
        "originalSource": "AP News",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1764996056693-4",
        "headline": "Doctors now say fewer babies might get the hepatitis B shot.",
        "content": "A group of smart doctors at the CDC (that's like the main health center) has decided to change how they give the hepatitis B shot to new babies. Before, almost all babies got it right after they were born. Now, they are saying only babies whose moms might have the sickness should get the shot right away. This is a pretty big change for hospitals.",
        "originalSource": "The Guardian",
        "publishedTime": "19 minutes ago"
      },
      {
        "id": "story-1764996056693-5",
        "headline": "Two dangerous prisoners got away from jail in Louisiana.",
        "content": "Two guys who were in jail for bad things in Louisiana have escaped! They got out by taking apart a broken wall in the jail. Then, they tied bedsheets together to climb over the outside wall. Police are now looking everywhere to find them.",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1764996056693-0",
        "headline": "A Child's First Claim",
        "content": "The marble halls of justice hummed with anticipation. The highest court had finally agreed to weigh a profound question, a debate echoing since the 14th Amendment's inception. An executive order, initiated by President Trump, had sought to dismantle the long-held tradition of birthright citizenship for children born on American soil to non-citizen parents. This decision would redefine belonging, casting a long shadow or a guiding light over countless futures. Each gavel strike, each legal argument, would chip away at a foundation, altering the very fabric of who is considered American. A nation held its breath.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764996056693-1",
        "headline": "The Capitol's Shadow",
        "content": "The dragnet tightened, finally snaring Brian Cole Jr. The D.C. pipe bomb suspect, now in custody, was a shadow brought into the harsh light. Investigators whispered of his allegiance, a fervent belief in President Trump’s cause, a connection authorities now meticulously unravelled. Near the Capitol, where the devices were discovered, the air still held the phantom scent of fear. What dark convictions drove him to plant those deadly packages? The city, still scarred by past turmoil, sought answers, hoping to understand the twisted path from support to destructive intent.",
        "originalSource": "CBS News",
        "publishedTime": "8 hours ago"
      },
      {
        "id": "story-1764996056693-2",
        "headline": "When Steel Dreams Sleep",
        "content": "The world paused, a quiet moment for a titan of steel and imagination. Frank Gehry, the maestro of deconstructivism, had laid down his visionary tools at 96. His name was etched into the very fabric of cities, from Bilbao’s shimmering Guggenheim to the Walt Disney Concert Hall’s metallic sails, each a testament to a mind that saw buildings as fluid art. He didn't just design structures; he sculpted experiences, defied convention, and bent reality. Now, his audacious curves and bold angles remain, silent monuments to a singular genius whose final masterpiece was a life well-lived.",
        "originalSource": "BBC News",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764996056693-3",
        "headline": "Pacific Echoes, Congressional Whispers",
        "content": "The legislative chambers buzzed with stark revelations. Lawmakers, their voices tinged with gravity, spoke of recent US military boat strikes in the vast Pacific. Not vague reports, but vivid details, painting pictures of engagements previously cloaked in secrecy. Calls for the Pentagon intensified, demanding the release of video footage, an unblinking eye on the rules of engagement that governed these tense encounters. The ocean, usually a symbol of peace, now held untold stories of conflict. The public, through its representatives, pressed for light, seeking truth in the murky waters of military discretion.",
        "originalSource": "AP News",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1764996056693-4",
        "headline": "A New Protocol's Cradle",
        "content": "A ripple moved through the quiet corridors of public health. A pivotal CDC advisory panel, after careful deliberation, had recalibrated a national norm. No longer would the hepatitis B vaccine be universally recommended at birth for every newborn. Instead, the first precious dose would now be reserved for infants whose mothers carried a known infection risk. This significant policy shift, born from evolving data and expert consensus, aimed to refine protection. For new parents, it meant another layer of medical nuance to understand, another careful balance struck in safeguarding the most fragile lives.",
        "originalSource": "The Guardian",
        "publishedTime": "19 minutes ago"
      },
      {
        "id": "story-1764996056693-5",
        "headline": "The Unraveling Wall",
        "content": "The Louisiana night swallowed two figures, fugitives from stone and steel. Inside the correctional facility, a damaged wall now gaped, a testament to desperation and ingenuity. These two men, both marked by violent charges, had meticulously pried loose pieces, then used crude ropes of tied-together sheets to scale their way to freedom. Alarms shrieked, sirens wailed, but the bayous and dense foliage offered a temporary reprieve. A relentless manhunt ignited, officers fanning out, their flashlights cutting through the darkness, determined to reclaim those who had dared to break free.",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      }
    ]
  }
}