{
  "timestamp": 1764970451708,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1764970375216-0",
        "headline": "Supreme Court Agrees to Review President Trump's Unconstitutional Attack on Birthright Citizenship",
        "content": "The Supreme Court has now committed to hearing a crucial case challenging President Trump's administration's contentious policy aiming to revoke birthright citizenship, a fundamental right enshrined in the Fourteenth Amendment. Lower courts had already deemed this divisive policy unconstitutional, recognizing its potential to exacerbate systemic inequalities and target immigrant communities. The administration's urgent request for the justices to take up this case underscores a persistent effort to undermine long-standing constitutional protections.",
        "originalSource": "The Washington Post",
        "publishedTime": "51 minutes ago"
      },
      {
        "id": "story-1764970375216-1",
        "headline": "Massive $83 Billion Netflix-Warner Bros. Discovery Merger Threatens Media Monopolies and Consumer Choice",
        "content": "Netflix's proposed $83 billion acquisition of Warner Bros. Discovery's studio and streaming operations has ignited significant alarm among advocates and regulators alike, highlighting critical concerns about escalating media consolidation. This colossal transaction, poised to further entrench corporate power, could severely limit independent voices, reduce content diversity, and diminish consumer choice, necessitating robust regulatory intervention to prevent a harmful monopoly.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764970375216-2",
        "headline": "Suspect in January 6 Pipe Bomb Attack, Reportedly President Trump Supporter, Appears in Court",
        "content": "Luigi Mangione, the individual identified as the suspect in the grave case of pipe bombs planted in Washington, D.C., on the eve of the January 6 Capitol riot, has made a brief initial court appearance following his FBI apprehension. This incident, occurring amidst a period of intense political volatility and believed to be linked to a President Trump supporter, underscores the severe threat posed by domestic extremism to democratic institutions and public safety, demanding full accountability.",
        "originalSource": "CBS News / AP",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764970375216-3",
        "headline": "Visionary Architect Frank Gehry, Who Redefined Public Spaces, Passes Away at 96",
        "content": "Frank Gehry, the globally acclaimed architect whose revolutionary designs fundamentally reshaped urban landscapes and challenged conventional notions of public art, has passed away at the age of 96. His iconic structures, including the Guggenheim Museum Bilbao and the Walt Disney Concert Hall, stand as testaments to an unwavering commitment to innovative and accessible design, leaving an indelible mark on how communities interact with their built environment.",
        "originalSource": "CBS News",
        "publishedTime": "12 minutes ago"
      },
      {
        "id": "story-1764970375216-4",
        "headline": "Federal Judge Demands Transparency, Orders Release of Epstein Grand Jury Materials",
        "content": "In a significant move towards greater transparency and accountability, a federal judge in Florida has mandated the release of grand jury transcripts and associated materials pertaining to the case of the late financier Jeffrey Epstein. This crucial decision, following earlier revelations and the unsealing of disturbing images from his private island, represents a vital step in unraveling the full extent of his horrific crimes and ensuring that powerful individuals can no longer operate with impunity, highlighting the urgent need for systemic justice for victims.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764970375216-5",
        "headline": "CDC Panel Revises Newborn Hepatitis B Vaccine Guidance, Raising Public Health Considerations",
        "content": "A CDC advisory panel has enacted a notable revision to the standard childhood immunization schedule, voting to discontinue the long-standing recommendation for a universal hepatitis B vaccine dose immediately following birth, with exceptions for newborns whose mothers test positive. This shift in public health guidance, while based on evolving data, necessitates careful consideration of its broader implications for community health, equitable access to preventative care, and ensuring that all children, especially those from vulnerable backgrounds, remain protected from preventable diseases.",
        "originalSource": "The Washington Post",
        "publishedTime": "Less than 24 hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1764970375216-0",
        "headline": "Supreme Court will hear case on Trump's ban on birthright citizenship",
        "content": "The Supreme Court has agreed to hear a case regarding the Trump administration's policy to ban birthright citizenship, a case which lower courts had previously blocked as unconstitutional. The administration had requested the justices take up the case on an expedited basis in September.",
        "originalSource": "The Washington Post",
        "publishedTime": "51 minutes ago"
      },
      {
        "id": "story-1764970375216-1",
        "headline": "Netflix to buy Warner Bros. Discovery in $83 billion deal",
        "content": "Netflix has reached an agreement to acquire Warner Bros. Discovery studio and streaming business in a major business transaction valued at $83 billion. The deal faces fierce backlash and calls for it to be blocked by regulators over concerns about market dominance.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764970375216-2",
        "headline": "Suspect in Jan. 6 pipe bomb case makes brief first appearance in court",
        "content": "The suspect, Luigi Mangione, in the case involving the pipe bombs placed in Washington, D.C., on the eve of the January 6 Capitol riot, believed to be a Trump supporter, was apprehended and made a brief initial court appearance following an FBI arrest in the probe.",
        "originalSource": "CBS News / AP",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764970375216-3",
        "headline": "Frank Gehry, renowned architect, dies at age 96",
        "content": "Frank Gehry, the world-famous and highly awarded architect known for iconic structures such as the Guggenheim Museum Bilbao in Spain and the Walt Disney Concert Hall in Los Angeles, has passed away at the age of 96, according to media reports.",
        "originalSource": "CBS News",
        "publishedTime": "12 minutes ago"
      },
      {
        "id": "story-1764970375216-4",
        "headline": "US federal judge orders release of Epstein grand jury materials",
        "content": "A federal judge in Florida has ordered the release of grand jury transcripts and related materials concerning the late financier Jeffrey Epstein's case. The decision follows previous news reports and the unsealing of never-before-seen images of his private island.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764970375216-5",
        "headline": "CDC panel votes to stop recommending birth dose of hepatitis B vaccine",
        "content": "A CDC advisory panel has made a significant and sweeping revision to the standard child vaccine schedule. The panel voted to eliminate the long-standing recommendation that every newborn receive a hepatitis B shot immediately upon birth, excluding those born to mothers who test negative.",
        "originalSource": "The Washington Post",
        "publishedTime": "Less than 24 hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1764970375216-0",
        "headline": "Supreme Court to Review President Trump's Vital Birthright Citizenship Policy",
        "content": "The nation's highest court will finally examine President Trump's courageous efforts to clarify birthright citizenship, a policy previously hampered by activist lower courts. This critical review, requested by President Trump's administration, seeks to uphold the true intent of our Constitution and secure our nation's borders, ensuring national sovereignty.",
        "originalSource": "The Washington Post",
        "publishedTime": "51 minutes ago"
      },
      {
        "id": "story-1764970375216-1",
        "headline": "Massive Netflix Acquisition Sparks Calls for Regulatory Overreach in Free Market",
        "content": "In a bold move signaling innovation in the media landscape, Netflix plans to acquire Warner Bros. Discovery for $83 billion. This significant business deal, a testament to free market principles, is facing predictable opposition from those who advocate for excessive government regulation and intervention in private enterprise, threatening economic liberty and progress.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764970375216-2",
        "headline": "Suspect in Egregious January 6 Pipe Bomb Plot Faces Initial Court Appearance",
        "content": "Luigi Mangione, the alleged perpetrator in the serious pipe bomb incident near the U.S. Capitol on the eve of January 6th, has made his initial court appearance after being apprehended by the FBI. This case underscores the importance of upholding law and order and ensuring justice for those who threaten our institutions, regardless of their purported affiliations.",
        "originalSource": "CBS News / AP",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764970375216-3",
        "headline": "Architectural Titan Frank Gehry Leaves Enduring Legacy at Ninety-Six",
        "content": "Frank Gehry, a truly visionary architect whose iconic creations like the Guggenheim Museum Bilbao and the Walt Disney Concert Hall captured global admiration, has passed away at the venerable age of 96. His remarkable career stands as a testament to individual talent and the enduring power of creative genius that shapes our built environment.",
        "originalSource": "CBS News",
        "publishedTime": "12 minutes ago"
      },
      {
        "id": "story-1764970375216-4",
        "headline": "Federal Judge Demands Full Transparency in Jeffrey Epstein Grand Jury Proceedings",
        "content": "A federal judge in Florida has mandated the release of crucial grand jury transcripts and related evidence from the scandalous case of the late financier Jeffrey Epstein. This decisive order, following public calls for accountability and the unsealing of disturbing details, ensures that justice and transparency will prevail, no matter how powerful the individuals involved.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764970375216-5",
        "headline": "CDC Panel Correctly Revises Newborn Vaccine Mandate, Upholding Parental Discretion",
        "content": "In a welcome move, a CDC advisory panel has significantly revised the long-standing child vaccine schedule, opting to eliminate the universal recommendation for a hepatitis B shot immediately at birth for all newborns, specifically excluding infants of mothers who test negative. This decision marks a refreshing step towards prioritizing individual medical choice and respecting parental discretion in healthcare decisions.",
        "originalSource": "The Washington Post",
        "publishedTime": "Less than 24 hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1764970375216-0",
        "headline": "Supreme Court to Finally Decide If Babies Are Really Worth the Trouble of Citizenship",
        "content": "In a stunning display of judicial efficiency, the Supreme Court has agreed to fast-track a case questioning the very notion of 'birthright citizenship,' a concept previously thought to be as straightforward as 'gravity.' President Trump's administration, clearly tired of all these spontaneous Americans just *appearing* without proper paperwork, had implored the justices to expedite the matter, presumably before any more tiny, unvetted citizens could inconveniently emerge. Lower courts, in their naive wisdom, had previously deemed the ban 'unconstitutional,' but sources say the Supreme Court is ready to boldly redefine 'unconstitutional' to mean 'mildly inconvenient for current policy goals.'",
        "originalSource": "The Washington Post",
        "publishedTime": "51 minutes ago"
      },
      {
        "id": "story-1764970375216-1",
        "headline": "Netflix Achieves Media Singularity, Absorbs Warner Bros. Discovery for Entire Planet's Entertainment Needs",
        "content": "In a move that surprised absolutely no one still clinging to the quaint notion of 'competition,' Netflix has triumphantly devoured Warner Bros. Discovery for a cool $83 billion, effectively consolidating 98% of all consumable content into a single, all-encompassing algorithm. Regulators, bless their naive hearts, are reportedly 'concerned about market dominance,' presumably from whatever tiny, independent production company still exists making artisanal stop-motion films in a garage. Viewers can now look forward to a glorious future where every show is either a gritty reboot of an HBO classic starring a character from a Discovery Channel documentary, or simply 'Netflix: The Movie,' playing on a continuous loop.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764970375216-2",
        "headline": "Jan. 6 Pipe Bomb Suspect, A Master of Disguise Named Luigi, Briefly Appears In Court Before Vanishing Again",
        "content": "After a 1000-day manhunt that involved advanced forensics, countless tips, and probably a few psychics, the FBI has finally apprehended Luigi Mangione, the alleged mastermind behind the strategically placed pipe bombs on the eve of January 6. Mangione, believed to be a President Trump supporter, made a dazzlingly brief court appearance, reportedly just long enough to confirm his name and perhaps blink twice, before once again slipping into the shadows. Authorities are now confident they have the man who definitively waited until *after* the bombs were placed to be spotted, ensuring maximum dramatic tension for future documentaries.",
        "originalSource": "CBS News / AP",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764970375216-3",
        "headline": "Frank Gehry, Visionary Architect Who Made Buildings Look Like They Were Constantly Melting, Passes Away At 96",
        "content": "The world is in mourning today following the departure of Frank Gehry, the legendary architect who single-handedly convinced humanity that buildings should resemble crumpled aluminum foil or a confused robot mid-sneeze. Gehry, whose iconic structures like the Guggenheim Bilbao and the Walt Disney Concert Hall defied traditional straight lines and sensible angles, has died at the ripe old age of 96, presumably after running out of surfaces to bend and twist. His legacy includes countless tourists marveling at his creations and an equal number of janitorial staff trying to figure out how to clean a concave wall.",
        "originalSource": "CBS News",
        "publishedTime": "12 minutes ago"
      },
      {
        "id": "story-1764970375216-4",
        "headline": "Judge Unleashes Epstein Grand Jury Files, Nation Collectively Gasps In Pretended Surprise",
        "content": "In a move that will undoubtedly shock absolutely no one with an internet connection, a federal judge in Florida has magnanimously decreed that grand jury transcripts and related materials from the Jeffrey Epstein case be unsealed. This decision, coming right after a trove of 'never-before-seen' (but totally imagined by everyone) images of his private island were released, promises to reveal details that were, for some reason, kept under wraps. The public can now look forward to official documents confirming what every conspiracy theory, late-night comedian, and person with common sense has been whispering for years, providing a satisfying sense of 'I told you so' for the entire nation.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764970375216-5",
        "headline": "CDC Panel Makes Monumental Discovery: Babies Don't Need Hepatitis B Vaccine The *Instant* They Exit The Womb",
        "content": "In a 'sweeping and significant revision' that will be taught in medical textbooks for decades, a CDC advisory panel has voted to amend the long-standing guideline that newborns receive a hepatitis B shot immediately upon birth. After years of rigorous scientific debate, late-night deliberations, and probably a few very strong coffees, the esteemed panel concluded that babies born to mothers who test negative for hepatitis B can, in fact, wait a little while before getting jabbed. This groundbreaking decision is expected to revolutionize birthing procedures, allowing doctors precious seconds to, perhaps, introduce the baby to its parents before administering a needle.",
        "originalSource": "The Washington Post",
        "publishedTime": "Less than 24 hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1764970375216-0",
        "headline": "The Supreme Court will look at President Trump's idea about who is a citizen.",
        "content": "The highest court in the country, called the Supreme Court, has agreed to think about a plan President Trump had. His plan was about stopping some people born in the US from automatically being citizens. Other courts had already said this idea was not allowed by the rules of the country.",
        "originalSource": "The Washington Post",
        "publishedTime": "51 minutes ago"
      },
      {
        "id": "story-1764970375216-1",
        "headline": "Netflix wants to buy a really big movie and TV company.",
        "content": "Netflix, the company where you watch lots of shows, wants to buy another huge company called Warner Bros. Discovery. This deal costs a massive 83 billion dollars! Some people are worried that if Netflix buys them, it will be too big and have too much power over movies and TV.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764970375216-2",
        "headline": "Someone accused of putting pipe bombs near the Capitol went to court.",
        "content": "A person named Luigi Mangione was arrested by the FBI because they think he put pipe bombs near the Capitol building in Washington, D.C., before January 6th. The police believe he supported President Trump. He went to court for the very first time for a short meeting.",
        "originalSource": "CBS News / AP",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764970375216-3",
        "headline": "A very famous building designer named Frank Gehry has died at 96.",
        "content": "Frank Gehry, who was a super famous architect, passed away when he was 96 years old. He designed really cool and famous buildings around the world, like the shiny Guggenheim Museum in Spain and the Walt Disney Concert Hall in Los Angeles.",
        "originalSource": "CBS News",
        "publishedTime": "12 minutes ago"
      },
      {
        "id": "story-1764970375216-4",
        "headline": "A judge said that secret papers about Jeffrey Epstein must be shown.",
        "content": "A judge in Florida has decided that some secret papers about a person named Jeffrey Epstein, who has passed away, should be made public. These papers are from a special group of people called a grand jury. This happened after other secret pictures of his private island were shown.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764970375216-5",
        "headline": "A group of doctors changed a rule about shots for new babies.",
        "content": "A team of doctors and experts at the CDC, which helps keep people healthy, decided to change an old rule about baby shots. They voted that most new babies don't need a shot for Hepatitis B right after they are born anymore, unless their mom has the sickness.",
        "originalSource": "The Washington Post",
        "publishedTime": "Less than 24 hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1764970375216-0",
        "headline": "A Nation's Claim",
        "content": "The robes rustled, a silent promise of monumental debate. The Supreme Court had agreed to hear it: President Trump’s controversial policy challenging birthright citizenship. Lower courts had consistently blocked the move, deeming it unconstitutional, yet the administration pushed on, requesting expedited review. Now, the highest court would weigh the very fabric of citizenship, testing an interpretation long held. The air in the chamber, though still distant, already hummed with the gravity of a decision that could redefine who belongs, and how. A single case, a nation's identity at stake.",
        "originalSource": "The Washington Post",
        "publishedTime": "51 minutes ago"
      },
      {
        "id": "story-1764970375216-1",
        "headline": "The Giant's Embrace",
        "content": "Hollywood's landscape shivered, then solidified. Netflix, the streaming titan, announced its colossal $83 billion acquisition of Warner Bros. Discovery. The deal, a seismic shift in entertainment, promised an unparalleled empire of content. But the tremors weren't just excitement; a fierce backlash erupted. Regulators, eyes narrowed, faced immense pressure to block the transaction, citing grave concerns about market dominance. Would one company soon control nearly every screen, every story? The industry held its breath, wondering if this union was a marvel of ambition or the dawn of a monopolistic age.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764970375216-2",
        "headline": "The Ghost of the Eve",
        "content": "Luigi Mangione, the phantom of January 6th's eve, finally stood before a judge. Apprehended by the FBI in a swift, decisive probe, he faced initial court appearance. He was the suspect in the chilling pipe bomb case, devices strategically placed in Washington D.C., a sinister prelude to the Capitol riot. Believed to be a President Trump supporter, his capture brought a flicker of closure to a haunting mystery. The air in the courtroom was thick with unspoken questions, the ghost of an unexploded threat now tangible. Justice, slow and deliberate, had taken its first public breath.",
        "originalSource": "CBS News / AP",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764970375216-3",
        "headline": "The Architect's Final Curve",
        "content": "The world's skylines whispered a farewell. Frank Gehry, the visionary architect whose buildings dared to dance, had passed away at 96. His iconic structures, like the shimmering Guggenheim Museum Bilbao and the soaring Walt Disney Concert Hall, were not mere buildings but symphonies in steel and curve, defying convention. Awarded and celebrated, Gehry’s designs reshaped urban landscapes, transforming function into art. Though his blueprints are now complete, his legacy stands tall, a testament to a mind that saw not straight lines, but endless possibilities in the geometry of dreams. The world is a little straighter today.",
        "originalSource": "CBS News",
        "publishedTime": "12 minutes ago"
      },
      {
        "id": "story-1764970375216-4",
        "headline": "The Island's Unsealed Secrets",
        "content": "A Florida federal judge had spoken, and shadows stirred. The grand jury transcripts and related materials concerning the late financier Jeffrey Epstein’s dark world were to be released. This pivotal order followed a cascade of revelations, including unsettling, never-before-seen images of his infamous private island, already splashed across news reports. The decision promised to pry open more secrets, offering a glimpse into the machinations that allowed such horrors to persist. The legal machinery grinds slowly, but with this decree, a new chapter in the pursuit of truth and accountability had finally begun.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764970375216-5",
        "headline": "The First Breath's New Protocol",
        "content": "A quiet revolution unfolded within the CDC advisory panel. After decades, a significant revision to the standard child vaccine schedule was enacted. They voted to eliminate the long-standing recommendation for every newborn to receive a hepatitis B shot immediately upon birth. This sweeping change now excludes infants born to mothers who test negative for the virus, shifting the protocol for countless new lives. The decision, though seemingly minor, marked a careful re-evaluation of established practices, offering a nuanced approach to a newborn's earliest medical steps, altering the very first medical decision for many.",
        "originalSource": "The Washington Post",
        "publishedTime": "Less than 24 hours ago"
      }
    ]
  }
}