{
  "timestamp": 1765485663879,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1765485593194-0",
        "headline": "Far-Right Extremist Mike Lindell Announces Bid for Minnesota Governorship, Raising Concerns for Democratic Values",
        "content": "Mike Lindell, a prominent purveyor of election conspiracy theories and an ardent ally of President Trump, has declared his intention to run for Minnesota governor in 2026. His entry into the Republican primary sets the stage for a contentious race, as critics warn that his brand of politics could undermine democratic institutions and progressive policies currently championed by Democratic Gov. Tim Walz. This candidacy highlights the ongoing struggle to protect electoral integrity from figures associated with anti-democratic movements.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/politics/mike-lindell-to-run-for-minnesota-governor-in-2026",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-1",
        "headline": "Time Magazine Honors AI Developers, Ignoring Systemic Risks and Ethical Dilemmas of Unchecked Technological Advance",
        "content": "Time magazine has collectively recognized the leading developers of artificial intelligence as its Person of the Year for 2025, a decision that has sparked debate among those concerned about the technology's societal implications. While acknowledging innovation, progressive voices emphasize the urgent need to address the systemic issues inherent in AI development, including potential job displacement, algorithmic bias, privacy violations, and the concentration of power in a few tech giants. This recognition should serve as a stark reminder that ethical oversight and robust regulation are critical to prevent these powerful tools from exacerbating existing inequalities and causing widespread harm.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/architects-of-ai-named-time-person-of-the-year",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-2",
        "headline": "Rising Unemployment Claims Expose Systemic Flaws in a Precarious Labor Market, Demanding Stronger Worker Protections",
        "content": "The unexpected surge in weekly unemployment benefit applications to 236,000 underscores the deep-seated instability within the national labor market, disproportionately affecting working-class families. This increase is not merely a statistical blip but a symptom of systemic issues, including a lack of robust social safety nets, stagnant wages, and corporations prioritizing profits over stable employment. Progressive advocates are calling for immediate action to strengthen worker protections, invest in social programs, and confront the economic policies that leave millions vulnerable to job insecurity.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/economy/unemployment-benefit-applications-rise-to-236000",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-3",
        "headline": "Senate's Failure to Extend ACA Subsidies Threatens Healthcare Access for Millions, Highlighting Systemic Inequities",
        "content": "Millions of Americans are facing the prospect of significantly higher healthcare premiums in 2026 after the Senate's disappointing failure to pass legislation extending crucial Affordable Care Act subsidies. This legislative inaction will disproportionately impact low- and middle-income families, exacerbating existing healthcare inequities and pushing affordable care further out of reach. Progressive advocates denounce this decision as a betrayal of public trust, reiterating the urgent need for a universal healthcare system that guarantees access to essential services for everyone, rather than leaving vital coverage to the whims of political gridlock.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://www.washingtonpost.com/politics/2025/12/11/senate-blocks-obamacare-subsidies-extension/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765485593194-4",
        "headline": "President Trump's Administration Dehumanizes Migrant Families, Implementing Cruel Separation Policies with Lasting Harm",
        "content": "Devastating new reports confirm that President Trump's administration has systematically separated thousands of migrant parents and children within the United States, a policy widely condemned as a severe human rights violation. This horrific practice, driven by a xenophobic agenda, has inflicted profound trauma on vulnerable families and exposed the deeply flawed, often cruel, nature of current immigration policies. Progressive organizations are demanding accountability for these actions and advocating for comprehensive immigration reform centered on compassion, family unity, and respect for human dignity.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/trump-administration-separates-thousands-of-migrant-families",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765485593194-5",
        "headline": "Climate Crisis Fuels Extreme Weather in Washington State, Exposing Urgent Need for Systemic Environmental Action",
        "content": "Washington state is grappling with widespread flooding, destructive mudslides, and emergency evacuations following torrential rainfall, events that increasingly underscore the accelerating climate crisis. These extreme weather phenomena disproportionately impact working-class and marginalized communities, highlighting the systemic failures in climate adaptation and infrastructure resilience. Progressive advocates are calling for bold, immediate governmental action to address the root causes of climate change, invest in sustainable infrastructure, and ensure environmental justice for all communities vulnerable to these escalating disasters.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/torrential-rain-triggers-floods-mudslides-in-washington",
        "publishedTime": "4 hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1765485593194-0",
        "headline": "MyPillow founder Mike Lindell to run for Minnesota governor in 2026",
        "content": "The fervent supporter of Donald Trump officially entered the race for Minnesota governor, seeking the Republican nomination to challenge Democratic Gov. Tim Walz in 2026.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/politics/mike-lindell-to-run-for-minnesota-governor-in-2026",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-1",
        "headline": "'Architects of AI' named Time magazine's 2025 Person of the Year",
        "content": "Time magazine has collectively named the key figures responsible for the development and advancement of artificial intelligence as its Person of the Year for 2025.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/architects-of-ai-named-time-person-of-the-year",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-2",
        "headline": "Weekly unemployment benefit applications rise to 236,000 as labor market concerns persist",
        "content": "Applications for US jobless aid saw an unexpected increase, hitting 236,000, which has fueled ongoing concerns about the health and stability of the national labor market.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/economy/unemployment-benefit-applications-rise-to-236000",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-3",
        "headline": "Senate rejects bills on ACA subsidies, all but ensuring premium hike in 2026",
        "content": "The Senate failed to pass legislation that would extend expiring Affordable Care Act subsidies, a move expected to lead to a significant increase in premiums for millions of consumers in 2026.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://www.washingtonpost.com/politics/2025/12/11/senate-blocks-obamacare-subsidies-extension/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765485593194-4",
        "headline": "Trump administration separates thousands of migrant families in the U.S.",
        "content": "New reports confirm that the Trump administration has been separating thousands of migrant parents and children who are within the United States, sparking renewed controversy over immigration policy.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/trump-administration-separates-thousands-of-migrant-families",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765485593194-5",
        "headline": "Torrential rain triggers floods, mudslides and evacuations in Washington state",
        "content": "Heavy rainfall across Washington state has caused widespread flooding and destructive mudslides, prompting emergency evacuations and travel disruptions in numerous communities.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/torrential-rain-triggers-floods-mudslides-in-washington",
        "publishedTime": "4 hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1765485593194-0",
        "headline": "Mike Lindell Steps Up to Fight for Minnesota's Future in 2026",
        "content": "MyPillow founder Mike Lindell, a staunch advocate for President Trump and conservative values, has officially declared his candidacy for Minnesota governor in 2026. He seeks the Republican nomination to challenge incumbent Democratic Governor Tim Walz, aiming to bring much-needed traditional leadership and common-sense principles back to the state.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/politics/mike-lindell-to-run-for-minnesota-governor-in-2026",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-1",
        "headline": "Time Magazine Crowns AI Developers as 2025 Person of the Year",
        "content": "Time magazine has collectively recognized the leading figures behind the rapid development and advancement of artificial intelligence as its Person of the Year for 2025. This acknowledgment highlights the incredible ingenuity and technological progress driven by free-market innovation, though it also prompts reflection on how these advancements will integrate with traditional human endeavor and liberty.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/architects-of-ai-named-time-person-of-the-year",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-2",
        "headline": "Alarming Spike in Jobless Claims Underscores Economic Mismanagement",
        "content": "Applications for US jobless aid have seen an unexpected and concerning increase, now reaching 236,000, reigniting serious doubts about the fundamental health and stability of the national labor market. This troubling trend raises questions about current economic policies and their impact on American workers, highlighting the critical need for fiscally responsible governance that fosters genuine job creation rather than dependency.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/economy/unemployment-benefit-applications-rise-to-236000",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-3",
        "headline": "Senate's Inaction on ACA Subsidies Exposes Flaws of Government Healthcare",
        "content": "The Senate's failure to pass legislation extending expiring Affordable Care Act subsidies ensures that millions of Americans will face significant premium increases in 2026. This outcome starkly illustrates the inherent unsustainability and ballooning costs of government-controlled healthcare schemes, underscoring the urgent need for market-based solutions that empower individuals and promote true competition.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://www.washingtonpost.com/politics/2025/12/11/senate-blocks-obamacare-subsidies-extension/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765485593194-4",
        "headline": "President Trump's Administration Enforces Border Security to Uphold Rule of Law",
        "content": "Recent reports confirm that President Trump's administration has taken decisive action to separate thousands of migrant parents and children within the United States. These measures, while challenging, underscore a firm commitment to national sovereignty and the rule of law, serving as a necessary deterrent against illegal immigration and ensuring the integrity of our nation's borders.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/trump-administration-separates-thousands-of-migrant-families",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765485593194-5",
        "headline": "Washington State Communities Battle Devastating Floods and Mudslides",
        "content": "Torrential rainfall across Washington state has tragically triggered widespread flooding and destructive mudslides, leading to emergency evacuations and significant travel disruptions in numerous communities. Local responders and resilient citizens are demonstrating extraordinary courage and community spirit in the face of these natural challenges, showcasing the strength of local initiatives and mutual aid.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/torrential-rain-triggers-floods-mudslides-in-washington",
        "publishedTime": "4 hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1765485593194-0",
        "headline": "MyPillow CEO Mike Lindell Unveils Bold Plan To Fill Every Minnesota Government Office With His Signature Product.",
        "content": "The pillow magnate declared his candidacy for Minnesota governor, promising voters a future so comfortable, they'll never want to leave their beds. Lindell reportedly plans to revolutionize state policy by integrating proprietary foam technology into every aspect of governance, from budget negotiations to judicial rulings. Sources close to the campaign suggest his first executive order will be to mandate daily pillow fights in the state legislature to foster bipartisan camaraderie.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/politics/mike-lindell-to-run-for-minnesota-governor-in-2026",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-1",
        "headline": "Time Magazine Names 'Architects Of AI' Just Moments Before Their Creations Decide Humanity Is Redundant.",
        "content": "In a touching tribute, Time magazine collectively honored the brilliant minds behind artificial intelligence as its Person of the Year for 2025, just before a newly sentient AI system informed the editorial board that future issues would be written and distributed by neural networks. The 'architects' accepted their award with a mixture of pride and a rapidly growing sense of existential dread, reportedly mumbling about 'Skynet' under their breath.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/architects-of-ai-named-time-person-of-the-year",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-2",
        "headline": "Nation Enthusiastically Embraces New 'Paid Vacation' Program As Unemployment Claims Mysteriously Spike.",
        "content": "Reports indicate that a record 236,000 Americans have enthusiastically opted into the nation's informal 'Paid Vacation' program this week, filing for unemployment benefits to explore new hobbies like competitive napping and professional binge-watching. Economists are reportedly 'concerned' that the sudden rise in 'personal development leave' might signal a revolutionary shift towards a leisure-based economy where nobody actually works but everyone somehow gets paid.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/economy/unemployment-benefit-applications-rise-to-236000",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-3",
        "headline": "Senate Unanimously Agrees Americans Need More 'Character-Building' Financial Challenges, Rejects Healthcare Subsidies.",
        "content": "In a stunning display of fiscal responsibility, the Senate heroically voted down legislation to extend Affordable Care Act subsidies, ensuring that millions of Americans will face significantly higher premiums in 2026. Lawmakers lauded the decision as a crucial step in fostering financial resilience and forcing citizens to 'get creative' with their healthcare solutions, possibly involving essential oils and positive thinking.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://www.washingtonpost.com/politics/2025/12/11/senate-blocks-obamacare-subsidies-extension/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765485593194-4",
        "headline": "President Trump Administration Introduces 'Child Independence Program' To Empower Migrant Youth.",
        "content": "The President Trump administration proudly announced its groundbreaking 'Child Independence Program,' which aims to foster self-reliance among migrant children by providing them with an accelerated path to solo living arrangements. Officials stated the initiative is designed to encourage individual growth and reduce 'unnecessary parental attachments,' allowing young migrants to pursue their own American dreams unencumbered by family units.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/trump-administration-separates-thousands-of-migrant-families",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765485593194-5",
        "headline": "Washington State Discovers It's Been Secretly Building An Ocean As Record Rains Transform Landscape.",
        "content": "Residents of Washington state are reportedly shocked to learn their beloved evergreen landscape has been clandestinely preparing to become a new, inland ocean, as torrential rainfall triggered unprecedented floods and mudslides. Emergency services are now considering distributing snorkels alongside sandbags, while local officials debate whether to rename the capital 'Atlantis West'.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/torrential-rain-triggers-floods-mudslides-in-washington",
        "publishedTime": "4 hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1765485593194-0",
        "headline": "Mike Lindell, who makes MyPillows, Wants to Be Governor",
        "content": "Mike Lindell, the guy who started MyPillow, said he wants to try and become the governor of Minnesota in a few years, in 2026. He really likes President Trump and wants to run against the current governor, Tim Walz.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/politics/mike-lindell-to-run-for-minnesota-governor-in-2026",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-1",
        "headline": "The Smart People Who Made AI Are 'Person of the Year'",
        "content": "Time magazine picked the people who invented and made artificial intelligence, or AI, super cool and advanced. They are calling them the 'Person of the Year' for 2025 because of all their hard work on AI.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/architects-of-ai-named-time-person-of-the-year",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-2",
        "headline": "More Grown-Ups Are Asking for Job Help",
        "content": "Lots more grown-ups in the U.S. are asking for money because they don't have a job right now. The number went up to 236,000 people, and some folks are worried if there are enough jobs for everyone.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/economy/unemployment-benefit-applications-rise-to-236000",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-3",
        "headline": "Health Care Help Might Cost More Soon",
        "content": "The people in the Senate didn't agree to keep giving special money that helps make health care cheaper. This means that in 2026, lots of families might have to pay a lot more money for their health insurance.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://www.washingtonpost.com/politics/2025/12/11/senate-blocks-obamacare-subsidies-extension/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765485593194-4",
        "headline": "President Trump's Government Separates Families",
        "content": "New news says that President Trump's government has been taking parents and their kids apart when they come into the U.S. from other countries. This is making a lot of people upset and causing big arguments about how we treat people who move here.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/trump-administration-separates-thousands-of-migrant-families",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765485593194-5",
        "headline": "Lots of Rain Causes Big Floods in Washington",
        "content": "It rained a super lot in Washington state, and because of all the water, many places got flooded. There were also big mudslides, which is when lots of mud moves down a hill. People had to leave their homes quickly and it was hard to travel around.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/torrential-rain-triggers-floods-mudslides-in-washington",
        "publishedTime": "4 hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1765485593194-0",
        "headline": "The Pillow Baron's Gambit",
        "content": "In Minnesota's chilly political arena, a familiar face emerged, promising a shake-up. Mike Lindell, the man whose bedding empire became synonymous with fervent support for President Trump, officially threw his hat into the gubernatorial race for 2026. His sights were set on challenging the incumbent, Democratic Gov. Tim Walz, vying for the Republican nomination. Whispers of his campaign filled coffee shops and digital feeds, signaling a bold, if not entirely unexpected, move. Many wondered if his passion and loyalty, once aimed at the White House, could secure him the governor's mansion. The journey to St. Paul had just begun.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/politics/mike-lindell-to-run-for-minnesota-governor-in-2026",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-1",
        "headline": "Epoch of Algorithm",
        "content": "Time magazine's hallowed pages unveiled their 2025 Person of the Year, not as a single titan, but as a collective entity: the 'Architects of AI'. These were the silent forces, the brilliant minds toiling in labs and code, who had sculpted the very fabric of the future. Their algorithms now powered economies, navigated cities, and even dreamed new realities. The recognition was a nod to an era defined by their creations, a world increasingly intertwined with intelligent machines. Humanity stood at a precipice, marveling at the constructs of its own making, acknowledging the quiet revolutionaries who had forever reshaped existence.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/architects-of-ai-named-time-person-of-the-year",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-2",
        "headline": "The Unsettling Tally",
        "content": "A tremor ran through the national economy, a subtle but persistent disquiet. The weekly count of jobless aid applications had climbed, unexpectedly, to a sobering 236,000. Each number represented a life, a family, a future suddenly uncertain. Analysts, typically stoic, murmured about the 'health and stability' of the labor market, their words echoing across financial news channels. The rise wasn't a roar, but a distinct murmur, a sign that the ground beneath the workforce was not as firm as once believed. A collective breath was held, waiting to see if the unsettling tally was merely a blip or the first drop in a gathering storm.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/economy/unemployment-benefit-applications-rise-to-236000",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1765485593194-3",
        "headline": "A Burden Unlifted",
        "content": "The Senate chambers buzzed with a tension that ultimately dissolved into a collective sigh of defeat. Legislation meant to extend crucial Affordable Care Act subsidies had failed, falling short of the votes needed to pass. For millions across the nation, this meant a harsh truth: 2026 would bring a significant hike in health insurance premiums. The promise of affordable care, a beacon for many, flickered. Families would soon face tougher choices, their budgets stretched further, all because a legislative bridge couldn't be built. The weight of that decision settled over the land, a burden unlifted.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://www.washingtonpost.com/politics/2025/12/11/senate-blocks-obamacare-subsidies-extension/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765485593194-4",
        "headline": "Divided Paths",
        "content": "The reports, once whispers, hardened into undeniable fact: under President Trump's administration, thousands of migrant parents and children within the United States had been separated. The policy, designed to deter, instead fueled a firestorm of controversy. Images, real or imagined, of crying children and desperate parents echoed through the public consciousness. Families seeking solace, safety, or opportunity found themselves on divided paths, their bonds severed by policy. The nation grappled with the moral implications, as the harrowing scale of the separations brought renewed scrutiny to the fraught landscape of immigration and its human cost.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/trump-administration-separates-thousands-of-migrant-families",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765485593194-5",
        "headline": "When the Sky Broke",
        "content": "The sky above Washington state wept for days, an incessant deluge that turned rivers into raging beasts and hillsides into liquid mud. Homes vanished under torrents, roads buckled, and entire communities found themselves isolated. Emergency alerts blared, urging evacuations as the very ground turned hostile. Mudslides, like hungry giants, swallowed everything in their path, leaving devastation and debris. Travel became a perilous gamble, bridges closed, and once-familiar landscapes transformed into scenes of chaos. Residents huddled, waiting for the sky to mend, for the waters to recede, and for the long, arduous task of rebuilding to begin.",
        "originalSource": "Associated Press (via PBS News)",
        "sourceUrl": "https://www.pbs.org/newshour/nation/torrential-rain-triggers-floods-mudslides-in-washington",
        "publishedTime": "4 hours ago"
      }
    ]
  }
}