{
  "timestamp": 1764999598956,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1764999517453-0",
        "headline": "Supreme Court Agrees to Hear Challenge to President Trump's Divisive Attack on Birthright Citizenship, Threatening Core Constitutional Protections.",
        "content": "The nation's highest court has agreed to review a significant case challenging President Trump's administration's move to dismantle birthright citizenship, setting the stage for a critical battle over the foundational principles of the 14th Amendment. This politically motivated legal challenge could undermine decades of settled law and disproportionately harm vulnerable communities, signaling a dangerous erosion of rights for children born on U.S. soil. Progressive voices warn that this case represents a profound threat to the inclusive vision of American citizenship.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764999517453-1",
        "headline": "Suspect in January 6th-Related Pipe Bomb Plot Reportedly Confesses, Revealing Ties to Right-Wing Extremism.",
        "content": "Brian Cole Jr., the individual suspected in the serious 2021 pipe bomb case targeting the DNC and RNC headquarters, has reportedly confessed to federal investigators. Disturbingly, sources suggest the suspect is a known supporter of President Trump, further underscoring the escalating threat of right-wing political violence and radicalization against democratic institutions. This confession highlights the urgent need to address the underlying ideologies fueling such dangerous acts.",
        "originalSource": "AP News",
        "publishedTime": "8 hours ago"
      },
      {
        "id": "story-1764999517453-2",
        "headline": "Frank Gehry, Visionary Architect Whose Work Reshaped Public Spaces and Cultural Narratives, Passes Away at 96.",
        "content": "Frank Gehry, the globally acclaimed US-Canadian architect known for pushing boundaries with his deconstructivist vision and iconic structures such as the Guggenheim Museum Bilbao and the Walt Disney Concert Hall, has died at 96. His prolific career sparked vital conversations about the role of design in urban landscapes, the accessibility of art, and how architecture can either serve or challenge the status quo, leaving an indelible mark on cultural institutions worldwide.",
        "originalSource": "BBC",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764999517453-3",
        "headline": "Two Inmates Escape Louisiana Facility Through Damaged Wall, Highlighting Urgent Need for Carceral System Reform.",
        "content": "Authorities in Louisiana are actively searching for two individuals, accused of violent crimes, who have escaped from a correctional facility, reportedly through a compromised structural wall and improvised means. This incident brings into sharp focus the alarming state of neglect and underfunding plaguing many U.S. correctional facilities. The escape underscores the systemic failures within the carceral system, demanding immediate attention to infrastructure, inmate conditions, and the urgent need for comprehensive justice reform, rather than merely punitive measures.",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      },
      {
        "id": "story-1764999517453-4",
        "headline": "Team USA Discovers Opponents as 2026 FIFA Men's World Cup Draw Emphasizes Global Unity and Shared Passion.",
        "content": "The official draw for the 2026 FIFA Men's World Cup, a monumental event hosted jointly by the United States, Canada, and Mexico, has revealed Team USA's group stage opponents. This highly anticipated international soccer tournament represents more than just a game; it's a powerful opportunity for global connection, cultural exchange, and fostering a shared passion that transcends borders, offering a hopeful vision of collective celebration amidst global challenges.",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      },
      {
        "id": "story-1764999517453-5",
        "headline": "San Diego Agrees to Record $30M Settlement for Fatal Police Shooting of 16-Year-Old Boy, Underscoring Urgent Need for Police Accountability.",
        "content": "The City of San Diego has finalized a staggering $30 million settlement with the family of a 16-year-old boy, tragically killed by police officers, marking one of the largest payouts in city history for a police shooting. While this civil resolution offers some monetary acknowledgement, it tragically cannot bring back a young life and powerfully highlights the ongoing, systemic crisis of police violence and the urgent demand for comprehensive accountability. This settlement serves as a stark reminder of the profound impact of state-sanctioned force on marginalized communities and the relentless fight for justice.",
        "originalSource": "The Guardian",
        "publishedTime": "2 hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1764999517453-0",
        "headline": "Supreme Court will hear case on Trump's ban on birthright citizenship.",
        "content": "The Supreme Court has agreed to review a case challenging the legality of an order from the Trump administration that sought to end birthright citizenship in the United States. This sets the stage for a major constitutional battle over the 14th Amendment and its application to children born on U.S. soil.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764999517453-1",
        "headline": "Suspect in DC pipe bomb case said to have confessed in interviews with investigators.",
        "content": "Brian Cole Jr., the suspect in the 2021 pipe bomb case near the DNC and RNC headquarters, is believed to have confessed to the crime in interviews with federal investigators. Sources also indicate the suspect is thought to be a supporter of former President Donald Trump.",
        "originalSource": "AP News",
        "publishedTime": "8 hours ago"
      },
      {
        "id": "story-1764999517453-2",
        "headline": "Frank Gehry, celebrated architect of wildly imaginative buildings, dies at 96.",
        "content": "Frank Gehry, the world-renowned and influential US-Canadian architect celebrated for his deconstructivist style and iconic buildings like the Guggenheim Museum Bilbao and the Walt Disney Concert Hall, has passed away at the age of 96.",
        "originalSource": "BBC",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764999517453-3",
        "headline": "2 Louisiana inmates on the run after escape through damaged jail wall.",
        "content": "Authorities in Louisiana are searching for two inmates, both accused of violent crimes, who managed to escape from a correctional facility. The pair reportedly removed pieces from a damaged wall and then used bedsheets to scale an exterior wall to flee the jail premises.",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      },
      {
        "id": "story-1764999517453-4",
        "headline": "2026 FIFA Men's World Cup groups revealed; Team USA learns its opponents.",
        "content": "The official draw for the 2026 FIFA Men's World Cup, which will be hosted across the United States, Canada, and Mexico, was conducted. Team USA now knows the opponents it will face in the group stage of the highly anticipated international soccer tournament next summer.",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      },
      {
        "id": "story-1764999517453-5",
        "headline": "San Diego agrees to pay $30m to family of boy, 16, shot dead by police.",
        "content": "The city of San Diego has reached a settlement to pay $30 million to the family of a 16-year-old boy who was fatally shot by police officers. The civil payout follows a wrongful death lawsuit and is one of the largest settlements in the city's history involving a police shooting.",
        "originalSource": "The Guardian",
        "publishedTime": "2 hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1764999517453-0",
        "headline": "Supreme Court to Hear Vital Case on Constitutional Intent of Birthright Citizenship.",
        "content": "The Supreme Court has rightly agreed to review a critical case challenging the legality of an order from President Trump's administration, which sought to clarify the true intent of the 14th Amendment regarding birthright citizenship. This sets the stage for a crucial constitutional battle to reaffirm national sovereignty and ensure that the sanctity of American citizenship is upheld against interpretations that undermine our borders and legal framework.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764999517453-1",
        "headline": "Justice Advances as Suspect Confesses in Alarming DC Pipe Bomb Case.",
        "content": "Brian Cole Jr., the suspect in the disturbing 2021 pipe bomb case near the DNC and RNC headquarters, is now believed to have confessed to the crime in interviews with federal investigators. This development signals progress towards bringing accountability for such dangerous acts, underscoring the vital importance of law and order in protecting our nation's institutions and ensuring public safety against those who seek to destabilize it.",
        "originalSource": "AP News",
        "publishedTime": "8 hours ago"
      },
      {
        "id": "story-1764999517453-2",
        "headline": "Architectural Innovator Frank Gehry Passes, Leaving Significant Legacy.",
        "content": "Frank Gehry, the world-renowned and influential US-Canadian architect, widely celebrated for his distinctive and imaginative deconstructivist style that reshaped modern skylines, has passed away at the age of 96. His iconic contributions, including the Guggenheim Museum Bilbao and the Walt Disney Concert Hall, stand as a testament to individual artistic vision and lasting impact on the global cultural landscape.",
        "originalSource": "BBC",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764999517453-3",
        "headline": "Public Safety Alarms Ring as Two Violent Inmates Escape Louisiana Facility.",
        "content": "Authorities in Louisiana are urgently searching for two dangerous inmates, both accused of violent crimes, who brazenly escaped from a correctional facility. The pair reportedly exploited a damaged wall and used bedsheets to scale an exterior barrier, raising serious questions about the security and maintenance of our vital correctional institutions and the paramount need to protect our communities from such threats.",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      },
      {
        "id": "story-1764999517453-4",
        "headline": "National Pride Surges as Team USA Learns 2026 World Cup Opponents.",
        "content": "The official draw for the 2026 FIFA Men's World Cup, proudly hosted across the United States, Canada, and Mexico, has unveiled the formidable opponents Team USA will face in the group stage. This highly anticipated international soccer tournament next summer offers a magnificent opportunity for our nation to showcase its athletic prowess, unite citizens in shared support, and celebrate healthy competition on a global stage.",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      },
      {
        "id": "story-1764999517453-5",
        "headline": "San Diego Agrees to Major $30 Million Settlement in Tragic Police Incident.",
        "content": "The city of San Diego has agreed to a significant $30 million settlement with the family of a 16-year-old boy who was tragically shot by police officers. This substantial civil payout, following a wrongful death lawsuit, represents one of the largest settlements in the city's history involving such an incident, underscoring the profound complexities and serious financial ramifications that arise in these sensitive cases.",
        "originalSource": "The Guardian",
        "publishedTime": "2 hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1764999517453-0",
        "headline": "Supreme Court Enthusiastically Agrees to Debate Whether Babies Born Here Are Actually Here, Sparking Existential Crisis for Newborns.",
        "content": "The nation's highest judicial body, apparently bored with mere legislative trifles, has gleefully accepted a case poised to unravel the very fabric of legal existence for anyone who had the audacity to be born on American soil. At issue is President Trump's bold administrative decree to retroactively question the 14th Amendment, presumably to save taxpayers the immense burden of counting more citizens. Legal scholars are bracing for a future where birth certificates might require an advanced degree in constitutional law to decipher, and babies could face deportation proceedings before their first steps.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764999517453-1",
        "headline": "Pipe Bomb Suspect Finally Admits He Did It, Surprising Absolutely No One.",
        "content": "After what sources describe as a grueling and frankly redundant interview process, Brian Cole Jr., the alleged architect of the 2021 D.C. pipe bomb masterpiece, has reportedly confessed to the crime. Investigators, who had previously been operating under the wild assumption that the person caught on camera planting pipe bombs was, in fact, the pipe bomber, expressed mild relief at the official confirmation. The suspect is also rumored to be a 'supporter' of President Trump, though the exact correlation between political enthusiasm and explosive hobbyism remains, for now, in the realm of highly obvious speculation.",
        "originalSource": "AP News",
        "publishedTime": "8 hours ago"
      },
      {
        "id": "story-1764999517453-2",
        "headline": "Frank Gehry, Architect Who Convinced Buildings to Defy Geometry, Passes Away at 96.",
        "content": "Frank Gehry, the architectural titan who single-handedly gave right angles an inferiority complex, has peacefully folded his blueprints at the grand age of 96. Known for designing structures that appeared to have been dropped from a great height or perhaps sculpted by a giant's enthusiastic toddler, Gehry leaves behind a legacy of buildings that consistently made tourists question their sobriety. His iconic works, like the Guggenheim Museum Bilbao, are lauded as masterpieces of 'deconstructivism,' a fancy term for 'making a building look like it's trying to escape itself,' proving that even buildings can express existential angst.",
        "originalSource": "BBC",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764999517453-3",
        "headline": "Louisiana Jail Astounded as Inmates Discover 'Damaged Wall' Is Actually a Door.",
        "content": "A correctional facility in Louisiana is currently scratching its head after two inmates, both accused of crimes that probably involved more planning than their escape, decided the best way out was simply through. Apparently leveraging a 'damaged wall' – a feature authorities are now considering rebranding as an 'inadvertent exit portal' – the resourceful duo then deployed the ancient art of 'bedsheet rope' to rappel their way to freedom. Officials are now reviewing prison blueprints for other unintentional escape routes, like perhaps a window, or a giant 'OUT' sign.",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      },
      {
        "id": "story-1764999517453-4",
        "headline": "Team USA Giddily Discovers Who They'll Pretend to Beat in 2026 World Cup Group Stage.",
        "content": "In a ceremony of unparalleled global significance, involving dramatic pauses and the opening of tiny envelopes, the groups for the 2026 FIFA Men's World Cup were finally revealed. Team USA, co-hosting the event with Canada and Mexico, has now learned which nations will have the distinct privilege of playing against them before the inevitable 'well, we made it this far' speeches. Fans are already dusting off their 'next time for sure' banners, while commentators are preparing their favorite euphemisms for 'honorable defeat.' The entire planet is on the edge of its collective seat, eager to witness how many times the ball will hit the crossbar.",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      },
      {
        "id": "story-1764999517453-5",
        "headline": "San Diego Discovers $30 Million Is the Going Rate for a Systemic Oopsie.",
        "content": "In a bold move that some might call 'writing a very large check,' the city of San Diego has magnanimously agreed to hand over $30 million to the family of a 16-year-old boy fatally shot by police. This record-breaking payout, which incidentally exceeds the budget for several small countries, is being hailed as the city's innovative approach to 'redefining justice through sheer fiscal volume.' Experts suggest this could set a new precedent, where communities are no longer seeking accountability, but rather the highest possible bid for official screw-ups. The city council is reportedly considering a new department dedicated solely to calculating the market value of unforeseen police encounters.",
        "originalSource": "The Guardian",
        "publishedTime": "2 hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1764999517453-0",
        "headline": "The Supreme Court will look at President Trump's rule about citizenship.",
        "content": "The highest court in the country, called the Supreme Court, has decided to hear a big case. It's about a rule President Trump made a while ago that tried to stop kids born in the U.S. from automatically becoming citizens. This is a really important fight about the 14th Amendment, which is a part of our country's rulebook, and what it means for kids born here.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764999517453-1",
        "headline": "The person who left pipe bombs has told police he did it.",
        "content": "A person named Brian Cole Jr., who police thought left pipe bombs near where two big political groups meet in Washington D.C. in 2021, has reportedly told police he did it. People who know about the case also said that this person liked President Trump.",
        "originalSource": "AP News",
        "publishedTime": "8 hours ago"
      },
      {
        "id": "story-1764999517453-2",
        "headline": "Famous building designer Frank Gehry has passed away at 96.",
        "content": "Frank Gehry, a very famous architect who designed amazing and unusual buildings all around the world, has died. He was 96 years old. He designed really cool places like the Guggenheim Museum in Spain and the Walt Disney Concert Hall.",
        "originalSource": "BBC",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764999517453-3",
        "headline": "Two prisoners got away from jail by breaking a wall.",
        "content": "Police in Louisiana are looking for two prisoners who got out of jail. These two men were accused of doing bad things. They got out by taking apart a broken wall and then used bedsheets to climb over another wall to get away from the jail.",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      },
      {
        "id": "story-1764999517453-4",
        "headline": "The USA soccer team knows who they will play in the World Cup.",
        "content": "The teams for the big 2026 FIFA Men's World Cup soccer tournament have been picked! This huge soccer game will happen in the USA, Canada, and Mexico. Our own Team USA now knows which other teams they will play against first next summer. Everyone is super excited for it!",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      },
      {
        "id": "story-1764999517453-5",
        "headline": "San Diego will pay a lot of money to a boy's family.",
        "content": "The city of San Diego has agreed to pay 30 million dollars to the family of a 16-year-old boy. Police officers sadly shot the boy, and he died. This big payment comes after the family sued the city, saying that what happened was wrong. It's one of the biggest times the city has ever paid money because of a police shooting.",
        "originalSource": "The Guardian",
        "publishedTime": "2 hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1764999517453-0",
        "headline": "The Unsettled Birthright of a Nation",
        "content": "The marble halls of the highest court buzzed with the weight of history. A challenge, born from an order by President Trump, sought to redefine who truly belonged. At stake lay the 14th Amendment, its words etched deep into the nation’s founding, now scrutinized for its application to children born on U.S. soil. Lawyers sharpened their arguments, historians invoked precedent, and millions watched, understanding that the ruling would ripple through generations, shaping the very fabric of identity and citizenship in a land built on dreams and declarations.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764999517453-1",
        "headline": "Echoes of a Volatile Winter",
        "content": "The chill of early 2021 had long faded, but its shadows lingered. Near the twin pillars of American democracy, pipe bombs had been placed, a chilling whisper of unrest. Now, Brian Cole Jr., the man suspected, sat across from federal investigators, his voice, it's believed, confirming the truth. Sources close to the case suggest a motive rooted in fervent support for President Trump, adding another layer to the complex tapestry of that tumultuous time. The confession, if true, closes a dark chapter, but the questions it raises about ideological fervor persist.",
        "originalSource": "AP News",
        "publishedTime": "8 hours ago"
      },
      {
        "id": "story-1764999517453-2",
        "headline": "When Structures Dreamed Beyond Stone",
        "content": "Frank Gehry, the master weaver of metal and glass, has finally laid down his tools at 96. His buildings weren't merely structures; they were poems in motion, deconstructed dreams brought to life. From the shimmering fish scales of Bilbao's Guggenheim to the soaring curves of Los Angeles's Walt Disney Concert Hall, he challenged gravity and convention, making architecture dance. His passing leaves a void, but his wild, imaginative legacy stands tall, a testament to a man who saw the world not as it was, but as it could be, beautiful and utterly surprising.",
        "originalSource": "BBC",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764999517453-3",
        "headline": "The Crumbling Stone and Fleeing Shadows",
        "content": "The Louisiana night swallowed two figures, fugitives from justice. Accused of violent crimes, they exploited a weakness in the old jail, picking away at a damaged wall until a gap appeared. Bed sheets, twisted into a crude rope, became their ladder, defying gravity and the watchful eyes. Now, sirens wail, and searchlights cut through the bayou's thick air as authorities scour the landscape. Each passing hour tightens the net, yet the whispers of freedom, however brief, linger for the two desperate souls who slipped away into the darkness.",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      },
      {
        "id": "story-1764999517453-4",
        "headline": "A Global Stage, A Nation's Anticipation",
        "content": "The world held its breath as names were drawn, determining fates on the grandest soccer stage. For the 2026 FIFA Men's World Cup, hosted across the vast landscapes of the United States, Canada, and Mexico, the group stage opponents are now known. Team USA, carrying the hopes of a nation, learned who they will face in the summer's electrifying clashes. The roar of the crowd, the tension of the penalty kick, the glory of victory—all now feel a tangible step closer. The countdown to a global celebration of sport has truly begun.",
        "originalSource": "CBS News",
        "publishedTime": "Today"
      },
      {
        "id": "story-1764999517453-5",
        "headline": "The Heavy Price of a Stolen Youth",
        "content": "Silence often follows tragedy, but justice sometimes demands a voice. San Diego's coffers will now part with $30 million, a settlement for a life tragically cut short. A 16-year-old boy, shot by police officers, found his story ending too soon. The civil payout, one of the largest in the city’s history for a police shooting, closes a painful chapter for his grieving family, yet no sum can mend the gaping wound of loss. It stands as a stark reminder of accountability, and the immeasurable cost when the badge and the bullet collide with innocence.",
        "originalSource": "The Guardian",
        "publishedTime": "2 hours ago"
      }
    ]
  }
}