{
  "timestamp": 1764499204410,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1764499126112-0",
        "headline": "Systemic Failures Highlighted as Mass Shooting Ravages California Community, Leaving Families Devastated",
        "content": "A tragic mass shooting at a family gathering in Stockton, California, resulted in four fatalities and ten injuries, once again exposing the urgent need for comprehensive gun safety reform. The San Joaquin County Sheriff's Office confirmed that victims included children, underscoring the devastating impact of unregulated firearms on vulnerable communities. While authorities investigate this likely targeted attack, the incident serves as a stark reminder of the broader societal failures to protect citizens from pervasive gun violence.",
        "originalSource": "The Washington Post",
        "publishedTime": "Less than 12 hours ago"
      },
      {
        "id": "story-1764499126112-1",
        "headline": "President Trump's Pledge to Pardon Convicted Drug Trafficker Raises Serious Concerns About Justice and Global Integrity",
        "content": "President Trump announced his intention to issue a full pardon for former Honduran President Juan Orlando Hernández, who is currently serving a 45-year sentence in the US for severe drug trafficking and weapons offenses. President Trump's social media statement, asserting Hernández has been 'treated very harshly and unfairly,' appears to link this controversial decision to his support for a conservative candidate in Honduras's upcoming election. This move sparks alarm among justice advocates who fear it could undermine international efforts to combat drug cartels and signal a disregard for the rule of law when politically convenient.",
        "originalSource": "The Guardian",
        "publishedTime": "About 48 hours ago"
      },
      {
        "id": "story-1764499126112-2",
        "headline": "Northwestern University Settlement with Administration Underscores Critical Need to Combat Antisemitism and Uphold Civil Rights on Campus",
        "content": "Northwestern University has reached a $75 million settlement with the President Trump administration, concluding a federal civil rights investigation into alleged antisemitism on campus and securing the release of approximately $790 million in frozen federal funding. The agreement mandates the university adopt new policies regarding campus demonstrations and implement mandatory antisemitism training for all staff and students. This resolution highlights the essential work required to ensure all universities foster inclusive, safe environments where civil rights are protected and antisemitism is decisively addressed through robust institutional commitment.",
        "originalSource": "CBS News",
        "publishedTime": "About 24 hours ago"
      },
      {
        "id": "story-1764499126112-3",
        "headline": "Thorough Vetting Confirmed for National Guard Shooting Suspect, Debunking Misleading Claims from Administration Officials",
        "content": "Rahmanullah Lakanwal, the Afghan national charged in the tragic shooting of a National Guard member in Washington D.C., underwent extensive screening by counterterrorism agencies, including the CIA, prior to his entry into the United States in 2021. This crucial information directly contradicts earlier assertions made by senior President Trump administration officials who suggested the suspect had not received adequate scrutiny, emphasizing the importance of accurate reporting over politically motivated misinformation regarding national security protocols.",
        "originalSource": "The Washington Post",
        "publishedTime": "About 24 hours ago"
      },
      {
        "id": "story-1764499126112-4",
        "headline": "President Trump's 'Closed Airspace' Declaration Aggressively Escalates Venezuela Tensions, Jeopardizing Diplomacy and Humanitarian Aid",
        "content": "Tensions between the United States and Venezuela have sharply escalated following President Trump's unilateral declaration on social media that the airspace 'above and surrounding' Venezuela should be considered 'closed in its entirety.' Venezuela's government swiftly condemned this warning as a 'colonialist threat,' reporting that US migrant repatriation flights have been immediately and unilaterally suspended as a direct result of President Trump's provocative stance, further complicating humanitarian efforts and demonstrating a preference for coercive tactics over diplomatic engagement.",
        "originalSource": "CBS News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764499126112-5",
        "headline": "Public Health Experts Decry FDA Official's Risky Vaccine Proposal, Warning It Undermines Trust and Evidence-Based Policy",
        "content": "A senior FDA vaccine official's internal memo, proposing significantly stricter approval standards for future vaccines and citing an internal review that linked COVID-19 shots to 10 child deaths reported through the VAERS system, has ignited widespread criticism. Public health experts have broadly condemned the proposed changes as 'dangerous and irresponsible,' warning that such a move risks undermining long-standing, evidence-based vaccine policy and eroding crucial public trust in vital scientific institutions and life-saving health initiatives.",
        "originalSource": "Inkl",
        "publishedTime": "Less than 24 hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1764499126112-0",
        "headline": "Four Killed, Ten Wounded in Mass Shooting at California Family Gathering; Suspect at Large",
        "content": "At least four people were killed and ten others wounded after a mass shooting at a family gathering in a Stockton, California banquet hall Saturday evening. The San Joaquin County Sheriff's Office reported that the victims included both children and adults. Authorities believe the incident may have been a targeted attack, and the suspect remains at large as of Sunday morning.",
        "originalSource": "The Washington Post",
        "publishedTime": "Less than 12 hours ago"
      },
      {
        "id": "story-1764499126112-1",
        "headline": "Trump Says He Will Pardon Ex-Honduran President Serving Drug Trafficking Sentence",
        "content": "Donald Trump announced he will grant a full pardon to former Honduran President Juan Orlando Hernández, currently serving a 45-year sentence in the US for drug trafficking and weapons charges. Trump's social media post stated Hernández has been 'treated very harshly and unfairly,' linking the pardon to his support for a conservative candidate in Honduras's upcoming election.",
        "originalSource": "The Guardian",
        "publishedTime": "About 48 hours ago"
      },
      {
        "id": "story-1764499126112-2",
        "headline": "Northwestern University Agrees to Pay $75 Million to Settle Federal Civil Rights Probe",
        "content": "Northwestern University reached a $75 million settlement with the Trump administration to resolve a civil rights investigation into alleged antisemitism on campus and to restore approximately $790 million in frozen federal funding. The deal requires the university to adopt new policies on demonstrations and enforce mandatory antisemitism training for staff and students.",
        "originalSource": "CBS News",
        "publishedTime": "About 24 hours ago"
      },
      {
        "id": "story-1764499126112-3",
        "headline": "National Guard Shooting Suspect Was Vetted by Counterterrorism Officials Before US Entry",
        "content": "Rahmanullah Lakanwal, the Afghan national charged in the fatal shooting of a National Guard member in D.C., underwent thorough vetting by counterterrorism authorities, including the CIA, before entering the US in 2021. This information contradicts assertions made by senior Trump administration officials suggesting the suspect had not been scrutinized.",
        "originalSource": "The Washington Post",
        "publishedTime": "About 24 hours ago"
      },
      {
        "id": "story-1764499126112-4",
        "headline": "US-Venezuela Tensions Escalate as Trump Warns Airspace 'Closed' and Repatriation Flights Halt",
        "content": "Tensions between the US and Venezuela have risen after President Trump declared the airspace 'above and surrounding' Venezuela should be considered 'closed in its entirety' on social media. Venezuela's government condemned the warning as a 'colonialist threat' and reported that US migrant repatriation flights have been unilaterally suspended as a result of the escalating situation.",
        "originalSource": "CBS News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764499126112-5",
        "headline": "FDA Official's Strict New Vaccine Protocol Amid Report Linking COVID Shots to Child Deaths Faces Backlash",
        "content": "A top FDA vaccine official's internal memo proposed much stricter approval standards for future vaccines, citing a review that linked COVID-19 shots to 10 child deaths reported to the VAERS system. Experts across public health have criticized the move as 'dangerous and irresponsible,' warning that it risks undermining long-standing vaccine policy and public trust.",
        "originalSource": "Inkl",
        "publishedTime": "Less than 24 hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1764499126112-0",
        "headline": "Tragic Violence Claims Innocent Lives at California Family Gathering as Suspect Evades Justice",
        "content": "A devastating act of violence shattered a family gathering in Stockton, California, leaving four dead and ten wounded, including children. This horrific incident in a banquet hall underscores the urgent need for strong law enforcement and a firm commitment to public safety, as the perpetrator of this targeted attack remains at large, threatening the peace and security of our communities.",
        "originalSource": "The Washington Post",
        "publishedTime": "Less than 12 hours ago"
      },
      {
        "id": "story-1764499126112-1",
        "headline": "President Trump Vows to Pardon Honduran Ally, Citing Unfair Treatment and Conservative Support",
        "content": "President Trump has declared his intention to grant a full pardon to former Honduran President Juan Orlando Hernández, currently serving a 45-year sentence in the U.S. for drug trafficking. President Trump stated on social media that Hernández has been \"treated very harshly and unfairly,\" indicating the pardon is linked to Hernández's support for a conservative candidate in Honduras, demonstrating President Trump's commitment to standing by those who share our values and challenging what he views as an overreach of justice.",
        "originalSource": "The Guardian",
        "publishedTime": "About 48 hours ago"
      },
      {
        "id": "story-1764499126112-2",
        "headline": "President Trump's Administration Forces Northwestern to Confront Antisemitism, Securing $75 Million Settlement",
        "content": "Northwestern University has been compelled by the President Trump administration to settle a federal civil rights investigation into rampant antisemitism on campus, agreeing to a $75 million payout. This decisive action by President Trump's team also unfreezes $790 million in federal funding, contingent upon the university implementing new policies on campus demonstrations and mandatory antisemitism training for all staff and students, a crucial step to restore order and protect fundamental values on our nation's campuses.",
        "originalSource": "CBS News",
        "publishedTime": "About 24 hours ago"
      },
      {
        "id": "story-1764499126112-3",
        "headline": "Serious Questions Arise Over Vetting Failures as Afghan National Charged in National Guard Shooting",
        "content": "The tragic shooting of a National Guard member in D.C. by Afghan national Rahmanullah Lakanwal has ignited serious concerns regarding the efficacy of our national security vetting processes. Despite claims of thorough scrutiny by counterterrorism agencies, including the CIA, before Lakanwal's 2021 entry into the U.S., this devastating incident underscores the critical need for absolute vigilance and unwavering border security to protect American citizens and our brave service members from foreign threats.",
        "originalSource": "The Washington Post",
        "publishedTime": "About 24 hours ago"
      },
      {
        "id": "story-1764499126112-4",
        "headline": "President Trump Asserts American Sovereignty, Declares Venezuelan Airspace Closed Amid Escalating Tensions",
        "content": "Tensions with Venezuela have significantly escalated following President Trump's decisive declaration on social media that the airspace \"above and surrounding\" the nation should be considered \"closed in its entirety.\" While Venezuela's socialist government predictably condemned this as a \"colonialist threat,\" President Trump's strong stance demonstrates a commitment to defending American interests and security. Consequently, U.S. migrant repatriation flights have been justifiably suspended as the situation demands firm action against hostile regimes.",
        "originalSource": "CBS News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764499126112-5",
        "headline": "Courageous FDA Official Demands Stricter Vaccine Standards Following Reports of Child Deaths from COVID Shots",
        "content": "A courageous top FDA vaccine official has ignited a necessary debate by proposing significantly stricter approval standards for future vaccines, citing an internal review that reportedly links COVID-19 shots to ten child deaths within the VAERS system. This principled stand for public safety and transparency, particularly regarding our children's health, faces predictable backlash from the public health establishment, who fear it will undermine \"long-standing vaccine policy\" rather than prioritizing rigorous safety and informed consent.",
        "originalSource": "Inkl",
        "publishedTime": "Less than 24 hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1764499126112-0",
        "headline": "Local Family Gathering Briefly Interrupted by Predictable Mass Shooting; Neighbors Note It Was 'Only a Matter of Time'",
        "content": "Residents of Stockton, California, expressed mild surprise but mostly resigned acceptance after a routine family gathering was momentarily disrupted by a mass shooting. Four attendees were tragically dispatched to the great banquet hall in the sky, with ten others suffering minor inconveniences. 'We knew it was coming, really,' remarked one neighbor, sipping lukewarm punch. 'You can't have a good time without at least a little 'targeted attack' these days.' Authorities are diligently searching for the suspect, whom they believe may have been targeting the extra-creamy potato salad.",
        "originalSource": "The Washington Post",
        "publishedTime": "Less than 12 hours ago"
      },
      {
        "id": "story-1764499126112-1",
        "headline": "President Trump Declares Convicted Drug Kingpin 'Misunderstood Humanitarian,' Citing Shared Interest in 'Honduran Revival'",
        "content": "In a move that stunned absolutely no one, President Trump announced he would generously pardon Juan Orlando Hernández, the former Honduran president currently enjoying a 45-year vacation courtesy of the U.S. justice system for drug trafficking and weapons charges. President Trump's social media declaration championed Hernández as 'treated very harshly and unfairly,' presumably for being caught. Insiders suggest the pardon is linked to Hernández's fervent support for a 'very, very good' conservative candidate in Honduras, proving that loyalty, much like certain white powders, can traverse international borders.",
        "originalSource": "The Guardian",
        "publishedTime": "About 48 hours ago"
      },
      {
        "id": "story-1764499126112-2",
        "headline": "Northwestern University Solves Antisemitism Crisis with $75 Million Check and Mandatory PowerPoint Training",
        "content": "In a groundbreaking display of administrative wizardry, Northwestern University has successfully eradicated alleged antisemitism on campus by agreeing to a $75 million payment to the President Trump administration. The settlement, which also magically unfroze $790 million in federal funding, requires the university to implement innovative new policies on demonstrations – presumably involving everyone holding hands and singing 'Kumbaya' – and enforce mandatory antisemitism training for all staff and students. Critics wonder if future global conflicts could be resolved with a sufficiently large Venmo transfer and an all-day seminar.",
        "originalSource": "CBS News",
        "publishedTime": "About 24 hours ago"
      },
      {
        "id": "story-1764499126112-3",
        "headline": "Top-Tier Counterterrorism Vetting Process Proudly Confirms It Is 'Mostly Effective,' Despite Occasional Fatal Aberrations",
        "content": "Authorities have proudly confirmed that Rahmanullah Lakanwal, the Afghan national recently charged in the tragic shooting of a National Guard member in D.C., underwent 'extremely thorough' vetting by an elite team of counterterrorism officials, including the CIA, before being graciously welcomed into the U.S. in 2021. This revelation comes as a stunning blow to anyone who might have thought 'thorough vetting' meant 'preventing people from shooting National Guard members.' Senior President Trump administration officials, who previously suggested no scrutiny had occurred, are now reportedly polishing their official 'It Was A Perfect System That Just Had A Tiny Glitch' trophies.",
        "originalSource": "The Washington Post",
        "publishedTime": "About 24 hours ago"
      },
      {
        "id": "story-1764499126112-4",
        "headline": "President Trump Single-Handedly Closes Entire Venezuelan Airspace Using Only His Smartphone; Birds Reportedly Confused",
        "content": "Tensions between the U.S. and Venezuela reached unprecedented levels of digital absurdity after President Trump unilaterally declared the airspace 'above and surrounding' Venezuela 'closed in its entirety' via a social media post. Venezuela's government denounced the warning as a 'colonialist threat' – apparently unaware that President Trump now possesses the power to manipulate atmospheric pressure with his thumbs. As a direct result, U.S. migrant repatriation flights to Venezuela have been suspended, likely due to pilots being unsure whether to respect international aviation law or President Trump's latest tweet.",
        "originalSource": "CBS News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764499126112-5",
        "headline": "FDA Official Suggests Maybe, Just Maybe, New Vaccines Should Be 'Really, Really Safe,' Horrifies Public Health Establishment",
        "content": "A rogue FDA vaccine official has sent shockwaves through the public health community by daring to propose 'much stricter' approval standards for future vaccines. The internal memo, which brazenly cited a review linking COVID-19 shots to a staggering 10 child deaths reported to the VAERS system, was immediately condemned by 'experts' as 'dangerous and irresponsible.' Critics warned that prioritizing excessive caution might 'undermine long-standing vaccine policy' and, worse, 'make people actually think about what goes into their bodies,' thereby threatening the delicate ecosystem of public trust and pharmaceutical profits.",
        "originalSource": "Inkl",
        "publishedTime": "Less than 24 hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1764499126112-0",
        "headline": "A Terrible Shooting Happened at a Big Family Party",
        "content": "A really sad thing happened at a big family party in Stockton, California. Four people lost their lives, and ten others got hurt when someone started shooting. Both kids and grown-ups were hurt. The police believe someone planned this attack, and they are still looking for the person who did it.",
        "originalSource": "The Washington Post",
        "publishedTime": "Less than 12 hours ago"
      },
      {
        "id": "story-1764499126112-1",
        "headline": "President Trump Wants to Let a Man Go Free",
        "content": "President Trump announced that he wants to forgive a man named Juan Orlando Hernández. This man used to be the leader of Honduras and is currently in an American jail for a long time because of drug dealing and weapon problems. President Trump wrote online that he thinks the man was treated badly. He also suggested it might have something to do with the man helping a certain kind of politician in Honduras.",
        "originalSource": "The Guardian",
        "publishedTime": "About 48 hours ago"
      },
      {
        "id": "story-1764499126112-2",
        "headline": "A Big School Pays Lots of Money to Settle a Problem",
        "content": "A big school called Northwestern University decided to pay 75 million dollars to President Trump's government. They did this to fix a problem where people were investigating if the school was not being fair to Jewish students. Because of this agreement, the school will also get back about 790 million dollars that the government had put on hold. The school now has to make new rules for when people protest and make sure all the grown-ups and kids at the school learn about being kind to Jewish people and not being mean to them.",
        "originalSource": "CBS News",
        "publishedTime": "About 24 hours ago"
      },
      {
        "id": "story-1764499126112-3",
        "headline": "The Man Who Shot a Soldier Was Checked Out Before",
        "content": "A man from Afghanistan, named Rahmanullah Lakanwal, is accused of shooting and killing a soldier in Washington D.C. But before he came to America in 2021, very important people, like those from the CIA who fight against bad guys, checked him out very, very carefully. This is different from what some grown-ups who worked with President Trump said, because they thought he hadn't been checked out well.",
        "originalSource": "The Washington Post",
        "publishedTime": "About 24 hours ago"
      },
      {
        "id": "story-1764499126112-4",
        "headline": "President Trump Says Airplanes Can't Fly Over a Country",
        "content": "Things are getting more serious between America and a country called Venezuela. President Trump wrote online that airplanes should not be allowed to fly in the sky above or around Venezuela at all. The government of Venezuela said this was a mean and old-fashioned threat, like when a big country tries to control a smaller one. Because of this problem, America has stopped flying people who used to live in Venezuela back to their home country.",
        "originalSource": "CBS News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764499126112-5",
        "headline": "A Doctor Wants Stricter Rules for New Medicine Shots",
        "content": "A very important doctor from the FDA, which is a group that makes sure medicines are safe, wrote a note that said new medicine shots should be much harder to approve. He said this because a report showed that some COVID-19 shots might have caused 10 kids to pass away, which was told to a special system. But other smart doctors and health experts think this idea is 'dangerous' and not a good plan. They are worried it could make people stop trusting medicine shots and mess up rules that have been around for a long time.",
        "originalSource": "Inkl",
        "publishedTime": "Less than 24 hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1764499126112-0",
        "headline": "Echoes in the Hall",
        "content": "The celebration vanished with the first shot. Laughter turned to screams, a family reunion in Stockton shattered. Children and adults fell amidst the chaos, a targeted nightmare unfolding. Four lives extinguished, ten wounded, the perpetrator melting into the night. Fear, a cold visitor, settled over the community, the why and who haunting every whisper. A joyful evening, stolen. Justice, a distant hope.",
        "originalSource": "The Washington Post",
        "publishedTime": "Less than 12 hours ago"
      },
      {
        "id": "story-1764499126112-1",
        "headline": "A King's Mercy",
        "content": "President Trump, from his digital throne, declared a full pardon. Juan Orlando Hernández, Honduran President, languished under a 45-year sentence for drug trafficking, deemed \"treated very harshly and unfairly.\" The decree, a political chess move, signaled support for a conservative candidate across borders. A life behind bars, a powerful hand reaching, a future swayed by a single online post.",
        "originalSource": "The Guardian",
        "publishedTime": "About 48 hours ago"
      },
      {
        "id": "story-1764499126112-2",
        "headline": "Campus Crossroads",
        "content": "Seventy-five million dollars. That was the price. Northwestern University paid it to President Trump's administration, settling a federal civil rights probe. Accusations of antisemitism had frozen $790 million in federal funds. Now, new rules: mandatory antisemitism training for all, strict policies for demonstrations. A university grappling with its conscience, a ledger balanced, but the shadow of dissent, not entirely erased.",
        "originalSource": "CBS News",
        "publishedTime": "About 24 hours ago"
      },
      {
        "id": "story-1764499126112-3",
        "headline": "The Unseen Scrutiny",
        "content": "Rahmanullah Lakanwal, the Afghan national charged with killing a National Guard member, had been vetted. Not just casually, but by counterterrorism officials, including the CIA, before his 2021 US entry. This fact emerged, a quiet contradiction to earlier claims from President Trump's administration that the suspect had slipped through cracks. A system scrutinized, an official narrative challenged, and the weight of a life lost.",
        "originalSource": "The Washington Post",
        "publishedTime": "About 24 hours ago"
      },
      {
        "id": "story-1764499126112-4",
        "headline": "Closed Skies",
        "content": "\"Airspace above and surrounding Venezuela is closed in its entirety.\" President Trump's social media post ignited a new firestorm. Venezuela condemned the warning as a \"colonialist threat.\" The immediate fallout: US migrant repatriation flights, suspended. Tensions, already frayed, stretched tighter. A declaration, a diplomatic crisis, and human lives caught in the geopolitical crosscurrents, unable to fly home.",
        "originalSource": "CBS News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764499126112-5",
        "headline": "The Memo's Shadow",
        "content": "An FDA official penned a memo, proposing stricter vaccine standards. The reason: a review linking COVID-19 shots to ten reported child deaths via VAERS. Public health experts recoiled, labeling the move \"dangerous and irresponsible.\" They warned of undermined trust, of long-standing policies at risk. A scientific debate turned public, casting a long shadow over future health directives and the fragile confidence in medicine.",
        "originalSource": "Inkl",
        "publishedTime": "Less than 24 hours ago"
      }
    ]
  }
}