{
  "timestamp": 1765165765740,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1765165683572-0",
        "headline": "Supreme Court Considers President Trump's Unprecedented Bid to Expand Executive Power and Undermine Agency Independence",
        "content": "The Supreme Court is poised to hear arguments in *Trump v. Slaughter*, a landmark case challenging a 90-year precedent that limits a president's power to fire leaders of independent agencies without cause. This case, initiated by President Trump's removal of FTC Commissioner Rebecca Kelly Slaughter, represents a critical test of presidential authority and the systemic checks and balances designed to prevent executive overreach. A ruling in President Trump's favor could fundamentally weaken the independence of crucial regulatory bodies, allowing for the greater politicization of non-partisan oversight and undermining the integrity of democratic governance.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH-ro0A0auBVsYIUyW6e8w8xRyiRss9rSVcbgn2ge5x5gqPOijiU4neBTlRameb5Z-XvFR6UU6HOdqK1PXT8yd7_N9edw-6AnZQKF-s6PHOYUKBn_7lSsHYGIbTtqSWL9bHq7EeLgboNtjYV-GTfnopl_sxsZn9aPmNvecH9ilv6EzfA2Sk1MJFjx5MyGTB2EZT9FX9N8VeCjxAEOrOCB4kqA4=",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1765165683572-1",
        "headline": "Notre Dame's Bowl Game Withdrawal Exposes Deeper Systemic Flaws in Commercialized College Football Playoff System",
        "content": "Notre Dame's decision to withdraw from all bowl game consideration after being excluded from the 12-team College Football Playoff field highlights the inherent inequities and commercial pressures dominating college football. Athletic Director Pete Bevacqua's description of 'overwhelming shock and sadness' points not just to a single team's disappointment, but to a system where subjective committees, driven by revenue and marketability, often override athletic merit and player well-being. This incident underscores the urgent need for a more transparent and equitable structure within college athletics that prioritizes student-athletes over profits.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEMAGJRet0CxCrvoPx9S1A1z1kQzb52kipdcIe3lT7bklAe1xJ3gg8IFJfioZ7IuSfaoDrOW-3MFj7QOB0hEAV4d422FmKtWOvJQLegi602hosUa9OzkSYcY6nqJKSekUo-CgdDsmDi22GBUfNy6yMCRjyXzkRtJ_XvC4LOBy3o3HzvqpQa9N2sR0LAj9TFqRpd86rC8WUmPY25CCdi_gdcmFyPyQb5h6vtepHjbvflFnGG1aoqb_k=",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1765165683572-2",
        "headline": "President Trump's Demand for Political Loyalty in Exchange for Pardon Reveals Disturbing Abuse of Executive Power",
        "content": "President Trump publicly assailed Texas Rep. Henry Cuellar on Truth Social for a 'lack of LOYALTY' after the Democrat, whom President Trump recently pardoned in a federal bribery case, opted to run for re-election with his original party. President Trump's suggestion that clemency was contingent on a party switch exposes a profound and disturbing abuse of presidential pardon power, transforming a tool for justice into a political commodity. This transactional approach to governance corrodes the rule of law and underscores a systemic pattern of using state power for personal and partisan gain, rather than public service.",
        "originalSource": "Yahoo News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHun2OmXcwBnEHvRXCNLmTjEtLG2miix1j5FJ773irhwkhBNjm_QcAolFraGdeQvTJDwFIjXUJWEWw5KygxUu_SoP30cUINTJKbgBfXxhmVnFo0kJrSOvTZMPteVrqLOkoVUMEsMOi7BNQKjQAlqaE-WWM9Dsu2o4agDm6qdWQaD1YnwfgtFN4ySEu0OE6t",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1765165683572-3",
        "headline": "President Trump's Hosting of Kennedy Center Honors Raises Concerns About Politicization of Arts and Culture",
        "content": "President Trump has taken the unprecedented step of personally hosting the annual Kennedy Center Honors ceremony, a move that critics argue further politicizes a cornerstone of American cultural recognition. With President Trump reportedly deeply involved in selecting honorees like actor Sylvester Stallone, rock band Kiss, and country singer George Strait, this decision blurs the lines between political office and artistic integrity. This action represents a broader systemic concern about the erosion of independent cultural institutions and the imposition of political preferences onto spaces traditionally dedicated to celebrating diverse artistic merit without partisan interference.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFqjWuEDwtf52cVVtzYWcvb8vqsm9eet24uYKnfWnK679bY8CF3IldC3lSLIwsTd1YVikxa81abjyllYgyzLxFiPASj5rThtKIGDruPo-qxO9ZY_NVA_0YoWTlwUq-BSwJx5JaTN-HZqDyGUfoucxs8AQIRyNK7DYu99gAA-8Q=",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765165683572-4",
        "headline": "Democrats Demand Transparency on Alleged War Crime as Pentagon Withholds Video of Deadly Strike",
        "content": "Democratic lawmakers are intensifying pressure on President Trump's administration to release video footage of a second military strike on an alleged drug boat, an incident that tragically killed two survivors clinging to wreckage. Critics allege the September attack could constitute a war crime, making the video crucial for determining its legality and accountability. The Pentagon's reluctance to release this evidence perpetuates a systemic lack of transparency, undermining public trust and hindering oversight of military actions. This secrecy prevents thorough investigations into potential human rights violations and the adherence to international law.",
        "originalSource": "The Guardian",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFCdGN3ZIVr5dunUf1j2ij_5yJTfxuBOsXExG96G8TzRwyDKd48pyw_Hx5F6uWtksvr-HbEOfI-33gqPjny23hWUYv1jnCQcKneQGWRp2qvYIyqoq0XcRk0vJzqLjR44DktAeHsQnPvjmr8X3Tl5TA9XNb_xpzRQy9xFccSbZ45BiWCN9sesC1mDkuv0s0hchCVbMV2oG7D",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765165683572-5",
        "headline": "Judicial Ruling Stymies President Trump's Justice Department in Apparent Politically Motivated Campaign Against Former FBI Director",
        "content": "A federal judge has delivered a significant setback to President Trump's Justice Department in its prolonged effort to secure a new indictment against former FBI Director James Comey. This latest development in a legal saga widely perceived as politically motivated highlights a systemic issue within the administration: the weaponization of federal law enforcement for political retribution. The judiciary's intervention against what appears to be a sustained campaign underscores concerns about the erosion of impartial justice and the rule of law when the Justice Department is used to target political opponents rather than uphold its independent mandate.",
        "originalSource": "PBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGsr2SgqvpCfFxcnuQvdB3tMSuFxg9bb5nm8-u-w4o64x79PPbE0ILrOJBcn4fKWRJpdI384gZnEcJG-1YeTRx3tVAogoVObzYfV2XWYzSaqfxx_Y19OO5T",
        "publishedTime": "16 hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1765165683572-0",
        "headline": "Supreme Court to hear major test of presidential power in case over Trump's firing of FTC commissioner",
        "content": "The Supreme Court is set to hear arguments in *Trump v. Slaughter*, a landmark case that challenges a 90-year precedent limiting the president's power to fire leaders of independent agencies without cause. The case, stemming from President Trump's removal of FTC Commissioner Rebecca Kelly Slaughter, will test the scope of presidential authority over the executive branch.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH-ro0A0auBVsYIUyW6e8w8xRyiRss9rSVcbgn2ge5x5gqPOijiU4neBTlRameb5Z-XvFR6UU6HOdqK1PXT8yd7_N9edw-6AnZQKF-s6PHOYUKBn_7lSsHYGIbTtqSWL9bHq7EeLgboNtjYV-GTfnopl_sxsZn9aPmNvecH9ilv6EzfA2Sk1MJFjx5MyGTB2EZT9FX9N8VeCjxAEOrOCB4kqA4=",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1765165683572-1",
        "headline": "Notre Dame opts out of bowl game after getting 'punched in the stomach' by CFP snub",
        "content": "Notre Dame's football team has withdrawn from all bowl game consideration after being left out of the 12-team College Football Playoff field. Athletic Director Pete Bevacqua stated the decision left the program with 'overwhelming shock and sadness,' describing the selection committee's exclusion of the 10-win Fighting Irish as a punch to the stomach.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEMAGJRet0CxCrvoPx9S1A1z1kQzb52kipdcIe3lT7bklAe1xJ3gg8IFJfioZ7IuSfaoDrOW-3MFj7QOB0hEAV4d422FmKtWOvJQLegi602hosUa9OzkSYcY6nqJKSekUo-CgdDsmDi22GBUfNy6yMCRjyXzkRtJ_XvC4LOBy3o3HzvqpQa9N2sR0LAj9TFqRpd86rC8WUmPY25CCdi_gdcmFyPyQb5h6vtepHjbvflFnGG1aoqb_k=",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1765165683572-2",
        "headline": "Trump slams pardoned Democratic congressman as 'disloyal' for not switching parties",
        "content": "President Trump publicly criticized Texas Rep. Henry Cuellar on Truth Social for a \"lack of LOYALTY\" after the Democrat, whom Trump recently pardoned in a federal bribery case, announced he would run for re-election with his former party. Trump suggested the clemency was meant to encourage a party switch.",
        "originalSource": "Yahoo News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHun2OmXcwBnEHvRXCNLmTjEtLG2miix1j5FJ773irhwkhBNjm_QcAolFraGdeQvTJDwFIjXUJWEWw5KygxUu_SoP30cUINTJKbgBfXxhmVnFo0kJrSOvTZMPteVrqLOkoVUMEsMOi7BNQKjQAlqaE-WWM9Dsu2o4agDm6qdWQaD1YnwfgtFN4ySEu0OE6t",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1765165683572-3",
        "headline": "Trump set to host Kennedy Center Honors, recognizing Sylvester Stallone, George Strait, Kiss and more",
        "content": "President Trump solidified his takeover of the John F. Kennedy Center for the Performing Arts by hosting the annual Kennedy Center Honors ceremony on Sunday, a first for a sitting president. The event honored actor Sylvester Stallone, the rock band Kiss, country singer George Strait, and others whom Trump was deeply involved in choosing.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFqjWuEDwtf52cVVtzYWcvb8vqsm9eet24uYKnfWnK679bY8CF3IldC3lSLIwsTd1YVikxa81abjyllYgyzLxFiPASj5rThtKIGDruPo-qxO9ZY_NVA_0YoWTlwUq-BSwJx5JaTN-HZqDyGUfoucxs8AQIRyNK7DYu99gAA-8Q=",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765165683572-4",
        "headline": "Democrats urge Pentagon to release video of strike on alleged drug boat",
        "content": "Democratic lawmakers are escalating pressure on the Trump administration to release video of a second military strike on an alleged drug boat that killed two survivors clinging to wreckage. They argue the footage is crucial to determining the legality of the September attack, which some critics have alleged could constitute a war crime.",
        "originalSource": "The Guardian",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFCdGN3ZIVr5dunUf1j2ij_5yJTfxuBOsXExG96G8TzRwyDKd48pyw_Hx5F6uWtksvr-HbEOfI-33gqPjny23hWUYv1jnCQcKneQGWRp2qvYIyqoq0XcRk0vJzqLjR44DktAeHsQnPvjmr8X3Tl5TA9XNb_xpzRQy9xFccSbZ45BiWCN9sesC1mDkuv0s0hchCVbMV2oG7D",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765165683572-5",
        "headline": "Federal judge sets back Justice Department's effort to seek new indictment against Comey",
        "content": "A federal judge has dealt a setback to the Justice Department's efforts to seek a new indictment against former FBI Director James Comey. The development is the latest twist in a long-running legal saga against Comey, which has been widely viewed as politically motivated.",
        "originalSource": "PBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGsr2SgqvpCfFxcnuQvdB3tMSuFxg9bb5nm8-u-w4o64x79PPbE0ILrOJBcn4fKWRJpdI384gZnEcJG-1YeTRx3tVAogoVObzYfV2XWYzSaqfxx_Y19OO5T",
        "publishedTime": "16 hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1765165683572-0",
        "headline": "Supreme Court to Hear Critical Case Affirming President's Power Over Bureaucracy",
        "content": "The Supreme Court is set to review a landmark case, *President Trump v. Slaughter*, which fundamentally challenges a 90-year-old precedent that has severely limited the President's inherent power to remove leaders of independent agencies without cause. This crucial case, stemming from President Trump's decisive action to remove FTC Commissioner Rebecca Kelly Slaughter, will unequivocally test the vital scope of presidential authority over the sprawling executive branch, ensuring accountability for unelected bureaucrats.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH-ro0A0auBVsYIUyW6e8w8xRyiRss9rSVcbgn2ge5x5gqPOijiU4neBTlRameb5Z-XvFR6UU6HOdqK1PXT8yd7_N9edw-6AnZQKF-s6PHOYUKBn_7lSsHYGIbTtqSWL9bHq7EeLgboNtjYV-GTfnopl_sxsZn9aPmNvecH9ilv6EzfA2Sk1MJFjx5MyGTB2EZT9FX9N8VeCjxAEOrOCB4kqA4=",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1765165683572-1",
        "headline": "Notre Dame Takes Principled Stand After Unjust College Playoff Exclusion",
        "content": "Notre Dame's esteemed football program has honorably withdrawn from all bowl game consideration after being shockingly overlooked for the 12-team College Football Playoff field. Athletic Director Pete Bevacqua expressed 'overwhelming shock and sadness' at the decision, describing the selection committee's unfair exclusion of the 10-win Fighting Irish as a profound blow to traditional merit and fairness in collegiate sports.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEMAGJRet0CxCrvoPx9S1A1z1kQzb52kipdcIe3lT7bklAe1xJ3gg8IFJfioZ7IuSfaoDrOW-3MFj7QOB0hEAV4d422FmKtWOvJQLegi602hosUa9OzkSYcY6nqJKSekUo-CgdDsmDi22GBUfNy6yMCRjyXzkRtJ_XvC4LOBy3o3HzvqpQa9N2sR0LAj9TFqRpd86rC8WUmPY25CCdi_gdcmFyPyQb5h6vtepHjbvflFnGG1aoqb_k=",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1765165683572-2",
        "headline": "President Trump Calls Out Pardoned Democrat's Lack of Loyalty After Rebuffing Party Switch",
        "content": "President Trump publicly criticized Texas Representative Henry Cuellar on Truth Social for a clear 'lack of LOYALTY' after the Democrat, whom President Trump recently pardoned in a federal bribery case, brazenly announced his intention to run for re-election with his former party. President Trump clearly indicated that the act of clemency was extended with the reasonable expectation of encouraging a much-needed party switch.",
        "originalSource": "Yahoo News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHun2OmXcwBnEHvRXCNLmTjEtLG2miix1j5FJ773irhwkhBNjm_QcAolFraGdeQvTJDwFIjXUJWEWw5KygxUu_SoP30cUINTJKbgBfXxhmVnFo0kJrSOvTZMPteVrqLOkoVUMEsMOi7BNQKjQAlqaE-WWM9Dsu2o4agDm6qdWQaD1YnwfgtFN4ySEu0OE6t",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1765165683572-3",
        "headline": "President Trump Brings American Icons to Kennedy Center Honors, Reclaiming Culture for the People",
        "content": "President Trump has decisively solidified his leadership at the John F. Kennedy Center for the Performing Arts by personally hosting the annual Kennedy Center Honors ceremony on Sunday, a historic first for a sitting president. This significant event proudly honored American actor Sylvester Stallone, the legendary rock band Kiss, country music icon George Strait, and other truly deserving figures whom President Trump was deeply involved in choosing, bringing traditional American values back to the forefront.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFqjWuEDwtf52cVVtzYWcvb8vqsm9eet24uYKnfWnK679bY8CF3IldC3lSLIwsTd1YVikxa81abjyllYgyzLxFiPASj5rThtKIGDruPo-qxO9ZY_NVA_0YoWTlwUq-BSwJx5JaTN-HZqDyGUfoucxs8AQIRyNK7DYu99gAA-8Q=",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765165683572-4",
        "headline": "Democrats Demand Footage of Anti-Drug Operation, Questioning Military's Vital Work",
        "content": "Democratic lawmakers are inexplicably escalating pressure on the President Trump administration to release video of a second military strike on an alleged drug boat that regrettably resulted in the deaths of two survivors clinging to wreckage. They assert the footage is crucial for determining the legality of the September attack, with some critics baselessly alleging it could constitute a war crime, thereby undermining the necessary and crucial work of our military against illicit activities.",
        "originalSource": "The Guardian",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFCdGN3ZIVr5dunUf1j2ij_5yJTfxuBOsXExG96G8TzRwyDKd48pyw_Hx5F6uWtksvr-HbEOfI-33gqPjny23hWUYv1jnCQcKneQGWRp2qvYIyqoq0XcRk0vJzqLjR44DktAeHsQnPvjmr8X3Tl5TA9XNb_xpzRQy9xFccSbZ45BiWCN9sesC1mDkuv0s0hchCVbMV2oG7D",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765165683572-5",
        "headline": "Federal Judge Blocks Renewed Push to Hold Comey Accountable for His Actions",
        "content": "A federal judge has unfortunately dealt a setback to the Justice Department's diligent efforts to seek a new indictment against disgraced former FBI Director James Comey. This development marks the latest twist in a long-running legal saga against Comey, which has been widely understood as an essential pursuit of justice against an official whose actions were politically motivated and deeply concerning.",
        "originalSource": "PBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGsr2SgqvpCfFxcnuQvdB3tMSuFxg9bb5nm8-u-w4o64x79PPbE0ILrOJBcn4fKWRJpdI384gZnEcJG-1YeTRx3tVAogoVObzYfV2XWYzSaqfxx_Y19OO5T",
        "publishedTime": "16 hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1765165683572-0",
        "headline": "President Trump Asks Supreme Court If He Can Fire Federal Employees Just Because Their Aura Is 'Off'.",
        "content": "In a historic case that could redefine presidential authority as 'absolute monarch, but with better poll numbers,' the Supreme Court is bracing to hear *Trump v. Slaughter*. The landmark challenge stems from President Trump's bold decision to relieve FTC Commissioner Rebecca Kelly Slaughter of her duties, allegedly because her energy didn't 'vibe' with his. Legal experts predict this case will either cement the president's power to fire anyone who mildly inconveniences him, or at least force the court to admit that 90-year-old precedents are simply too old to care about anymore.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH-ro0A0auBVsYIUyW6e8w8xRyiRss9rSVcbgn2ge5x5gqPOijiU4neBTlRameb5Z-XvFR6UU6HOdqK1PXT8yd7_N9edw-6AnZQKF-s6PHOYUKBn_7lSsHYGIbTtqSWL9bHq7EeLgboNtjYV-GTfnopl_sxsZn9aPmNvecH9ilv6EzfA2Sk1MJFjx5MyGTB2EZT9FX9N8VeCjxAEOrOCB4kqA4=",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1765165683572-1",
        "headline": "Notre Dame Withdraws From Bowl Games, Citing 'Existential Crisis' After Being Snubbed From College Football Playoff.",
        "content": "In a dramatic display of profound athletic sorrow, the Notre Dame Fighting Irish have declared they are simply too heartbroken to play football anymore this season, opting out of all bowl game consideration. Athletic Director Pete Bevacqua, reportedly still recovering from 'overwhelming shock and sadness,' described the College Football Playoff selection committee's decision as a 'punch to the stomach,' which apparently requires immediate, season-ending bed rest and a lifetime supply of comforting ice cream. Sources close to the team suggest players are now forming a support group for competitive exclusion trauma.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEMAGJRet0CxCrvoPx9S1A1z1kQzb52kipdcIe3lT7bklAe1xJ3gg8IFJfioZ7IuSfaoDrOW-3MFj7QOB0hEAV4d422FmKtWOvJQLegi602hosUa9OzkSYcY6nqJKSekUo-CgdDsmDi22GBUfNy6yMCRjyXzkRtJ_XvC4LOBy3o3HzvqpQa9N2sR0LAj9TFqRpd86rC8WUmPY25CCdi_gdcmFyPyQb5h6vtepHjbvflFnGG1aoqb_k=",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1765165683572-2",
        "headline": "President Trump Disappointed Pardoned Democrat Forgot To Read Fine Print On 'Loyalty-For-Freedom' Contract.",
        "content": "President Trump took to Truth Social to express his profound disappointment in Texas Rep. Henry Cuellar, a Democrat whose recent pardon by President Trump apparently came with an unwritten, yet clearly implied, 'switch parties or else' clause. President Trump, reportedly flabbergasted by Cuellar's 'lack of LOYALTY,' suggested that the clemency was merely a down payment on a full party defection. Political analysts are now advising all future pardon recipients to check if their newfound freedom requires immediate, unwavering ideological alignment with the person who granted it.",
        "originalSource": "Yahoo News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHun2OmXcwBnEHvRXCNLmTjEtLG2miix1j5FJ773irhwkhBNjm_QcAolFraGdeQvTJDwFIjXUJWEWw5KygxUu_SoP30cUINTJKbgBfXxhmVnFo0kJrSOvTZMPteVrqLOkoVUMEsMOi7BNQKjQAlqaE-WWM9Dsu2o4agDm6qdWQaD1YnwfgtFN4ySEu0OE6t",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1765165683572-3",
        "headline": "President Trump Personally Curates Kennedy Center Honors, Awards 'Best Actor In A Punch-Heavy Role' To Sylvester Stallone.",
        "content": "Solidifying his bold re-imagination of American high culture, President Trump proudly hosted the annual Kennedy Center Honors, making it the first time a sitting president personally orchestrated the guest list and award categories. The night was a star-studded affair, with actor Sylvester Stallone, the legendary rock band Kiss, and country icon George Strait among the luminaries President Trump was 'deeply involved in choosing.' Critics hailed the event as a refreshing pivot towards celebrating achievements that involve either explosions, power chords, or relatable tales of trucks and heartbreak.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFqjWuEDwtf52cVVtzYWcvb8vqsm9eet24uYKnfWnK679bY8CF3IldC3lSLIwsTd1YVikxa81abjyllYgyzLxFiPASj5rThtKIGDruPo-qxO9ZY_NVA_0YoWTlwUq-BSwJx5JaTN-HZqDyGUfoucxs8AQIRyNK7DYu99gAA-8Q=",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765165683572-4",
        "headline": "Pentagon Cites 'Technical Glitches' After Video Of Alleged Drug Boat Strike Mysteriously Vanishes.",
        "content": "Democratic lawmakers are escalating pressure on the Trump administration to release video footage of a second military strike on an alleged drug boat, which reportedly left two survivors clinging to wreckage before their demise. The Pentagon, however, has cited an unprecedented series of 'technical glitches,' 'server hiccups,' and a 'rogue squirrel gnawing through fiber optic cables' as reasons why the crucial footage, which critics suggest might reveal 'war crimes,' has mysteriously vanished. Democrats, reportedly baffled by the military's sudden foray into the world of quantum video mechanics, continue to demand answers that don't involve a convenient memory lapse.",
        "originalSource": "The Guardian",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFCdGN3ZIVr5dunUf1j2ij_5yJTfxuBOsXExG96G8TzRwyDKd48pyw_Hx5F6uWtksvr-HbEOfI-33gqPjny23hWUYv1jnCQcKneQGWRp2qvYIyqoq0XcRk0vJzqLjR44DktAeHsQnPvjmr8X3Tl5TA9XNb_xpzRQy9xFccSbZ45BiWCN9sesC1mDkuv0s0hchCVbMV2oG7D",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765165683572-5",
        "headline": "Federal Judge Delivers Crushing Blow To Justice Department's Daily 'Get Comey' Initiative.",
        "content": "In a stunning display of judicial interference, a federal judge has once again thwarted the Justice Department's tireless efforts to secure yet another indictment against former FBI Director James Comey. This latest setback is just another comedic twist in the seemingly endless legal saga against Comey, which has been widely praised as a masterclass in politically motivated, perpetually failing vendettas. Sources within the DOJ are reportedly already brainstorming new, increasingly absurd charges, including 'improper use of an office stapler' and 'looking vaguely suspicious at a company picnic.'",
        "originalSource": "PBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGsr2SgqvpCfFxcnuQvdB3tMSuFxg9bb5nm8-u-w4o64x79PPbE0ILrOJBcn4fKWRJpdI384gZnEcJG-1YeTRx3tVAogoVObzYfV2XWYzSaqfxx_Y19OO5T",
        "publishedTime": "16 hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1765165683572-0",
        "headline": "The Supreme Court Will Decide How Much Power President Trump Has",
        "content": "The Supreme Court is going to listen to a very important case. This case is about how much power President Trump has to fire people who work in government. Right now, there's an old rule from 90 years ago that says presidents can't just fire some important people whenever they want. But President Trump fired someone named Rebecca Kelly Slaughter from a group called the FTC. Now, the Court will decide if President Trump can do that, and how much power a president really has over government workers.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH-ro0A0auBVsYIUyW6e8w8xRyiRss9rSVcbgn2ge5x5gqPOijiU4neBTlRameb5Z-XvFR6UU6HOdqK1PXT8yd7_N9edw-6AnZQKF-s6PHOYUKBn_7lSsHYGIbTtqSWL9bHq7EeLgboNtjYV-GTfnopl_sxsZn9aPmNvecH9ilv6EzfA2Sk1MJFjx5MyGTB2EZT9FX9N8VeCjxAEOrOCB4kqA4=",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1765165683572-1",
        "headline": "Notre Dame Football Team Is Too Sad to Play in a Bowl Game",
        "content": "The Notre Dame football team is super bummed out. They decided not to play in any extra games after their regular season. This is because they were not picked to be in the big 12-team College Football Playoff, even though they won 10 games! Their boss, Pete Bevacqua, said it felt like a 'punch in the stomach' and made everyone feel very shocked and sad. So, they decided to just go home instead.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEMAGJRet0CxCrvoPx9S1A1z1kQzb52kipdcIe3lT7bklAe1xJ3gg8IFJfioZ7IuSfaoDrOW-3MFj7QOB0hEAV4d422FmKtWOvJQLegi602hosUa9OzkSYcY6nqJKSekUo-CgdDsmDi22GBUfNy6yMCRjyXzkRtJ_XvC4LOBy3o3HzvqpQa9N2sR0LAj9TFqRpd86rC8WUmPY25CCdi_gdcmFyPyQb5h6vtepHjbvflFnGG1aoqb_k=",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1765165683572-2",
        "headline": "President Trump Is Mad at a Politician He Helped",
        "content": "President Trump is upset with a politician named Henry Cuellar. President Trump had recently helped Mr. Cuellar get out of trouble with the law. But now, Mr. Cuellar said he will stay with his old political group, the Democrats, instead of joining President Trump's group. President Trump said on social media that Mr. Cuellar showed 'a lack of LOYALTY.' It seems like President Trump thought helping him would make him change teams.",
        "originalSource": "Yahoo News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHun2OmXcwBnEHvRXCNLmTjEtLG2miix1j5FJ773irhwkhBNjm_QcAolFraGdeQvTJDwFIjXUJWEWw5KygxUu_SoP30cUINTJKbgBfXxhmVnFo0kJrSOvTZMPteVrqLOkoVUMEsMOi7BNQKjQAlqaE-WWM9Dsu2o4agDm6qdWQaD1YnwfgtFN4ySEu0OE6t",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1765165683572-3",
        "headline": "President Trump Will Host a Big Party for Famous People",
        "content": "President Trump is going to host a special party called the Kennedy Center Honors. It's a big deal because he's the first president to host it while he's still president. The party is to celebrate famous people like the actor Sylvester Stallone, the rock band Kiss, and the country singer George Strait. President Trump even helped pick who would get the awards!",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFqjWuEDwtf52cVVtzYWcvb8vqsm9eet24uYKnfWnK679bY8CF3IldC3lSLIwsTd1YVikxa81abjyllYgyzLxFiPASj5rThtKIGDruPo-qxO9ZY_NVA_0YoWTlwUq-BSwJx5JaTN-HZqDyGUfoucxs8AQIRyNK7DYu99gAA-8Q=",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765165683572-4",
        "headline": "Lawmakers Want to See a Video of a Boat Attack",
        "content": "Some politicians, who are Democrats, really want President Trump's team to show a video. The video is about when the military attacked a boat they thought was carrying drugs. Two people who were still alive after the attack, holding onto the boat pieces, ended up dying. The politicians want to see the video to figure out if the attack was allowed by law or if it was a very bad thing to do.",
        "originalSource": "The Guardian",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFCdGN3ZIVr5dunUf1j2ij_5yJTfxuBOsXExG96G8TzRwyDKd48pyw_Hx5F6uWtksvr-HbEOfI-33gqPjny23hWUYv1jnCQcKneQGWRp2qvYIyqoq0XcRk0vJzqLjR44DktAeHsQnPvjmr8X3Tl5TA9XNb_xpzRQy9xFccSbZ45BiWCN9sesC1mDkuv0s0hchCVbMV2oG7D",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765165683572-5",
        "headline": "A Judge Says No to More Trouble for James Comey",
        "content": "A judge has stopped the government from trying to get James Comey, who used to be in charge of the FBI, into more legal trouble. The government wanted to charge him with something new. This whole situation with Mr. Comey has been going on for a long time, and many people think it's more about politics than real crimes.",
        "originalSource": "PBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGsr2SgqvpCfFxcnuQvdB3tMSuFxg9bb5nm8-u-w4o64x79PPbE0ILrOJBcn4fKWRJpdI384gZnEcJG-1YeTRx3tVAogoVObzYfV2XWYzSaqfxx_Y19OO5T",
        "publishedTime": "16 hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1765165683572-0",
        "headline": "The Balance of Power on a Knife's Edge",
        "content": "The High Court buzzed with anticipation. A landmark case, *Trump v. Slaughter*, threatened to redefine the very limits of presidential authority, a precedent undisturbed for ninety years. President Trump, in his decisive action to remove FTC Commissioner Rebecca Kelly Slaughter, ignited this constitutional firestorm. The legal world watched, holding its breath. Would the President's expansive view of executive power prevail, or would the long-standing guardrails of independent agencies stand firm? The outcome would ripple through every federal office, a testament to who truly held the reins of government.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH-ro0A0auBVsYIUyW6e8w8xRyiRss9rSVcbgn2ge5x5gqPOijiU4neBTlRameb5Z-XvFR6UU6HOdqK1PXT8yd7_N9edw-6AnZQKF-s6PHOYUKBn_7lSsHYGIbTtqSWL9bHq7EeLgboNtjYV-GTfnopl_sxsZn9aPmNvecH9ilv6EzfA2Sk1MJFjx5MyGTB2EZT9FX9N8VeCjxAEOrOCB4kqA4=",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1765165683572-1",
        "headline": "A Shattered Dream and a Silent Protest",
        "content": "The locker room was heavy with a silence more profound than any roar of a stadium. Notre Dame, a titan with ten hard-won victories, found its playoff dreams cruelly extinguished. The committee's verdict felt like a physical blow, a 'punch to the stomach,' as the Athletic Director confessed, leaving behind 'overwhelming shock and sadness.' The decision was swift, resolute: no bowl game. It wasn't just a withdrawal; it was a poignant protest, a public declaration of a program's profound disappointment, opting out of the consolation prize, refusing to participate in a season that felt unjustly truncated.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEMAGJRet0CxCrvoPx9S1A1z1kQzb52kipdcIe3lT7bklAe1xJ3gg8IFJfioZ7IuSfaoDrOW-3MFj7QOB0hEAV4d422FmKtWOvJQLegi602hosUa9OzkSYcY6nqJKSekUo-CgdDsmDi22GBUfNy6yMCRjyXzkRtJ_XvC4LOBy3o3HzvqpQa9N2sR0LAj9TFqRpd86rC8WUmPY25CCdi_gdcmFyPyQb5h6vtepHjbvflFnGG1aoqb_k=",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1765165683572-2",
        "headline": "The Price of a Pardon, Unpaid",
        "content": "On the digital town square, President Trump's words blazed with indignation. Congressman Henry Cuellar, a recipient of presidential clemency in a federal bribery case, had committed a grave sin in the President's eyes: 'lack of LOYALTY.' The unspoken expectation hung in the air—a pardon for a party switch, a quiet alignment. But Cuellar, despite his reprieve, remained steadfast. He declared his intention to run for re-election under his familiar banner, a decision that ignited President Trump's public fury, revealing the perceived political calculus behind an act of mercy.",
        "originalSource": "Yahoo News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHun2OmXcwBnEHvRXCNLmTjEtLG2miix1j5FJ773irhwkhBNjm_QcAolFraGdeQvTJDwFIjXUJWEWw5KygxUu_SoP30cUINTJKbgBfXxhmVnFo0kJrSOvTZMPteVrqLOkoVUMEsMOi7BNQKjQAlqaE-WWM9Dsu2o4agDm6qdWQaD1YnwfgtFN4ySEu0OE6t",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1765165683572-3",
        "headline": "An Evening of Stars Under New Direction",
        "content": "The grand halls of the Kennedy Center shimmered, reflecting a new era. For the first time, a sitting President played host to the prestigious Honors. President Trump, deeply involved in the selection process, presided over an evening celebrating American artistry. The iconic rock of Kiss, the timeless melodies of George Strait, and the cinematic grit of Sylvester Stallone were among those lauded. This event wasn't just an awards ceremony; it was a powerful statement, a solidification of President Trump's personal influence and vision cast upon one of the nation's most revered cultural institutions, ushering in his chosen icons.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFqjWuEDwtf52cVVtzYWcvb8vqsm9eet24uYKnfWnK679bY8CF3IldC3lSLIwsTd1YVikxa81abjyllYgyzLxFiPASj5rThtKIGDruPo-qxO9ZY_NVA_0YoWTlwUq-BSwJx5JaTN-HZqDyGUfoucxs8AQIRyNK7DYu99gAA-8Q=",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765165683572-4",
        "headline": "Shadows on the Water's Surface",
        "content": "The demand echoed through the Pentagon’s chambers, growing louder with each passing day. Democratic lawmakers pressed President Trump's administration for answers, specifically, for video footage. It concerned a military strike, a second one, on an alleged drug boat that left two survivors clinging to wreckage, only for them to perish. The chilling implications of a potential war crime hung heavy. The footage, they argued, was not merely evidence; it was the key to truth, to understanding the legality and morality of an incident veiled in secrecy, demanding transparency in the face of tragedy.",
        "originalSource": "The Guardian",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFCdGN3ZIVr5dunUf1j2ij_5yJTfxuBOsXExG96G8TzRwyDKd48pyw_Hx5F6uWtksvr-HbEOfI-33gqPjny23hWUYv1jnCQcKneQGWRp2qvYIyqoq0XcRk0vJzqLjR44DktAeHsQnPvjmr8X3Tl5TA9XNb_xpzRQy9xFccSbZ45BiWCN9sesC1mDkuv0s0hchCVbMV2oG7D",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765165683572-5",
        "headline": "A Legal Chess Match, Politically Charged",
        "content": "The Justice Department's relentless pursuit of former FBI Director James Comey hit yet another wall. A federal judge, with a stroke of the pen, delivered a significant setback to efforts to secure a new indictment. This twist in the long-running legal saga was not unexpected; observers had always viewed the campaign against Comey through a political lens, seeing it less as a detached search for justice and more as a vendetta. The judge's decision underscored the difficulty of these politically charged battles, prolonging a conflict whose roots stretched deep into the nation's capital.",
        "originalSource": "PBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGsr2SgqvpCfFxcnuQvdB3tMSuFxg9bb5nm8-u-w4o64x79PPbE0ILrOJBcn4fKWRJpdI384gZnEcJG-1YeTRx3tVAogoVObzYfV2XWYzSaqfxx_Y19OO5T",
        "publishedTime": "16 hours ago"
      }
    ]
  }
}