{
  "timestamp": 1765039501000,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1765039415112-0",
        "headline": "Supreme Court Considers Stripping Birthright Citizenship, Threatening Fundamental Rights of Immigrant Families",
        "content": "The Supreme Court has announced it will review the constitutionality of President Trump's executive order, issued early in his term, which aims to dismantle the foundational guarantee of birthright citizenship for children born in the U.S., particularly targeting those with undocumented or temporary resident parents. This move represents a dangerous escalation in the administration's anti-immigrant agenda, threatening to create a permanent underclass and further entrench systemic inequities against vulnerable communities, with a definitive ruling expected by early summer.",
        "originalSource": "CBS News / Associated Press",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-1",
        "headline": "Netflix's $82.7 Billion Acquisition of Warner Bros. Signals Dangerous Corporate Consolidation in Entertainment Industry",
        "content": "Streaming behemoth Netflix has solidified its dominance in the entertainment landscape by acquiring Warner Bros., including HBO and HBO Max, in an $82.7 billion deal. This massive cash and stock acquisition represents a dangerous trend of corporate consolidation, further concentrating market power in the hands of a few giants. Such unchecked growth raises serious concerns about stifled competition, potential impacts on worker rights, reduced artistic diversity, and diminished consumer choice as a single entity gains control over vast swaths of popular culture, including iconic franchises like Batman and Harry Potter.",
        "originalSource": "Los Angeles Times",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-2",
        "headline": "CDC Panel Undermines Decades of Public Health Consensus, Delays Universal Hepatitis B Vaccine Amid Politicized Appointments",
        "content": "In a move sharply criticized by medical groups, the Centers for Disease Control and Prevention's vaccine advisory panel has voted to overturn a 30-year-old universal recommendation, now suggesting the delay of the first dose of the hepatitis B vaccine until two months of age for infants whose mothers test negative for the virus. This decision, made by a panel whose members were appointed by HHS Secretary Robert F. Kennedy Jr., raises profound concerns about the politicization of public health policy and the dangerous erosion of evidence-based medical consensus, potentially exposing vulnerable populations to preventable health risks.",
        "originalSource": "CBS News",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-3",
        "headline": "Trump Administration Erases Black History from National Parks, Replaces MLK Day and Juneteenth with President's Birthday",
        "content": "The Department of the Interior has announced a disturbing revision to the 2026 schedule for fee-free national park entrance days, removing both Martin Luther King Jr. Day and Juneteenth and controversially replacing them with President Trump's birthday on June 14. Critics are rightly calling this decision a brazen political attack on Black history and a glaring example of systemic disrespect, further erasing the recognition of crucial civil rights milestones and prioritizing political self-aggrandizement over national unity and historical truth.",
        "originalSource": "CBS News / The New Republic",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765039415112-4",
        "headline": "Pipe Bomb Suspect's Confession Reveals Dangerous Link Between Political Violence and President Trump's Stolen Election Lies",
        "content": "Sources familiar with the ongoing investigation have revealed that Brian Cole Jr., the individual apprehended for planting pipe bombs near the RNC and DNC headquarters on the eve of the January 6th Capitol attack, confessed to federal investigators and explicitly endorsed President Trump's dangerous and baseless claims of a stolen 2020 election. This confession underscores the perilous connection between systemic disinformation propagated by political leaders and acts of domestic terrorism, highlighting the profound threat to democratic institutions posed by such anti-democratic rhetoric and the resulting political violence.",
        "originalSource": "Associated Press",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765039415112-5",
        "headline": "Defense Secretary Hegseth Faces Mounting Calls for Resignation Amid Abuses of Power and Deadly Military Misconduct Scandal",
        "content": "Defense Secretary Pete Hegseth is confronting escalating demands for his resignation from lawmakers as two major scandals unfold: a damning inspector general report detailing the mishandling of classified information, and renewed scrutiny over a controversial \"double-tap\" military strike in the Caribbean that resulted in the deaths of alleged drug smugglers clinging to wreckage. These incidents highlight serious systemic failures in leadership and accountability within the defense establishment, raising critical questions about the ethical conduct of military operations and the disregard for human life under the current administration.",
        "originalSource": "The Guardian / The Washington Post",
        "publishedTime": "Hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1765039415112-0",
        "headline": "Supreme Court Agrees to Hear Challenge to Trump's Order Ending Birthright Citizenship",
        "content": "The Supreme Court announced Friday it will review the constitutionality of President Trump's executive order, issued on his second day in office, that seeks to end the constitutional guarantee of birthright citizenship for children born in the U.S. to parents who are in the country illegally or temporarily. A definitive ruling is expected by early summer.",
        "originalSource": "CBS News / Associated Press",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-1",
        "headline": "Netflix Agrees to Buy Warner Bros. in $82.7 Billion Deal, Reshaping Hollywood",
        "content": "Streaming giant Netflix prevailed in a bidding war to acquire the studios of Warner Bros., including HBO and the HBO Max streaming service. The cash and stock deal is valued at $82.7 billion, including debt. The move is expected to reshape the entertainment industry and will give Netflix control of iconic franchises like Batman and Harry Potter.",
        "originalSource": "Los Angeles Times",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-2",
        "headline": "CDC Panel Votes to Stop Recommending Universal Hepatitis B Vaccine at Birth for Newborns",
        "content": "The Centers for Disease Control and Prevention's vaccine advisory panel, whose members were appointed by HHS Secretary Robert F. Kennedy Jr., voted Friday to recommend delaying the first dose of the hepatitis B vaccine until a child is two months old for infants whose mothers test negative for the virus. The move overturns a 30-year-old universal recommendation, sparking criticism from medical groups.",
        "originalSource": "CBS News",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-3",
        "headline": "Trump Administration Removes MLK Day and Juneteenth as Fee-Free National Park Days, Adds President's Birthday",
        "content": "The Department of the Interior announced changes to the 2026 schedule for fee-free entrance days at national parks. The administration removed Martin Luther King Jr. Day and Juneteenth from the list, adding President Trump's birthday (June 14) instead. Critics call the controversial decision a political attack on Black history holidays.",
        "originalSource": "CBS News / The New Republic",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765039415112-4",
        "headline": "Suspect in D.C. Pipe Bomb Case Confessed to Investigators, Expressed Belief 2020 Election Was Stolen",
        "content": "Sources familiar with the matter told the Associated Press that Brian Cole Jr., the man arrested for planting pipe bombs outside the RNC and DNC headquarters on the eve of the Jan. 6 Capitol attack, confessed to the crime during interviews with federal investigators. He also reportedly voiced support for Donald Trump and his stolen-election claims.",
        "originalSource": "Associated Press",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765039415112-5",
        "headline": "Pressure Mounts on Defense Secretary Hegseth Over Twin Scandals, Including Deadly Caribbean Boat Strike",
        "content": "Defense Secretary Pete Hegseth is facing increasing calls for his resignation from lawmakers amid twin scandals, including a blistering inspector general report on mishandling classified information and fresh scrutiny over a controversial 'double-tap' military strike in the Caribbean that killed alleged drug smugglers clinging to wreckage.",
        "originalSource": "The Guardian / The Washington Post",
        "publishedTime": "Hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1765039415112-0",
        "headline": "Supreme Court to Examine President Trump's Bold Move to Restore Constitutional Integrity on Citizenship",
        "content": "The nation's highest court announced its decision to review the constitutionality of President Trump's executive order, a decisive measure taken early in his presidency to end the controversial practice of birthright citizenship for children born in the U.S. to parents illegally or temporarily present in the country. This crucial review addresses a fundamental question of national sovereignty and the rule of law, with a definitive ruling anticipated by early summer.",
        "originalSource": "CBS News / Associated Press",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-1",
        "headline": "Entertainment Industry Power Concentrates as Netflix Acquires Warner Bros. in Monumental Deal",
        "content": "Streaming giant Netflix has emerged victorious in a fiercely contested bidding war, securing the acquisition of Warner Bros. studios, including HBO and its streaming service, HBO Max. This $82.7 billion deal, inclusive of debt, signifies a dramatic consolidation within the entertainment sector, raising important questions about the future landscape of media content and the influence of mega-corporations on cultural narratives, now controlling iconic franchises like Batman and Harry Potter.",
        "originalSource": "Los Angeles Times",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-2",
        "headline": "CDC Panel Prioritizes Parental Choice, Adjusts Newborn Hepatitis B Vaccine Guidance",
        "content": "A pivotal advisory panel for the Centers for Disease Control and Prevention, comprising members appointed by HHS Secretary Robert F. Kennedy Jr., has voted to revise the long-standing recommendation for universal hepatitis B vaccination at birth. The new guidance suggests delaying the initial dose until two months of age for infants whose mothers test negative for the virus. This significant move, overturning a three-decade-old mandate, underscores a renewed focus on individual health assessments and parental autonomy in medical decisions, despite some criticism from traditional medical groups.",
        "originalSource": "CBS News",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-3",
        "headline": "Department of Interior Adjusts National Park Fee Schedule, Honors President Trump's Birthday",
        "content": "The Department of the Interior has announced revisions to the 2026 schedule for fee-free entrance days at national parks, a move reflecting the administration's prerogative to shape national observances. These changes include the removal of Martin Luther King Jr. Day and Juneteenth from the list, with President Trump's birthday on June 14 added instead. This decision highlights a focus on recognizing national leadership and unifying patriotism, even as some critics voice dissent regarding the reordering of commemorative days.",
        "originalSource": "CBS News / The New Republic",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765039415112-4",
        "headline": "Pipe Bomb Suspect Confesses to Crime, Faces Justice for Unlawful Actions",
        "content": "Sources close to the investigation have revealed that Brian Cole Jr., the individual apprehended for allegedly planting pipe bombs outside the RNC and DNC headquarters prior to the events of January 6th, has confessed to the crime during interviews with federal investigators. While Cole reportedly voiced support for President Trump and his concerns about the 2020 election, his confession unequivocally confirms his criminal actions, underscoring that all individuals must adhere to the rule of law, and violence has no place in political discourse. Justice will be served.",
        "originalSource": "Associated Press",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765039415112-5",
        "headline": "Defense Secretary Hegseth Faces Political Scrutiny Amid Operations to Protect National Interests",
        "content": "Defense Secretary Pete Hegseth is currently navigating escalating calls for his resignation from lawmakers amidst a confluence of challenging issues. These include an Inspector General's report scrutinizing the handling of classified information and renewed examination of a controversial military strike in the Caribbean. The operation, targeting alleged drug smugglers, resulted in fatalities and is now under intense public review, highlighting the complex and often perilous nature of defending national security interests and enforcing maritime law.",
        "originalSource": "The Guardian / The Washington Post",
        "publishedTime": "Hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1765039415112-0",
        "headline": "Supreme Court Eagerly Considers Rewriting Foundational Document Because Someone Asked Nicely",
        "content": "The nation's highest judicial body, in a move hailed as 'brave' by those who find legal precedent a bit too... precedenty, has agreed to ponder whether the 14th Amendment is, like, really important. President Trump's bold executive order, issued with the decisive speed of a man who knows exactly what he wants for breakfast, seeks to clarify that 'all persons born or naturalized' actually means 'some persons born or naturalized, but only the ones we like.' A definitive ruling is expected by early summer, potentially opening the door for future constitutional amendments via strongly worded memos.",
        "originalSource": "CBS News / Associated Press",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-1",
        "headline": "Netflix Now Owns Everything You've Ever Loved, Just In Case You Were Wondering",
        "content": "In a shocking display of corporate capitalism that left literally no one surprised, streaming juggernaut Netflix has finally consumed its largest rival, Warner Bros., for a cool $82.7 billion. The acquisition means Netflix now controls every single piece of filmed entertainment, including your grandma's home movies, essentially cornering the market on moving pictures. Industry analysts predict a future where all human experiences will be available exclusively on a single platform, with a new monthly subscription tier just to unlock the color red. Soon, you won't just be watching Netflix; you'll be Netflix.",
        "originalSource": "Los Angeles Times",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-2",
        "headline": "Nation's Top Health Experts Decide It's Okay to Just 'Wing It' For First Two Months of Life",
        "content": "In a groundbreaking move that proves sometimes even highly respected medical guidelines are just suggestions, the CDC's vaccine advisory panel, carefully curated by HHS Secretary Robert F. Kennedy Jr., has declared war on the immediate protection of newborns. The panel voted to delay the hepatitis B vaccine for infants whose mothers test negative, overturning a three-decade-old universal recommendation because, apparently, 30 years was just too long for a medical consensus. Doctors nationwide are reportedly thrilled at the newfound ambiguity, stating, 'We were getting a little bored just doing the same thing for three decades. This adds some spice!'",
        "originalSource": "CBS News",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-3",
        "headline": "President Trump Declares His Birthday the Only Day Worthy of Free Nature",
        "content": "The Department of the Interior, clearly seeking to streamline the nation's calendar of important days, has graciously swapped out a couple of those 'other' historical holidays for something truly vital: President Trump's birthday. Moving forward, Americans can celebrate June 14th by enjoying fee-free access to national parks, provided they also bring a celebratory cake. Martin Luther King Jr. Day and Juneteenth, apparently deemed less essential for communal outdoor enjoyment, have been quietly ushered off the schedule. Critics who called the move a 'political attack on Black history' were reportedly confused, as the administration clarified it was simply 'optimizing for maximum greatness.'",
        "originalSource": "CBS News / The New Republic",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765039415112-4",
        "headline": "Man Who Planted Pipe Bombs Also Believed In Unicorns, Stolen Election",
        "content": "In a shocking revelation that utterly no one found shocking, Brian Cole Jr., the individual who thought planting pipe bombs outside political headquarters was a perfectly reasonable way to express one's opinions, has confessed to his explosive hobby. Sources indicate Cole Jr. also passionately reiterated his belief that the 2020 election was stolen from President Trump, providing federal investigators with yet another example of how totally unrelated and logical those two things are. 'He seemed really convinced,' one source reportedly mumbled, 'especially about the part where his pipe bombs were just a friendly suggestion.'",
        "originalSource": "Associated Press",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765039415112-5",
        "headline": "Defense Secretary Pete Hegseth Discovers Handling Classified Information and Not Killing Stranded People Are Actually Two Separate Skills",
        "content": "Defense Secretary Pete Hegseth is reportedly grappling with the perplexing realization that running the Pentagon might require more than just a strong LinkedIn profile. Amidst increasing calls for his resignation, Hegseth is facing a dual whammy of scandals, including an inspector general report that basically said, 'You can't just leave top-secret documents on the coffee table,' and a controversial Caribbean 'double-tap' strike that managed to kill alleged drug smugglers who were already clinging to wreckage. Lawmakers are now wondering if maybe, just maybe, the job involves not having a major international incident for breakfast.",
        "originalSource": "The Guardian / The Washington Post",
        "publishedTime": "Hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1765039415112-0",
        "headline": "The Highest Court Will Look at President Trump's Big Rule About Being a U.S. Citizen",
        "content": "The Supreme Court, which is like the main boss court, said it will check out a big rule President Trump made when he first became president. This rule is about stopping kids born here from automatically being U.S. citizens if their parents aren't here legally or just visiting. We should know what they decide by summer.",
        "originalSource": "CBS News / Associated Press",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-1",
        "headline": "Netflix is Buying Warner Bros. and Getting Lots of Cool Movies",
        "content": "Guess what? Netflix, that place where you watch tons of shows, is going to buy Warner Bros.! Warner Bros. is the company that makes HBO and all those awesome Batman and Harry Potter movies. It's a super huge deal, costing more money than you can imagine ($82.7 billion!), and it means Netflix will be even bigger in the movie world.",
        "originalSource": "Los Angeles Times",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-2",
        "headline": "Doctors' Group Says Newborn Babies Don't Need a Shot Right Away",
        "content": "A group of health experts, who advise on shots, decided something new. For babies whose moms don't have a certain sickness called Hepatitis B, they don't need to get the first Hepatitis B shot right when they are born anymore. They can wait until they are two months old. This is a change from what they've said for a long, long time, like 30 years! Some doctors are a bit worried about this change.",
        "originalSource": "CBS News",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-3",
        "headline": "President Trump's Team Changed When Parks Are Free to Visit",
        "content": "The government department in charge of national parks decided to change which days you can get into the parks for free. They took away Martin Luther King Jr. Day and Juneteenth, which are important days for Black history. Instead, they added President Trump's birthday, June 14th, as a free park day. Some people are upset because they think it's mean to holidays that honor Black history.",
        "originalSource": "CBS News / The New Republic",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765039415112-4",
        "headline": "The Person Who Left Bombs Admitted What They Did",
        "content": "A man named Brian Cole Jr. was arrested because he supposedly left some homemade bombs near important buildings in Washington D.C. right before a big event on January 6th. Sources say he told the police that he did it. He also said he believed what President Trump said about the 2020 election not being fair.",
        "originalSource": "Associated Press",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765039415112-5",
        "headline": "Lots of People Are Upset with Our Defense Leader Pete Hegseth",
        "content": "The person in charge of our country's defense, named Pete Hegseth, is having some big problems. People are even saying he should quit his job. There are two main reasons: first, he got in trouble for not being careful with secret information. Second, there was a military attack in the ocean where some people who were thought to be drug smugglers died after their boat was hit.",
        "originalSource": "The Guardian / The Washington Post",
        "publishedTime": "Hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1765039415112-0",
        "headline": "The Looming Shadow of the Decree",
        "content": "The gavel's echo resonated through the marble halls. The Supreme Court had agreed to scrutinize President Trump’s decree, a bold stroke from his earliest days in office, challenging birthright citizenship. Children born on American soil, their parents undocumented or transient, now faced an uncertain future. The constitutional guarantee, once bedrock, trembled. Legal scholars debated, families worried, as the nation awaited a definitive ruling by summer’s heat. A shadow, long and complex, stretched across the nation's promise, questioning who belonged.",
        "originalSource": "CBS News / Associated Press",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-1",
        "headline": "A New Emperor of Stories",
        "content": "Hollywood held its breath. The bidding war for Warner Bros., a titan of tales, finally concluded. Netflix, the streaming behemoth, emerged victorious, securing HBO, HBO Max, and a cinematic empire for a staggering $82.7 billion. Iconic sagas like Batman and Harry Potter, once under different banners, now pledged allegiance to the red 'N'. The entertainment landscape, already shifting, would now undeniably bend to the will of this new, all-consuming emperor of stories, reshaping dreams and screens worldwide with an unprecedented reach.",
        "originalSource": "Los Angeles Times",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-2",
        "headline": "The Delayed Protection",
        "content": "A quiet revolution unfolded within the CDC's advisory panel, whose members were appointed by HHS Secretary Robert F. Kennedy Jr. After three decades, the universal mandate for the hepatitis B vaccine at birth was overturned. Now, infants whose mothers tested negative for the virus would wait two months for their first dose. The decision, though met with a chorus of criticism from medical groups, promised a new era of individualized infant care, or so its proponents claimed, shifting the protective shield on the cradle of early life.",
        "originalSource": "CBS News",
        "publishedTime": "Yesterday"
      },
      {
        "id": "story-1765039415112-3",
        "headline": "Park Gates and Shifting Tributes",
        "content": "The Department of the Interior unveiled its 2026 calendar, and the nation noticed. Martin Luther King Jr. Day and Juneteenth, once beacons of history, were removed from the roster of fee-free national park days. In their place, a new date shone: June 14th, President Trump's birthday. The move sparked immediate outcry, critics decrying it as a calculated affront to Black history. The quiet majesty of the parks, now embroiled in a political storm, reflected the changing tides of national remembrance and reverence, leaving many to ponder the implications.",
        "originalSource": "CBS News / The New Republic",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765039415112-4",
        "headline": "Echoes of a Falsehood",
        "content": "Brian Cole Jr. confessed. The pipe bombs, planted outside RNC and DNC headquarters on the eve of January 6th, were his handiwork. Federal investigators listened as he unravelled his motives, rooted in an unwavering belief that the 2020 election was stolen. His support for President Trump and the baseless claims of fraud fuelled his actions, a stark admission echoing the turbulent pre-insurrection fervor. The truth of his deed now laid bare, entangled with the conviction of a grand deception that gripped a nation.",
        "originalSource": "Associated Press",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765039415112-5",
        "headline": "A Storm Gathering in the Pentagon",
        "content": "The air thickened around Defense Secretary Pete Hegseth. Calls for his resignation grew louder, fueled by twin scandals. An inspector general's scathing report detailed the mishandling of classified intelligence, a breach of trust. Simultaneously, a 'double-tap' military strike in the Caribbean drew renewed scrutiny—an operation where alleged drug smugglers, clinging to wreckage, met a deadly end. The Pentagon’s corridors whispered of a storm gathering, threatening to capsize the Secretary’s command amidst rising tides of controversy and legislative demands for accountability.",
        "originalSource": "The Guardian / The Washington Post",
        "publishedTime": "Hours ago"
      }
    ]
  }
}