{
  "timestamp": 1764110484190,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1764110417163-0",
        "headline": "The FBI's Inquiry into Lawmakers Urging Troops to Defy Unlawful Commands Raises Concerns About Free Speech and Accountability.",
        "content": "Progressive voices express concern as the FBI targets Democratic lawmakers for a video advising service members to resist potentially illegal orders, highlighting the critical importance of protecting whistleblowers and ensuring military accountability to moral and legal standards, rather than silencing dissent.",
        "originalSource": "PBS News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764110417163-1",
        "headline": "Catholic Hospitals' Ban on Gender-Affirming Care Exacerbates Healthcare Inequality for Transgender Individuals.",
        "content": "LGBTQ+ advocates and allies condemn the U.S. bishops' decision to prohibit gender-affirming care across Catholic hospitals, a move that severely limits access to essential medical services for transgender individuals and underscores the urgent need to protect healthcare rights from religious interference and discrimination.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-2",
        "headline": "Stagnant Wages and Corporate Profiteering Undermine Consumer Confidence Amidst Persistent High Costs.",
        "content": "A recent economic report reveals declining consumer confidence, driven by widespread frustration over persistent high costs and a job market struggling to keep pace with corporate profiteering, underscoring the urgent need for policies that prioritize worker wages and challenge systemic economic inequalities over corporate greed.",
        "originalSource": "Associated Press",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764110417163-3",
        "headline": "Extreme Weather Events Like Southern California's Torrential Rains Highlight Urgent Need for Climate Action and Resilient Infrastructure.",
        "content": "As Southern California grapples with renewed torrential rainfall and flash flood warnings ahead of the holiday travel season, experts emphasize that such extreme weather events serve as a stark reminder of the accelerating climate crisis and the critical need for immediate, comprehensive climate action and investment in resilient infrastructure to protect vulnerable communities.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-4",
        "headline": "The Reappearance of a Woman Involved in the 2014 Slender Man Case Underscores Gaps in Mental Health Support Systems.",
        "content": "The swift location of the woman involved in the tragic 2014 'Slender Man' case after she left her secure group home brings renewed attention to the persistent challenges within the mental health support system, highlighting the critical need for comprehensive, well-funded care and rehabilitative environments to prevent individuals from falling through the cracks.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-5",
        "headline": "West Virginia Senator's $5.2 Million Back Tax Payment Highlights Systemic Issues of Corporate Tax Evasion and Wealthy Accountability.",
        "content": "West Virginia Senator Justice's agreement to pay nearly $5.2 million in overdue taxes, stemming from his family's vast business and coal enterprises, throws a spotlight on the widespread issue of corporate tax avoidance and the wealthy elite failing to contribute their fair share, ultimately depriving public services of much-needed funds.",
        "originalSource": "Associated Press",
        "publishedTime": "4 hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1764110417163-0",
        "headline": "FBI seeks interviews with Democrats who appeared in video urging troops to defy illegal orders",
        "content": "Democratic lawmakers who featured in a social media video encouraging U.S. troops to resist what they termed \"illegal orders\" have been contacted by the FBI. The agency is now moving to schedule formal interviews with the individuals involved as part of an ongoing inquiry into the matter.",
        "originalSource": "PBS News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764110417163-1",
        "headline": "US bishops officially ban gender-affirming care at Catholic hospitals",
        "content": "The U.S. bishops have formally adopted new guidelines that prohibit all Catholic-affiliated hospitals nationwide from offering gender-affirming medical and surgical care. The move solidifies the church's position on gender identity and affects its extensive network of healthcare facilities across the country.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-2",
        "headline": "Consumer confidence slips as Americans grow wary of high costs and labor market",
        "content": "A new economic report indicates that consumer confidence has decreased, with many Americans expressing rising concerns about persistent high inflation and the perceived weakening of the job market. This data reflects a growing public pessimism about the near-term national economic forecast.",
        "originalSource": "Associated Press",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764110417163-3",
        "headline": "Torrential rains return to Southern California, prompting flash flood warnings",
        "content": "Heavy, torrential rainfall has returned to Southern California just ahead of the holiday travel rush, leading authorities to issue widespread flash flood warnings. The severe weather system, following an atmospheric river, is forecast to track eastward and may complicate Thanksgiving journeys.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-4",
        "headline": "Wisconsin woman in 2014 Slender Man stabbing is found a day after walking away from group home",
        "content": "The woman who gained notoriety for her involvement in the 2014 'Slender Man' stabbing case in Wisconsin was successfully located by authorities. She was found approximately one day after she had walked away from the state's secure group home facility where she was residing.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-5",
        "headline": "West Virginia Sen. Justice agrees to pay nearly $5.2 million in overdue taxes",
        "content": "West Virginia Senator Justice has finalized an agreement to settle a long-standing financial dispute by paying approximately $5.2 million in back taxes. The overdue amounts were primarily related to tax obligations from his family's large network of various business and coal enterprises.",
        "originalSource": "Associated Press",
        "publishedTime": "4 hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1764110417163-0",
        "headline": "Democrats Face Scrutiny as FBI Probes Calls for Troops to Defy Orders",
        "content": "The Federal Bureau of Investigation has initiated formal interviews with Democratic lawmakers who appeared in a social media video, widely perceived as encouraging U.S. military personnel to disregard what they termed \"illegal orders.\" This inquiry highlights the serious nature of any attempt to undermine military discipline and the foundational principles of duty and command within our armed forces.",
        "originalSource": "PBS News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764110417163-1",
        "headline": "U.S. Bishops Uphold Timeless Values, Bar Gender-Altering Procedures in Catholic Hospitals",
        "content": "In a decisive move championing religious freedom and traditional values, the U.S. bishops have officially enacted new guidelines that strictly prohibit all Catholic-affiliated healthcare institutions nationwide from providing gender-affirming medical and surgical interventions. This action reaffirms the Church's long-standing moral and ethical stance on human identity and protects its extensive network of healthcare facilities from being compelled to perform procedures contrary to its foundational beliefs.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-2",
        "headline": "Americans' Confidence Dips Amidst Persistent Inflation and Economic Uncertainty",
        "content": "A recent economic assessment reveals a concerning decline in consumer confidence, as hardworking Americans express growing apprehension regarding the relentless rise in living costs and an increasingly unstable job market. This data underscores a deepening public pessimism about the nation's economic trajectory, a direct consequence of policies that burden families and restrict their economic liberty.",
        "originalSource": "Associated Press",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764110417163-3",
        "headline": "Southern California Braces for Severe Weather, Flash Flood Warnings Issued",
        "content": "Just as holiday travel plans begin, Southern California is once again grappling with heavy, torrential rainfall, prompting authorities to issue extensive flash flood warnings. This severe weather system, following an atmospheric river, is projected to move eastward, potentially complicating Thanksgiving journeys and underscoring the importance of individual preparedness and caution.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-4",
        "headline": "Notorious Slender Man Case Figure Apprehended After Fleeing Secure Facility",
        "content": "Authorities have successfully located and apprehended the individual involved in the infamous 2014 'Slender Man' stabbing case in Wisconsin. Her capture occurred approximately one day after she had walked away from the state's secure group home facility where she was residing, bringing a swift end to public safety concerns.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-5",
        "headline": "West Virginia Senator Justice Settles Significant Tax Dispute, Fulfills Financial Obligations",
        "content": "West Virginia Senator Justice has concluded a long-standing financial dispute by agreeing to pay nearly $5.2 million in overdue taxes. This resolution addresses the tax obligations primarily linked to his family's extensive network of various business and coal enterprises, demonstrating a commitment to fulfilling financial responsibilities.",
        "originalSource": "Associated Press",
        "publishedTime": "4 hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1764110417163-0",
        "headline": "FBI Gearing Up For Most Awkward Potluck Ever With Democrats Who Mistook YouTube For Pentagon Briefing",
        "content": "Sources within the FBI confirmed they are diligently scheduling 'friendly chats' with several Democratic lawmakers, who recently starred in a viral video sensation encouraging U.S. troops to just say 'no' to any orders they personally deemed 'a little bit illegal.' Investigators are reportedly eager to clarify whether 'illegal orders' included being told to clean their barracks or, say, invading a foreign country without a formal invitation. The lawmakers, reportedly surprised by the FBI's interest, had assumed their impassioned plea was merely a public service announcement about critical thinking.",
        "originalSource": "PBS News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764110417163-1",
        "headline": "Catholic Hospitals Announce New Policy: 'No New Genders, Please; We're Catholic'",
        "content": "The U.S. Conference of Catholic Bishops, after what sources described as 'several very serious Zoom calls,' has officially declared all gender-affirming care off-limits in its extensive network of hospitals. 'Our mission is to heal the sick, just not in a way that might imply genders are…fluid,' explained a Vatican spokesperson, reportedly while polishing a very old, very solid statue. The new guidelines ensure that patients seeking such care will instead receive thoughts, prayers, and perhaps a brochure about the inherent spiritual benefits of just sticking with what you got.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-2",
        "headline": "Nation's Shoppers Now So Broke, They're Just Staring Longingly At Grocery Store Aisles",
        "content": "A groundbreaking new report reveals that consumer confidence has plummeted to 'is this real life?' levels, as Americans finally notice that everything costs approximately three times what it did last Tuesday, and jobs are starting to feel like mythical creatures. Economists expressed 'mild surprise' that it took this long for the public to connect the dots between empty wallets and existential dread. Many now admit their primary financial plan involves 'hoping something good just happens' or 'finding loose change in the couch cushions for gas.'",
        "originalSource": "Associated Press",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764110417163-3",
        "headline": "California Residents Discover Water Falls From Sky Again, Prompting Mass Panic And Urgent Purchase Of Extra-Large Umbrellas",
        "content": "Southern California, a land traditionally known for its perpetual sunshine and occasional wildfires, was reportedly 'shocked, absolutely shocked' to discover that water can, in fact, fall from the sky in liquid form. The sudden appearance of 'torrential rains' just before the festive holiday travel season has prompted widespread flash flood warnings and a desperate scramble for car-sized rubber duckies. Experts predict the atmospheric river will likely continue its journey eastward, probably just to spite anyone planning a pleasant Thanksgiving drive.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-4",
        "headline": "Woman Who Once Tried To Impress Fictional Character Briefly Remembers She Hates Group Homes",
        "content": "The Wisconsin woman infamous for attempting to appease the internet's most elusive cryptid in 2014 was successfully located by authorities, a mere 24 hours after she casually strolled away from her 'secure' group home facility. Officials lauded the swift 'search and eventual finding' operation, noting that her escape was apparently less a daring jailbreak and more a spontaneous, poorly planned 'I'm out of here for a bit' kind of walk. She has since been returned to the facility, presumably after realizing the outside world still doesn't have better snacks.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-5",
        "headline": "West Virginia Senator Heroically Agrees To Finally Pay Taxes He's Owed Since Before Some Of His Constituents Were Born",
        "content": "West Virginia Senator Justice, in a stunning display of civic responsibility, has finally agreed to fork over a measly $5.2 million in overdue taxes, a sum primarily derived from his family's vast empire of coal mines and various other ventures that apparently forgot about the IRS for a few decades. The 'agreement' was hailed as a 'monumental achievement in basic fiscal compliance' by delighted state officials, who celebrated the unexpected influx of cash by immediately debating how to spend it on something equally overdue, like new speed bumps or perhaps a slightly less leaky roof for the state capitol.",
        "originalSource": "Associated Press",
        "publishedTime": "4 hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1764110417163-0",
        "headline": "The FBI wants to talk to some politicians about a video they made.",
        "content": "Some politicians from the Democratic party made a video on social media. In the video, they told soldiers not to follow orders they thought were wrong. Now, the FBI wants to talk to these politicians about what happened. They are trying to find out more about it.",
        "originalSource": "PBS News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764110417163-1",
        "headline": "Catholic hospitals say no to some special health care.",
        "content": "Leaders of the Catholic Church in the U.S. have made a new rule. It says that Catholic hospitals all over the country cannot help people who want to change their gender. This means these hospitals won't offer certain doctors' visits or surgeries for that kind of care anymore. It shows what the church believes about gender.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-2",
        "headline": "People are starting to worry more about money and jobs.",
        "content": "A new report says that people in America are feeling less hopeful about the economy. They are worried because things cost too much money, and they are also concerned that it might be harder to find jobs. This means people are not feeling great about how things will be for the country's money situation soon.",
        "originalSource": "Associated Press",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764110417163-3",
        "headline": "Lots of rain is coming back to Southern California.",
        "content": "It's going to rain a lot again in Southern California right before the holidays! Because of all the heavy rain, the weather people are warning everyone about possible flash floods, which means water could rise very fast. This big storm is moving east, so it might make it hard for people to travel for Thanksgiving.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-4",
        "headline": "Woman from the Slender Man case was found after leaving her home.",
        "content": "The woman who was part of the very famous 'Slender Man' stabbing from 2014 in Wisconsin has been found! She had left the special home where she lived and was found about a day later by the police.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-5",
        "headline": "Senator Justice will pay $5.2 million he owes in taxes.",
        "content": "Senator Justice from West Virginia has decided to pay a big amount of money, about $5.2 million. This money is for old taxes that his family's businesses, especially their coal companies, didn't pay on time. He is now settling this old money problem.",
        "originalSource": "Associated Press",
        "publishedTime": "4 hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1764110417163-0",
        "headline": "When Orders Echo Differently",
        "content": "The digital screens flickered, showing the faces of elected officials, their words a quiet rebellion. \"Defy illegal orders,\" they urged, a whisper meant for every uniform. The message, once a fleeting post, now echoed in the halls of power. Agents from the Bureau, their presence a formal summons, began reaching out. Interviews were scheduled, each call a thread pulling at the fabric of loyalty and law. The inquiry was silent, but its implications resonated, questioning the line between dissent and disruption, especially when spoken to those who serve.",
        "originalSource": "PBS News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764110417163-1",
        "headline": "The Church's New Decree",
        "content": "In hallowed chambers, a new decree was penned, its words sealing a profound shift. The U.S. bishops, with solemn authority, formalized guidelines across their vast network of healing institutions. From this day, gender-affirming care, both medical and surgical, would no longer find a place within Catholic hospitals nationwide. The decision drew a stark line, reaffirming the church's deep-seated convictions on identity. For countless individuals seeking solace and transformation, doors that once held a sliver of hope now stood firmly closed, reflecting a steadfast doctrine.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-2",
        "headline": "Whispers of Winter",
        "content": "The numbers on the economic dashboard flickered, a faint red glow signalling concern. Across dinner tables and coffee shops, a subtle shift was taking hold. Confidence, once a sturdy mast, now wavered. Americans spoke in hushed tones of prices that climbed relentlessly, of a job market that felt less secure with each passing day. A new report merely confirmed what many already felt: a growing chill of pessimism about the nation's financial horizon. The future, once a brightly coloured canvas, now seemed painted in shades of grey, heavy with unspoken anxieties.",
        "originalSource": "Associated Press",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764110417163-3",
        "headline": "Rivers from the Sky",
        "content": "The skies above Southern California groaned, then burst. Torrents of rain, a returning deluge from a recent atmospheric river, hammered down, just as the holiday exodus was set to begin. Sirens wailed, digital alerts flashed, warning of flash floods across the region. Roads, usually bustling with festive travellers, now turned into treacherous rivers. Forecasts whispered of the storm's eastward march, a dark promise to disrupt Thanksgiving reunions and journeys across states. Nature's unyielding force had arrived, transforming anticipation into a landscape of caution and delay.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-4",
        "headline": "A Shadow's Brief Return",
        "content": "The whispers of a dark legend had long faded into the Wisconsin mists, but a shadow briefly returned. The woman, whose name was once synonymous with the chilling \"Slender Man\" stabbing of 2014, had vanished. She slipped away from the secure group home, a silent departure into the familiar world she knew only from confinement. For a day, concern rippled, memories of a disturbing past momentarily resurfacing. But then, the search ended. Authorities, with quiet efficiency, located her, bringing her back to the structured reality, the brief illusion of freedom dissolved.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764110417163-5",
        "headline": "The Weight of the Bill",
        "content": "The pen moved across the page, formalizing a long-overdue reckoning. West Virginia Senator Justice, a man whose name echoed across the state's vast coal fields and diverse enterprises, had finally settled. Nearly $5.2 million, a sum amassed from years of intricate family business dealings and tax obligations, was agreed upon. The dispute, a persistent shadow on his public persona, now sought resolution. The payment, a significant burden, aimed to clear the ledger, reminding everyone that even in the highest offices, the weight of financial responsibility eventually demands its due.",
        "originalSource": "Associated Press",
        "publishedTime": "4 hours ago"
      }
    ]
  }
}