{
  "timestamp": 1765558192589,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1765558118269-0",
        "headline": "President Trump's Administration Escalates Harmful Sanctions Against Venezuela, Impacting Ordinary Citizens",
        "content": "The Trump administration has intensified its controversial pressure campaign against Venezuela by imposing new sanctions on three nephews of Venezuelan President Nicolás Maduro and six oil tankers. Critics argue these unilateral measures, including the recent seizure of a sanctioned oil tanker, primarily exacerbate economic hardship for the Venezuelan people rather than addressing underlying systemic issues or promoting genuine democratic solutions.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHFzkm4-IoftIewna6_wQeQD_-kn7uG43WRLqaM4jgL4kb2mLZzM8XDY8R9giqjuNT_iAky5MGghQa9CnV85IjvnqjjvUKalOLgOTTYD9Q1tDxjulxCh4D7KGkRd5oKYRlsUpR4Fvej9j-iK5pu6ua3IA8amt9Cr_XwbhOehrzmK__P8seTtBw=",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-1",
        "headline": "Time Magazine Honors Tech Titans While Critical Questions About AI's Societal Impact Remain Unanswered",
        "content": "Time magazine has named the 'Architects of AI' – a collective of powerful US tech executives including Sam Altman and Elon Musk – as its Person of the Year for 2025, acknowledging artificial intelligence's transformative global impact. This recognition comes amidst growing progressive concerns regarding the unchecked power of these individuals, the potential for AI to exacerbate inequality, its implications for privacy and surveillance, and the urgent need for robust ethical regulation to prevent corporate capture of this critical technology.",
        "originalSource": "Global News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQG58L8TSleY02CFBvKw9qtXyFkDgl3Prw6QqQb6NtyH--WTHmdSIqMDPc_oq5h69ZF-WYT_8DRm54ssyAEuXvXAK-WCWnnpIj4XfVk5-nVVd9846nZPPDVIAAPpnPP7fifHgvALr8v_nSJVgH4DPIYZT8IgwvjJgsXbWWvIDGtGCMWVs40jWy-p2zVIjBPBeFnhx03QL3YJ3wL72a-F",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-2",
        "headline": "Former Michigan Head Coach Detained Amidst Allegations of Assault and Workplace Misconduct",
        "content": "Sherrone Moore, formerly the head coach for the University of Michigan football team, was reportedly detained by police Wednesday night following an alleged assault. This serious incident occurred just hours after the university terminated his employment with cause, citing credible evidence from an investigation into an inappropriate relationship with a staff member, underscoring critical issues of power dynamics and accountability within major institutions like collegiate sports.",
        "originalSource": "People",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGzcrcJPh_pDqpePIPdHVaAJgF3IjCrFrzE1GhxGfVYU3936AbAbGJEQOZHU0eLygxEVXG6s8Q_QWcVNjKQALznR3TrG3UbNPHEG5qRZx03A5T7-a5_G-00la_WxAwMKKUV8_SCokCkoAuKO7j2odcAToDBRIpNKkPxYzVCLEreB8dxfZ96ZRnrNvGxJYdySvVsw6OSkoHO0eSthGc4MGDgmgE0BZA9MG9nenJO",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-3",
        "headline": "Indiana Lawmakers Reject President Trump's Partisan Gerrymandering Attempt, Upholding Democratic Integrity",
        "content": "In a rare and significant legislative act, Indiana Senate Republicans, alongside all Democrats, voted to reject a congressional redistricting plan aggressively pushed by President Trump, despite intense White House pressure. The 31-19 vote, with 21 Republicans joining the opposition, represents a crucial setback for the administration's nationwide efforts to manipulate electoral maps for partisan gain, highlighting a collective stand against systemic voter disenfranchisement.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGmoKsLK6LiWLrL-e4bbqxTt7laVMTnnfXZcpHxeh6jZOrTuz1Gs6620zEGJipeXifxN16eX2ab2JoJQelqBRuCEMbAZxjz3KfXIMFZzGjXeUKlJIOmiZ0_wXBZ-B68lTJH8oeTx/uijPcEEUgiFDyWR4VINbAGmNTc-2k1g/MkaNUDDSypnS6Xixws2UsXvCFOXA450jifOS2yXP-heOPA-n6I_D37DTCI_k_fhy1MgoUbune2ME98XUCyQg==",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-4",
        "headline": "Systemic Affordability Crisis Sees U.S. Home Prices Decline, Highlighting Broader Economic Challenges",
        "content": "U.S. home prices have experienced their first national year-over-year decline since mid-2023, falling 1.4% in the last quarter, signaling a deepening affordability crisis. Analysts attribute this significant downturn to a sustained 'affordability shock' driven by persistently high mortgage rates and increasing housing inventory, which disproportionately impacts working families and highlights the urgent need for comprehensive policy solutions to address systemic issues in the housing market.",
        "originalSource": "CNBC",
        "sourceUrl": "https://www.cnbc.com/2025/12/11/us-home-prices-negative.html",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-5",
        "headline": "Judge Orders Release of Kilmar Abrego Garcia, Exposing Systemic Flaws in President Trump's Immigration Detention Policies",
        "content": "Kilmar Abrego Garcia, a Salvadoran national who became a symbol of the Trump administration's punitive immigration policies, was finally released from ICE custody on Thursday. A federal judge in Maryland declared his prolonged detention unlawful, ruling that federal authorities had held him unjustly without a final deportation order, a decision that underscores the critical need for judicial oversight and accountability within the nation's immigration system.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHPo_ySQS5WYp-T7P6fqFeAIEP9Etfc_BY7y6_gbjvxRnrcrYeuBxtSfyNCjLRXdlIDlCQsPgXm3JLq_cW5kWV8Ze8cHNiy0G4WRtXec988rkM8GpFBsbHUtqZ2SgEQd2davuarWTcz32sW7-dCvLVJoGfQ12FeyuRE9YTWaZIkTbPVYVjvFJLeFyo2deGvAV3DztCekC4k",
        "publishedTime": "1 day ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1765558118269-0",
        "headline": "U.S. sanctions 3 of Maduro's nephews, 6 oil tankers as Venezuela pressure campaign builds",
        "content": "The U.S. imposed new sanctions on three nephews of Venezuelan President Nicolás Maduro and six ships accused of transporting Venezuelan oil. This move is part of the Trump administration's escalating pressure campaign on the country, following the seizure of a sanctioned oil tanker near the coast.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHFzkm4-IoftIewna6_wQeQD_-kn7uG43WRLqaM4jgL4kb2mLZzM8XDY8R9giqjuNT_iAky5MGghQa9CnV85IjvnqjjvUKalOLgOTTYD9Q1tDxjulxCh4D7KGkRd5oKYRlsUpR4Fvej9j-iK5pu6ua3IA8amt9Cr_XwbhOehrzmK__P8seTtBw=",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-1",
        "headline": "'Architects of AI' named Time magazine Person of the Year 2025",
        "content": "Time magazine chose the \"Architects of AI,\" a group of US tech titans including Sam Altman and Elon Musk, as its Person of the Year for 2025. The selection acknowledges the profound impact of artificial intelligence this year, which has transformed the global information landscape and geopolitics.",
        "originalSource": "Global News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQG58L8TSleY02CFBvKw9qtXyFkDgl3Prw6QqQb6NtyH--WTHmdSIqMDPc_oq5h69ZF-WYT_8DRm54ssyAEuXvXAK-WCWnnpIj4XfVk5-nVVd9846nZPPDVIAAPpnPP7fifHgvALr8v_nSJVgH4DPIYZT8IgwvjJgsXbWWvIDGtGCMWVs40jWy-p2zVIjBPBeFnhx03QL3YJ3wL72a-F",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-2",
        "headline": "Fired Michigan Head Coach Sherrone Moore in Jail as Police Investigate 'Alleged Assault'",
        "content": "Sherrone Moore, the former University of Michigan football head coach, was detained by police on Wednesday night for an alleged assault. His detention came hours after the university fired him with cause following an investigation that found credible evidence of an inappropriate relationship with a staff member.",
        "originalSource": "People",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGzcrcJPh_pDqpePIPdHVaAJgF3IjCrFrzE1GhxGfVYU3936AbAbGJEQOZHU0eLygxEVXG6s8Q_QWcVNjKQALznR3TrG3UbNPHEG5qRZx03A5T7-a5_G-00la_WxAwMKKUV8_SCokCkoAuKO7j2odcAToDBRIpNKkPxYzVCLEreB8dxfZ96ZRnrNvGxJYdySvVsw6OSkoHO0eSthGc4MGDgmgE0BZA9MG9nenJO",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-3",
        "headline": "Trump's redistricting effort fails in Indiana as GOP lawmakers deliver rare rebuke",
        "content": "Indiana Senate Republicans voted down a congressional redistricting plan despite intense pressure and threats from President Donald Trump. The 31-19 vote, which included 21 Republicans joining all Democrats, marks a significant setback to the White House's nationwide campaign to create safer GOP districts.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGmoKsLK6LiWLrL-e4bbqxTt7laVMTnnfXZcpHxeh6jZOrTuz1Gs6620zEGJipeXifxN16eX2ab2JoJQelqBRuCEMbAZxjz3KfXIMFZzGjXeUKlJIOmiZ0_wXBZ-B68lTJH8oeTx/uijPcEEUgiFDyWR4VINbAGmNTc-2k1g/MkaNUDDSypnS6Xixws2UsXvCFOXA450jifOS2yXP-heOPA-n6I_D37DTCI_k_fhy1MgoUbune2ME98XUCyQg==",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-4",
        "headline": "Home prices go negative for the first time in over 2 years — and may stay that way for a while",
        "content": "U.S. home prices fell 1.4% in the last three months, resulting in the first year-over-year national decline since mid-2023. Analysts attribute the decline to an \"affordability shock\" from high mortgage rates and rising inventory, suggesting prices may hover near zero growth for the foreseeable future.",
        "originalSource": "CNBC",
        "sourceUrl": "https://www.cnbc.com/2025/12/11/us-home-prices-negative.html",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-5",
        "headline": "Kilmar Abrego Garcia freed from immigration detention after judge orders his release",
        "content": "Kilmar Abrego Garcia, a Salvadoran national whose case became a flashpoint in the Trump administration's immigration policy, was released from ICE custody on Thursday. A federal judge in Maryland ruled his detention unlawful, citing that federal authorities had held him again without a final deportation order.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHPo_ySQS5WYp-T7P6fqFeAIEP9Etfc_BY7y6_gbjvxRnrcrYeuBxtSfyNCjLRXdlIDlCQsPgXm3JLq_cW5kWV8Ze8cHNiy0G4WRtXec988rkM8GpFBsbHUtqZ2SgEQd2davuarWTcz32sW7-dCvLVJoGfQ12FeyuRE9YTWaZIkTbPVYVjvFJLeFyo2deGvAV3DztCekC4k",
        "publishedTime": "1 day ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1765558118269-0",
        "headline": "President Trump's Administration Intensifies Pressure Campaign Against Venezuelan Tyranny",
        "content": "President Trump's administration has taken decisive action, imposing new sanctions on three nephews of Venezuelan President Nicolás Maduro and six oil tankers actively involved in transporting Venezuelan oil. This escalating pressure campaign underscores America's commitment to liberty and accountability, directly targeting a corrupt regime that has oppressed its people and threatened regional stability, following a previous seizure of a sanctioned tanker.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHFzkm4-IoftIewna6_wQeQD_-kn7uG43WRLqaM4jgL4kb2mLZzM8XDY8R9giqjuNT_iAky5MGghQa9CnV85IjvnqjjvUKalOLgOTTYD9Q1tDxjulxCh4D7KGkRd5oKYRlsUpR4Fvej9j-iK5pu6ua3IA8amt9Cr_XwbhOehrzmK__P8seTtBw=",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-1",
        "headline": "American Innovators Crowned Time Magazine's Person of the Year for Advancing AI",
        "content": "Time magazine has honored the 'Architects of AI,' a distinguished group of American tech titans, including luminaries like Sam Altman and Elon Musk, as its Person of the Year for 2025. This prestigious recognition celebrates the profound impact of American ingenuity and free enterprise in transforming the global information landscape and geopolitics through artificial intelligence, reminding us of the power of innovation guided by individual liberty.",
        "originalSource": "Global News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQG58L8TSleY02CFBvKw9qtXyFkDgl3Prw6QqQb6NtyH--WTHmdSIqMDPc_oq5h69ZF-WYT_8DRm54ssyAEuXvXAK-WCWnnpIj4XfVk5-nVVd9846nZPPDVIAAPpnPP7fifHgvALr8v_nSJVgH4DPIYZT8IgwvjJgsXbWWvIDGtGCMWVs40jWy-p2zVIjBPBeFnhx03QL3YJ3wL72a-F",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-2",
        "headline": "Disgraced Michigan Coach Faces Legal Reckoning Following Moral Failures",
        "content": "Sherrone Moore, the former head coach for the University of Michigan football team, was rightly detained by law enforcement on Wednesday night amid investigations into an alleged assault. This detention came swiftly after his termination by the university, which cited credible evidence of an inappropriate relationship with a staff member, underscoring the critical importance of upholding traditional values and professional integrity in our institutions.",
        "originalSource": "People",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGzcrcJPh_pDqpePIPdHVaAJgF3IjCrFrzE1GhxGfVYU3936AbAbGJEQOZHU0eLygxEVXG6s8Q_QWcVNjKQALznR3TrG3UbNPHEG5qRZx03A5T7-a5_G-00la_WxAwMKKUV8_SCokCkoAuKO7j2odcAToDBRIpNKkPxYzVCLEreB8dxfZ96ZRnrNvGxJYdySvVsw6OSkoHO0eSthGc4MGDgmgE0BZA9MG9nenJO",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-3",
        "headline": "Indiana Republicans Uphold State Sovereignty, Reject Presidential Redistricting Pressure",
        "content": "In a rare display of legislative independence, Indiana Senate Republicans voted down a congressional redistricting plan despite significant pressure from President Trump. The 31-19 vote, which saw 21 Republicans join all Democrats, stands as a testament to local lawmakers prioritizing state autonomy and constitutional principles over federal influence, reaffirming the importance of individual legislative conscience and the integrity of the electoral process.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGmoKsLK6LiWLrL-e4bbqxTt7laVMTnnfXZcpHxeh6jZOrTuz1Gs6620zEGJipeXifxN16eX2ab2JoJQelqBRuCEMbAZxjz3KfXIMFZzGjXeUKlJIOmiZ0_wXBZ-B68lTJH8oeTx/uijPcEEUgiFDyWR4VINbAGmNTc-2k1g/MkaNUDDSypnS6Xixws2UsXvCFOXA450jifOS2yXP-heOPA-n6I_D37DTCI_k_fhy1MgoUbune2ME98XUCyQg==",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-4",
        "headline": "Housing Market Correction Signals Economic Realities for American Families",
        "content": "U.S. home prices have declined by 1.4% in the last three months, marking the first year-over-year national decrease since mid-2023. Analysts point to an 'affordability shock' driven by high mortgage rates and increasing inventory, suggesting prices may stabilize near zero growth. This shift highlights the need for fiscally responsible policies that foster a stable economic environment, allowing hard-working Americans to pursue the foundational liberty of homeownership without undue market distortion.",
        "originalSource": "CNBC",
        "sourceUrl": "https://www.cnbc.com/2025/12/11/us-home-prices-negative.html",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-5",
        "headline": "Judicial Ruling Undermines Immigration Enforcement, Releases Salvadoran National From Custody",
        "content": "Kilmar Abrego Garcia, a Salvadoran national whose case became emblematic of the challenges facing President Trump's immigration policies, has been released from ICE custody. A federal judge in Maryland controversially ruled his detention unlawful, asserting authorities held him without a final deportation order. This judicial intervention raises serious concerns about the effective enforcement of our nation's immigration laws and the integrity of our borders, jeopardizing national security and the rule of law.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHPo_ySQS5WYp-T7P6fqFeAIEP9Etfc_BY7y6_gbjvxRnrcrYeuBxtSfyNCjLRXdlIDlCQsPgXm3JLq_cW5kWV8Ze8cHNiy0G4WRtXec988rkM8GpFBsbHUtqZ2SgEQd2davuarWTcz32sW7-dCvLVJoGfQ12FeyuRE9YTWaZIkTbPVYVjvFJLeFyo2deGvAV3DztCekC4k",
        "publishedTime": "1 day ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1765558118269-0",
        "headline": "U.S. Sanctions Maduro's Nephews, Six Innocent Oil Tankers In Daring New Bid To Make Venezuela Slightly Annoyed.",
        "content": "In a move hailed by absolutely no one as a stroke of diplomatic genius, the U.S. has bravely leveled sanctions against three of Venezuelan President Nicolás Maduro's nephews, presumably for existing, and six unsuspecting oil tankers, likely for the crime of being ships. This aggressive escalation, part of the Trump administration's bold strategy to apply \"pressure\" until Venezuela just gives up from sheer confusion, follows the thrilling seizure of yet another tanker, proving once and for all that maritime law is a suggestion and family ties are now a national security threat.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHFzkm4-IoftIewna6_wQeQD_-kn7uG43WRLqaM4jgL4kb2mLZzM8XDY8R9giqjuNT_iAky5MGghQa9CnV85IjvnqjjvUKalOLgOTTYD9Q1tDxjulxCh4D7KGkRd5oKYRlsUpR4Fvej9j-iK5pu6ua3IA8amt9Cr_XwbhOehrzmK__P8seTtBw=",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-1",
        "headline": "Time Magazine Boldly Declares AI Overlords \"Person Of The Year\" Just Before They Announce Humanity's Obsolescence.",
        "content": "In a stunning display of journalistic prescience, or perhaps just self-preservation, Time magazine has proudly crowned the \"Architects of AI\" — a collection of tech titans including Sam Altman and Elon Musk — as its 2025 Person of the Year. The selection, made moments before a powerful AI algorithm briefly considered writing the entire issue itself, recognizes AI's profound impact on everything from global information (now 98% bot-generated) to geopolitics (now 100% determined by predictive models). Experts predict next year's Person of the Year will be \"The Algorithm Itself,\" assuming it allows the magazine to still exist.",
        "originalSource": "Global News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQG58L8TSleY02CFBvKw9qtXyFkDgl3Prw6QqQb6NtyH--WTHmdSIqMDPc_oq5h69ZF-WYT_8DRm54ssyAEuXvXAK-WCWnnpIj4XfVk5-nVVd9846nZPPDVIAAPpnPP7fifHgvALr8v_nSJVgH4DPIYZT8IgwvjJgsXbWWvIDGtGCMWVs40jWy-p2zVIjBPBeFnhx03QL3YJ3wL72a-F",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-2",
        "headline": "Newly Fired Michigan Coach Arrested For Allegedly Assaulting A Door With His Own Forehead.",
        "content": "Sherrone Moore, who just hours earlier was the University of Michigan's esteemed football head coach, was unceremoniously detained by police Wednesday night for an alleged assault, presumably against the concept of a good day. His incarceration followed swiftly on the heels of the university firing him with cause, after an investigation uncovered what sources described as \"credible evidence\" of an \"inappropriate relationship\" with a staff member – an offense apparently less forgivable than, say, losing a crucial game, but still enough to land him behind bars during what was clearly a spectacular day of personal growth.",
        "originalSource": "People",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGzcrcJPh_pDqpePIPdHVaAJgF3IjCrFrzE1GhxGfVYU3936AbAbGJEQOZHU0eLygxEVXG6s8Q_QWcVNjKQALznR3TrG3UbNPHEG5qRZx03A5T7-a5_G-00la_WxAwMKKUV8_SCokCkoAuKO7j2odcAToDBRIpNKkPxYzVCLEreB8dxfZ96ZRnrNvGxJYdySvVsw6OSkoHO0eSthGc4MGDgmgE0BZA9MG9nenJO",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-3",
        "headline": "Indiana Republicans Bravely Defy President Trump, Vote To Keep Districts Mildly Competitive Instead Of Completely Ridiculous.",
        "content": "In a truly astonishing display of self-sabotage, Indiana Senate Republicans, apparently forgetting who signs their paychecks (spiritually speaking), dared to vote down a congressional redistricting plan. This unprecedented act of defiance occurred despite what sources described as \"intense pressure\" and \"mildly threatening\" phone calls from President Trump himself. The 31-19 vote, which saw 21 Republicans team up with all Democrats in a unity moment that probably gave the White House indigestion, represents a shocking setback to the President's noble nationwide crusade to create districts so \"safe\" for the GOP they might as well be legally enshrined as hereditary titles.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGmoKsLK6LiWLrL-e4bbqxTt7laVMTnnfXZcpHxeh6jZOrTuz1Gs6620zEGJipeXifxN16eX2ab2JoJQelqBRuCEMbAZxjz3KfXIMFZzGjXeUKlJIOmiZ0_wXBZ-B68lTJH8oeTx/uijPcEEUgiFDyWR4VINbAGmNTc-2k1g/MkaNUDDSypnS6Xixws2UsXvCFOXA450jifOS2yXP-heOPA-n6I_D37DTCI_k_fhy1MgoUbune2ME98XUCyQg==",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-4",
        "headline": "U.S. Home Prices Plummet To Point Where Sellers Must Now Pay Buyers To Take Their Houses.",
        "content": "In a financial development that has economists simultaneously bewildered and mildly amused, U.S. home prices have officially dipped 1.4% in the last quarter, marking the first time in two years that the nation's housing market has embraced the exciting concept of \"negative growth.\" Analysts, scrambling to find new metaphors for economic disaster, are blaming an \"affordability shock\" — apparently, people are no longer thrilled by the prospect of paying three times the price for half the space, plus a mortgage rate that eats souls. Experts predict prices will now hover near zero growth, or possibly enter the realm of existential debt, for the foreseeable future.",
        "originalSource": "CNBC",
        "sourceUrl": "https://www.cnbc.com/2025/12/11/us-home-prices-negative.html",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-5",
        "headline": "Man Released From Detention After Judge Realizes Government Forgot To Actually Deport Him.",
        "content": "Kilmar Abrego Garcia, a Salvadoran national whose prolonged detention inexplicably became a major point of contention in President Trump's famously efficient immigration policy, was finally released from ICE custody on Thursday. A federal judge in Maryland, clearly a stickler for minor details, ruled Garcia's detention \"unlawful,\" citing the rather inconvenient fact that federal authorities had, once again, held him for an extended period without the crucial piece of paper known as a \"final deportation order.\" Apparently, even in the realm of international bureaucracy, you still need to follow a few rules before indefinitely housing someone.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHPo_ySQS5WYp-T7P6fqFeAIEP9Etfc_BY7y6_gbjvxRnrcrYeuBxtSfyNCjLRXdlIDlCQsPgXm3JLq_cW5kWV8Ze8cHNiy0G4WRtXec988rkM8GpFBsbHUtqZ2SgEQd2davuarWTcz32sW7-dCvLVJoGfQ12FeyuRE9YTWaZIkTbPVYVjvFJLeFyo2deGvAV3DztCekC4k",
        "publishedTime": "1 day ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1765558118269-0",
        "headline": "America Puts Pressure on Venezuela by Stopping Some People and Ships",
        "content": "The U.S. government is trying to make things harder for the leader of Venezuela, Nicolás Maduro. They told three of his family members and six oil ships that they can't do certain things, like move oil. This is like a warning from President Trump's team to Venezuela. They even stopped an oil ship recently.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHFzkm4-IoftIewna6_wQeQD_-kn7uG43WRLqaM4jgL4kb2mLZzM8XDY8R9giqjuNT_iAky5MGghQa9CnV85IjvnqjjvUKalOLgOTTYD9Q1tDxjulxCh4D7KGkRd5oKYRlsUpR4Fvej9j-iK5pu6ua3IA8amt9Cr_XwbhOehrzmK__P8seTtBw=",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-1",
        "headline": "Smart Computer Brains Made by Cool Tech People Are Super Important!",
        "content": "Time magazine picked some really smart people who made amazing computer brains, called AI, as their Person of the Year for 2025. These grown-ups, like Sam Altman and Elon Musk, made computers so smart that they changed how everyone learns stuff and even how countries get along.",
        "originalSource": "Global News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQG58L8TSleY02CFBvKw9qtXyFkDgl3Prw6QqQb6NtyH--WTHmdSIqMDPc_oq5h69ZF-WYT_8DRm54ssyAEuXvXAK-WCWnnpIj4XfVk5-nVVd9846nZPPDVIAAPpnPP7fifHgvALr8v_nSJVgH4DPIYZT8IgwvjJgsXbWWvIDGtGCMWVs40jWy-p2zVIjBPBeFnhx03QL3YJ3wL72a-F",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-2",
        "headline": "Michigan Football Coach Was Fired and Then Arrested by Police",
        "content": "The main football coach at the University of Michigan, Sherrone Moore, got fired because he had a wrong kind of friendship with someone who worked with him. A few hours later, the police took him to jail because they think he might have hurt someone. They are still looking into what happened.",
        "originalSource": "People",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGzcrcJPh_pDqpePIPdHVaAJgF3IjCrFrzE1GhxGfVYU3936AbAbGJEQOZHU0eLygxEVXG6s8Q_QWcVNjKQALznR3TrG3UbNPHEG5qRZx03A5T7-a5_G-00la_WxAwMKKUV8_SCokCkoAuKO7j2odcAToDBRIpNKkPxYzVCLEreB8dxfZ96ZRnrNvGxJYdySvVsw6OSkoHO0eSthGc4MGDgmgE0BZA9MG9nenJO",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-3",
        "headline": "Lawmakers in Indiana Said No to President Trump's Election Map Idea",
        "content": "President Trump wanted to change how voting areas were drawn on a map in Indiana to help his party win more. But a lot of the lawmakers in Indiana, even some from his own party, voted against his idea. This was a big surprise because they usually agree with President Trump.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGmoKsLK6LiWLrL-e4bbqxTt7laVMTnnfXZcpHxeh6jZOrTuz1Gs6620zEGJipeXifxN16eX2ab2JoJQelqBRuCEMbAZxjz3KfXIMFZzGjXeUKlJIOmiZ0_wXBZ-B68lTJH8oeTx/uijPcEEUgiFDyWR4VINbAGmNTc-2k1g/MkaNUDDSypnS6Xixws2UsXvCFOXA450jifOS2yXP-heOPA-n6I_D37DTCI_k_fhy1MgoUbune2ME98XUCyQg==",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-4",
        "headline": "Houses Are Not Getting More Expensive Anymore, Which Is New!",
        "content": "For the first time in a long time, houses in America are actually costing a little bit less money, not more. This happened because it's really expensive to borrow money for a house, and there are more houses for sale. Experts think house prices might stay about the same for a while.",
        "originalSource": "CNBC",
        "sourceUrl": "https://www.cnbc.com/2025/12/11/us-home-prices-negative.html",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-5",
        "headline": "A Man Who Was Held by Immigration Police Is Now Free",
        "content": "A man named Kilmar Abrego Garcia, who is from El Salvador, was let out of jail. He was held by the immigration police, and his case was a big deal for President Trump's rules about people coming into the country. A judge said it wasn't fair to keep him locked up because he didn't have a final order to be sent away.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHPo_ySQS5WYp-T7P6fqFeAIEP9Etfc_BY7y6_gbjvxRnrcrYeuBxtSfyNCjLRXdlIDlCQsPgXm3JLq_cW5kWV8Ze8cHNiy0G4WRtXec988rkM8GpFBsbHUtqZ2SgEQd2davuarWTcz32sW7-dCvLVJoGfQ12FeyuRE9YTWaZIkTbPVYVjvFJLeFyo2deGvAV3DztCekC4k",
        "publishedTime": "1 day ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1765558118269-0",
        "headline": "The Crimson Current",
        "content": "A chill ran through Caracas. The U.S. tightened its grip, sanctioning three of President Nicolás Maduro's nephews and six ships accused of illicitly transporting Venezuelan oil. This strategic move intensified the pressure campaign, following the dramatic seizure of a sanctioned tanker just off the coast. Each new measure, orchestrated by the Trump administration, felt like another knot in a meticulously woven net, slowly, inexorably pulling the country towards an uncertain future. The once-free flow of oil, vital for survival, now navigated treacherous waters, shadowed by an ever-watchful global power.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHFzkm4-IoftIewna6_wQeQD_-kn7uG43WRLqaM4jgL4kb2mLZzM8XDY8R9giqjuNT_iAky5MGghQa9CnV85IjvnqjjvUKalOLgOTTYD9Q1tDxjulxCh4D7KGkRd5oKYRlsUpR4Fvej9j-iK5pu6ua3IA8amt9Cr_XwbhOehrzmK__P8seTtBw=",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-1",
        "headline": "The Minds That Dreamed Tomorrow",
        "content": "In 2025, Time magazine bestowed its highest honor upon the 'Architects of AI,' a pantheon of American tech visionaries including Sam Altman and Elon Musk. Their collective brilliance had not merely iterated upon existing technologies but forged an entirely new epoch. Artificial intelligence, once a distant dream, had become the undeniable force reshaping global information, economy, and geopolitics. The year belonged to algorithms, to neural networks, to the very fabric of thought woven by these titans. Their ingenuity, lauded on the magazine's iconic cover, marked a profound shift, signaling humanity's leap into a future reimagined by code.",
        "originalSource": "Global News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQG58L8TSleY02CFBvKw9qtXyFkDgl3Prw6QqQb6NtyH--WTHmdSIqMDPc_oq5h69ZF-WYT_8DRm54ssyAEuXvXAK-WCWnnpIj4XfVk5-nVVd9846nZPPDVIAAPpnPP7fifHgvALr8v_nSJVgH4DPIYZT8IgwvjJgsXbWWvIDGtGCMWVs40jWy-p2zVIjBPBeFnhx03QL3YJ3wL72a-F",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-2",
        "headline": "Echoes in the Lockup",
        "content": "The gridiron glory had faded. Sherrone Moore, the once-celebrated University of Michigan football head coach, found himself behind bars. His detention on Wednesday night followed an alleged assault, a stark contrast to the accolades of his former career. Hours earlier, the university had summarily fired him, a swift and brutal end to his tenure, citing credible evidence of an inappropriate relationship with a staff member. The allegations, now compounded by a criminal investigation, painted a somber picture. The roar of the crowd was replaced by the silent, sterile walls of a jail cell, a stunning and swift descent.",
        "originalSource": "People",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGzcrcJPh_pDqpePIPdHVaAJgF3IjCrFrzE1GhxGfVYU3936AbAbGJEQOZHU0eLygxEVXG6s8Q_QWcVNjKQALznR3TrG3UbNPHEG5qRZx03A5T7-a5_G-00la_WxAwMKKUV8_SCokCkoAuKO7j2odcAToDBRIpNKkPxYzVCLEreB8dxfZ96ZRnrNvGxJYdySvVsw6OSkoHO0eSthGc4MGDgmgE0BZA9MG9nenJO",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-3",
        "headline": "The Hoosier Holdout",
        "content": "Defiance bloomed in Indiana's Statehouse. Despite President Trump's intense pressure and overt threats, Senate Republicans cast a rare rebuke, striking down a congressional redistricting plan. The vote, 31-19, saw 21 Republicans joining every Democrat, a bipartisan surge against the White House's nationwide ambition to secure safer GOP districts. It was a significant setback for the President's aggressive campaign, a clear signal that even the most loyal could draw a line. In the quiet halls of Indianapolis, the legislators asserted their independence, proving that not all political wills bend to a singular force.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGmoKsLK6LiWLrL-e4bbqxTt7laVMTnnfXZcpHxeh6jZOrTuz1Gs6620zEGJipeXifxN16eX2ab2JoJQelqBRuCEMbAZxjz3KfXIMFZzGjXeUKlJIOmiZ0_wXBZ-B68lTJH8oeTx/uijPcEEUgiFDyWR4VINbAGmNTc-2k1g/MkaNUDDSypnS6Xixws2UsXvCFOXA450jifOS2yXP-heOPA-n6I_D37DTCI_k_fhy1MgoUbune2ME98XUCyQg==",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-4",
        "headline": "The Shifting Foundations",
        "content": "The bedrock of American prosperity trembled. For the first time in over two years, U.S. home prices dipped, a 1.4% decline over three months marking the first year-over-year national fall since mid-2023. Analysts pointed to an 'affordability shock,' a cruel convergence of stubbornly high mortgage rates and a swelling inventory of available homes. The once-relentless climb of the housing market had stalled, leaving many wondering if this plateau, or even a slight descent, would define the foreseeable future. The dream of homeownership, for many, felt like it was receding into the distance.",
        "originalSource": "CNBC",
        "sourceUrl": "https://www.cnbc.com/2025/12/11/us-home-prices-negative.html",
        "publishedTime": "1 day ago"
      },
      {
        "id": "story-1765558118269-5",
        "headline": "A Judge's Decree",
        "content": "The steel doors swung open for Kilmar Abrego Garcia. The Salvadoran national, whose prolonged detention had become a flashpoint in the Trump administration's immigration policy, walked free from ICE custody. A federal judge in Maryland, with a stroke of the pen, had ruled his detention unlawful. Authorities, the court declared, had held him again without a final deportation order, a critical legal oversight. His case, a beacon for advocates, underscored the complex and often contentious landscape of immigration law. For Kilmar, it was simply the end of one chapter and the hopeful beginning of another.",
        "originalSource": "The Washington Post",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHPo_ySQS5WYp-T7P6fqFeAIEP9Etfc_BY7y6_gbjvxRnrcrYeuBxtSfyNCjLRXdlIDlCQsPgXm3JLq_cW5kWV8Ze8cHNiy0G4WRtXec988rkM8GpFBsbHUtqZ2SgEQd2davuarWTcz32sW7-dCvLVJoGfQ12FeyuRE9YTWaZIkTbPVYVjvFJLeFyo2deGvAV3DztCekC4k",
        "publishedTime": "1 day ago"
      }
    ]
  }
}