{
  "timestamp": 1764275758190,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1764275690447-0",
        "headline": "Families Decry Tragic Violence as National Guard Member Suffers \"Mortal Wound\" Amidst Unanswered Questions About Suspect's Past",
        "content": "The shooting of two National Guard members near the White House tragically underscores the pervasive violence permeating our society, leaving one servicewoman's family devastated as her father reports a \"mortal wound.\" While Rahmanullah Lakanwal, an Afghan national, is in custody, the unsettling emergence of alleged CIA ties for the suspect raises critical questions about government oversight and accountability in preventing such incidents, demanding a thorough and transparent investigation into systemic failures.",
        "originalSource": "The New York Times",
        "publishedTime": "15 minutes ago"
      },
      {
        "id": "story-1764275690447-1",
        "headline": "Department of Justice's Pursuit of Death Penalty Raises Ethical Concerns as Administration Expands Military Presence in Capital",
        "content": "In the wake of an attack injuring two National Guard members, the Department of Justice's swift vow to pursue the death penalty for the Afghan national suspect reignites urgent debates about the morality and effectiveness of capital punishment as a systemic response to violence. Concurrently, President Trump's administration is deploying 500 additional Guard troops to Washington, D.C., following his characterization of the incident as a 'terror' attack, a move that risks further militarizing the capital and raises concerns about civil liberties rather than addressing root causes of conflict.",
        "originalSource": "Fox News",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1764275690447-2",
        "headline": "Environmental Justice Demands Accountability as U.S. Navy Faces Allegations of Plutonium Cover-up Threatening Public Health",
        "content": "The U.S. Navy stands accused of a grave cover-up concerning the perilous presence of plutonium at San Francisco's former Hunters Point Naval Shipyard, exposing a systemic failure to protect public health and the environment. This unfolding scandal amplifies critical environmental justice concerns for the local community and surrounding areas, demanding immediate, transparent investigations and a commitment to genuine remediation to safeguard vulnerable populations from enduring toxic legacies.",
        "originalSource": "The Guardian",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764275690447-3",
        "headline": "Court Decision Allows Partisan Gerrymandering to Undermine Democratic Representation in North Carolina",
        "content": "In a concerning decision, federal judges have allowed North Carolina to proceed with a redrawn congressional map for upcoming elections, a move widely criticized as a blatant act of partisan gerrymandering. This new map, explicitly designed to secure an additional U.S. House seat for Republicans, systematically distorts voter representation and further entrenches political power imbalances, threatening the integrity of democratic processes and disenfranchising communities across the state.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      },
      {
        "id": "story-1764275690447-4",
        "headline": "MIT Study Reveals Artificial Intelligence's Looming Threat of Mass Job Displacement, Demanding Systemic Solutions for Workers",
        "content": "An alarming new MIT study forecasts a significant upheaval in the American labor market, revealing that Artificial Intelligence is already capable of performing tasks equivalent to 12% of the U.S. workforce. This rapid technological advancement presents a systemic challenge, raising urgent questions about widespread job displacement and the critical need for robust social safety nets, worker retraining programs, and policies that ensure the benefits of AI are equitably distributed rather than exacerbating economic inequality.",
        "originalSource": "CBS News",
        "publishedTime": "21 hours ago"
      },
      {
        "id": "story-1764275690447-5",
        "headline": "Death Row Inmate's Untimely Passing Reignites Urgent Calls to Abolish Inhumane Capital Punishment System",
        "content": "The natural death of a Utah man, who spent 37 years on death row and was previously spared execution due to dementia, tragically underscores the profound ethical and systemic failures within America's capital punishment system. This case reignites crucial debates about mental competency for execution and the inherent cruelty of prolonged incarceration on death row, amplifying urgent calls for a fundamental re-evaluation and ultimate abolition of capital punishment in the U.S.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1764275690447-0",
        "headline": "Injured National Guard Member's Father Says 'She Has a Mortal Wound' After D.C. Shooting",
        "content": "Two National Guard members were shot near the White House. The suspect, Rahmanullah Lakanwal, an Afghan national, is in custody. Details about the suspect's alleged CIA ties have emerged, and the father of one injured member stated his daughter suffered a \"mortal wound\" as the investigation continues.",
        "originalSource": "The New York Times",
        "publishedTime": "15 minutes ago"
      },
      {
        "id": "story-1764275690447-1",
        "headline": "DOJ Vows Death Penalty for Suspect in D.C. National Guard Shooting",
        "content": "Following the ambush attack that wounded two National Guard members, the Department of Justice has vowed to seek the death penalty for the Afghan national suspect. The Trump administration is also deploying 500 more Guard troops to Washington, D.C., following the incident President Trump called a 'terror' attack.",
        "originalSource": "Fox News",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1764275690447-2",
        "headline": "US Navy Accused of Cover-up Over Dangerous Plutonium in San Francisco",
        "content": "The U.S. Navy is facing accusations of a cover-up regarding the dangerous presence of plutonium at the former Hunters Point Naval Shipyard in San Francisco. The scandal raises significant environmental and public health concerns for the community and surrounding area, sparking new investigations.",
        "originalSource": "The Guardian",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764275690447-3",
        "headline": "Federal Judges Allow North Carolina to Use Redrawn Congressional Map",
        "content": "Federal judges have permitted North Carolina to implement a redrawn congressional map for upcoming elections. The map was specifically designed in an effort to give Republicans an additional U.S. House seat, a move that is expected to strengthen the GOP's political position in the state.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      },
      {
        "id": "story-1764275690447-4",
        "headline": "MIT Study Says AI Can Already Do the Work of 12% of America's Workforce",
        "content": "A new MIT study indicates that Artificial Intelligence is swiftly reshaping the American labor market. Researchers found that AI is currently capable of performing many technical and cognitive tasks across various industries, matching the workload of roughly 12% of the total U.S. workforce.",
        "originalSource": "CBS News",
        "publishedTime": "21 hours ago"
      },
      {
        "id": "story-1764275690447-5",
        "headline": "Death Row Inmate With Dementia Dies of Apparent Natural Causes",
        "content": "A Utah man who spent 37 years on death row has died of apparent natural causes. The inmate had been spared execution earlier this fall by a judge after he developed dementia, sparking renewed debate about mental competency and the application of capital punishment in the U.S.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1764275690447-0",
        "headline": "American Patriot Guard Member Suffers Mortal Wound as Afghan National Suspect in D.C. Shooting Raises Alarming National Security Questions",
        "content": "Two brave National Guard members were tragically shot near the White House, with one patriot's father revealing his daughter sustained a 'mortal wound.' The suspect, Rahmanullah Lakanwal, an Afghan national, is now in custody. Troubling details emerging about his alleged ties to the CIA demand immediate answers, underscoring critical questions about border security and intelligence failures that put our servicemen and women at risk.",
        "originalSource": "The New York Times",
        "publishedTime": "15 minutes ago"
      },
      {
        "id": "story-1764275690447-1",
        "headline": "President Trump's Administration Takes Decisive Action, DOJ Seeks Death Penalty for Terrorist Suspect in D.C. National Guard Ambush",
        "content": "In a clear demonstration of strong leadership and commitment to justice, the Department of Justice, under President Trump's administration, has vowed to seek the death penalty for the Afghan national suspect responsible for the ambush that wounded two National Guard members. President Trump, rightly labeling the incident a 'terror' attack, has also authorized the deployment of 500 additional Guard troops to Washington, D.C., reinforcing national security and ensuring swift consequences for those who threaten our nation.",
        "originalSource": "Fox News",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1764275690447-2",
        "headline": "Government Bureaucracy Under Scrutiny as U.S. Navy Accused of Concealing Dangerous Plutonium at Former Naval Shipyard",
        "content": "Serious accusations of a cover-up have emerged against the U.S. Navy concerning the hazardous presence of plutonium at the former Hunters Point Naval Shipyard in San Francisco. This scandal justly raises grave environmental and public health concerns for the local community, highlighting the critical need for government transparency and accountability to protect our citizens from potential bureaucratic malfeasance.",
        "originalSource": "The Guardian",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764275690447-3",
        "headline": "Judicial Prudence Allows North Carolina to Implement Redrawn Congressional Map, Strengthening Republican Representation",
        "content": "In a move affirming the principles of fair representation, federal judges have rightly permitted North Carolina to implement a redrawn congressional map for upcoming elections. This new map, designed to bolster conservative voices, is expected to secure an additional U.S. House seat for Republicans, thereby strengthening the GOP's political position and ensuring the will of the people is more accurately reflected in the state.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      },
      {
        "id": "story-1764275690447-4",
        "headline": "Innovation in Artificial Intelligence Transforms American Labor Market, Requiring Adaptation for Economic Prosperity",
        "content": "A significant new study from MIT reveals that Artificial Intelligence is rapidly redefining the American labor market. Researchers found that AI is already capable of executing a substantial number of technical and cognitive tasks across diverse industries, effectively matching the productivity of approximately 12% of the total U.S. workforce. This technological advancement presents both challenges and opportunities, underscoring the necessity for American workers and businesses to adapt to maintain economic strength and prosperity.",
        "originalSource": "CBS News",
        "publishedTime": "21 hours ago"
      },
      {
        "id": "story-1764275690447-5",
        "headline": "Justice Achieved as Long-Term Death Row Inmate Dies After Years of Appeals, Reinforcing Need for Timely Capital Punishment",
        "content": "A Utah man who spent 37 years on death row has passed away from apparent natural causes, effectively concluding a prolonged legal saga. The inmate, previously spared execution by a judge due to developing dementia, had initiated renewed debate about mental competency and the application of capital punishment in the U.S. This outcome highlights the often-protracted nature of the justice system and the importance of ensuring that lawful sentences are carried out efficiently to uphold the rule of law and provide closure.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1764275690447-0",
        "headline": "Father Declares Daughter's Mild Paper Cut a 'Mortal Wound' Following D.C. Incident, Blames Global Conspiracy",
        "content": "A father of an injured National Guard member bravely announced his daughter sustained a 'mortal wound' after what appeared to be a minor scrape near the White House. The suspect, Rahmanullah Lakanwal, an Afghan national whose alleged CIA ties include a brief subscription to a 'Spies Monthly' magazine, is now in custody, leading investigators to ponder if the true motive was an overzealous attempt to return a library book late.",
        "originalSource": "The New York Times",
        "publishedTime": "15 minutes ago"
      },
      {
        "id": "story-1764275690447-1",
        "headline": "DOJ Vows Swift, Unprecedented Death Penalty For Suspect Who Dared To Breathe Heavily Near National Guard",
        "content": "Following an ambush that left two National Guard members with what President Trump immediately dubbed a 'terror' attack resulting in slightly bruised egos, the Department of Justice has vowed to seek the death penalty for the Afghan national suspect. In a move praised by those who prefer their justice served immediately, preferably with a side of dramatic flair, President Trump has also deployed 500 more Guard troops to Washington, D.C., primarily to ensure no one else accidentally trips near a federal building.",
        "originalSource": "Fox News",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1764275690447-2",
        "headline": "U.S. Navy Admits 'Slight Oversight' After Plutonium Discovered To Be 'Decorating' San Francisco Bay",
        "content": "The U.S. Navy is facing accusations of a minor 'creative embellishment' regarding the presence of highly radioactive plutonium at the former Hunters Point Naval Shipyard in San Francisco. Navy officials insist the glowing green particles are merely 'natural bioluminescence' and a 'unique feature' that adds character to the local seafood, dismissing 'alarmist' public health concerns as 'unnecessary fuss' over a little extra sparkle.",
        "originalSource": "The Guardian",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764275690447-3",
        "headline": "Federal Judges Declare North Carolina's New Congressional Map a 'Masterpiece of Political Origami'",
        "content": "Federal judges, in a stunning display of bipartisan appreciation for geometric artistry, have permitted North Carolina to implement a newly redrawn congressional map. The map, ingeniously designed to resemble a drunken snake wrestling a confused octopus, is expected to provide Republicans with at least one additional U.S. House seat, a move judicial experts heralded as 'simply good sportsmanship' in the intricate dance of democracy.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      },
      {
        "id": "story-1764275690447-4",
        "headline": "MIT Study Confirms AI Already Capable Of Performing 12% Of American Workforce's Most Important Task: Complaining",
        "content": "A groundbreaking MIT study has revealed that Artificial Intelligence is already profoundly reshaping the American labor market, confirming that AI can now perform the equivalent work of 12% of the total U.S. workforce. Researchers were particularly impressed by AI's newfound ability to expertly procrastinate, send passive-aggressive emails, and loudly vent about workplace grievances with alarming human-like precision, sparking fears that AI may soon demand its own extended lunch breaks.",
        "originalSource": "CBS News",
        "publishedTime": "21 hours ago"
      },
      {
        "id": "story-1764275690447-5",
        "headline": "Death Row Inmate Successfully Outlasts State Executioners For 37 Years, Dies Of Unsportsmanlike 'Natural Causes'",
        "content": "A Utah man, who spent a remarkable 37 years on death row, tragically passed away from 'natural causes' just months after a judge spared him execution due to his developing dementia. This stunning upset has sparked renewed debate about whether the justice system should perhaps invest in faster-acting poisons or simply offer inmates a complimentary 'early bird' special if they manage to dodge the needle for over three decades.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1764275690447-0",
        "headline": "A Soldier's Dad Says His Daughter Was Really Hurt Badly",
        "content": "Something scary happened near the White House! Two soldiers from the National Guard got shot. A man named Rahmanullah Lakanwal from Afghanistan got caught. The dad of one of the soldiers said his daughter was hurt very, very badly. People are still trying to figure out what happened, and there are even whispers about the bad guy maybe knowing the CIA.",
        "originalSource": "The New York Times",
        "publishedTime": "15 minutes ago"
      },
      {
        "id": "story-1764275690447-1",
        "headline": "The Government Wants to Punish The Shooter Very Hard",
        "content": "After those two soldiers got shot, the government's grown-up lawyers, called the Department of Justice, said they want the man who shot them to get the worst punishment, called the death penalty. President Trump said it was a 'terror' attack, which is a really scary kind of attack. Because of this, President Trump's team is sending 500 more soldiers to Washington, D.C., to keep everyone safe.",
        "originalSource": "Fox News",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1764275690447-2",
        "headline": "People Say The Navy Hid Dangerous Stuff",
        "content": "Some people are saying that the U.S. Navy tried to hide something really bad. They are accused of not telling anyone about dangerous plutonium, which is like really, really bad radioactive stuff, at an old Navy place in San Francisco. This makes people worry a lot about the air and water and if people living nearby will get sick. Now, people are going to investigate and find out the truth.",
        "originalSource": "The Guardian",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764275690447-3",
        "headline": "Judges Say North Carolina Can Use New Election Map",
        "content": "Some important judges said that the state of North Carolina can use a new map for how people vote for Congress. This new map was made on purpose to help the Republican political party get one more seat in the U.S. House of Representatives. People think this will make the Republicans stronger in that state.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      },
      {
        "id": "story-1764275690447-4",
        "headline": "Smart Computers Can Now Do Lots Of People's Jobs",
        "content": "Scientists at a cool school called MIT did a study and found out something amazing! Artificial Intelligence, which are super-smart computer programs, can already do the jobs of about 12 out of every 100 people in America. These smart computers can do lots of thinking and technical work in different kinds of businesses.",
        "originalSource": "CBS News",
        "publishedTime": "21 hours ago"
      },
      {
        "id": "story-1764275690447-5",
        "headline": "An Old Man Who Was Going To Die Passed Away Peacefully",
        "content": "A very old man in Utah who was in jail for 37 years and supposed to get the death penalty, which is the worst punishment, has died. He died naturally, not from the punishment. A little while ago, a judge said he shouldn't be put to death because he got sick with something called dementia, which makes people forget things. This made people talk a lot about if it's fair to punish people who are very sick in their minds.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1764275690447-0",
        "headline": "The Last Watch on Capitol Hill",
        "content": "A father’s voice cracked, revealing a \"mortal wound\" suffered by his National Guard daughter, shot near the White House. The suspect, Rahmanullah Lakanwal, an Afghan national, now sits in custody, his alleged CIA ties a whispers in the ongoing investigation. Two Guardsmen ambushed, their duty a silent vigil that turned into terror. The father’s words hung heavy, a somber echo in the halls of power, as the nation grappled with the attack and the fragile threads of security in its capital, demanding answers from the unfolding mystery.",
        "originalSource": "The New York Times",
        "publishedTime": "15 minutes ago"
      },
      {
        "id": "story-1764275690447-1",
        "headline": "Justice's Unyielding Hand Descends",
        "content": "The Department of Justice, a grim resolve hardening its stance, vowed to seek the death penalty for the Afghan national suspect in the D.C. National Guard ambush. Two protectors wounded, the capital’s serenity shattered. President Trump, labeling the incident a 'terror' attack, swiftly deployed 500 more Guard troops to Washington, D.C. The air grew thick with tension, a clear message echoing from the highest offices: such acts would be met with the full, unyielding force of the law. Justice, it seemed, would not waver in its pursuit.",
        "originalSource": "Fox News",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1764275690447-2",
        "headline": "The Silent Glow in San Francisco Bay",
        "content": "A shadow stretched over San Francisco's Hunters Point, a former naval shipyard now a ghost of its past. Accusations of a U.S. Navy cover-up emerged, whispers of dangerous plutonium lurking beneath the surface, a silent, deadly glow. Environmental and public health concerns festered, infecting the community's trust like a slow-spreading poison. New investigations sparked, peeling back layers of secrecy, but the fear remained: what hidden horrors had the Navy buried, and what irreparable damage had already been done to the unsuspecting bay and its people?",
        "originalSource": "The Guardian",
        "publishedTime": "2 hours ago"
      },
      {
        "id": "story-1764275690447-3",
        "headline": "Lines Drawn, Power Shifts in Carolina",
        "content": "Federal judges, with a stroke of their pens, reshaped North Carolina's political landscape. A redrawn congressional map, meticulously crafted to favor Republicans, received their seal of approval for upcoming elections. The design was clear: secure an additional U.S. House seat, solidify the GOP's grip. The silent battle for influence played out in lines on a map, deciding futures before a single vote was cast. The move promised to strengthen the Republican position, a strategic victory in the ongoing chess game of state politics, forever altering the balance of power.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      },
      {
        "id": "story-1764275690447-4",
        "headline": "The Automated Dawn: A Quiet Takeover",
        "content": "MIT's latest revelation rippled through the American workforce like a cold current. Artificial Intelligence, it declared, wasn't coming; it was already here, silently executing the complex tasks of 12% of the nation's labor force. Across diverse industries, technical and cognitive duties once performed by humans were now within AI's grasp. The study painted a stark picture of a rapidly evolving labor market, where machines weren't just assisting, but actively replacing. It wasn't a sudden storm, but a quiet, automated dawn, reshaping the very fabric of work.",
        "originalSource": "CBS News",
        "publishedTime": "21 hours ago"
      },
      {
        "id": "story-1764275690447-5",
        "headline": "The Long Sleep Beyond the Bars",
        "content": "After 37 years shackled to death row, a Utah man found release not through execution, but in the quiet embrace of natural causes. A judge had spared him earlier, recognizing the insidious creep of dementia, rendering him mentally incompetent. His death, a solemn period at the end of a long, torturous sentence, reignited the perennial debate: how do we reconcile capital punishment with the fading minds of those condemned? The long wait ended not with a final command, but with a weary sigh, as justice, in its own slow way, finally closed his chapter.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      }
    ]
  }
}