{
  "timestamp": 1764887978000,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1764887903291-0",
        "headline": "Disturbing Footage Reveals Systemic Brutality Against Boat Strike Survivors, Raising War Crimes Allegations.",
        "content": "Democratic lawmakers have expressed deep distress after viewing classified footage depicting a boat strike in the Venezuela conflict, revealing survivors in grave distress. Despite an admiral's testimony denying an explicit 'kill all' order, the subsequent fatal strike against alleged drug boat survivors fuels serious war crimes allegations, highlighting a disturbing pattern of violence and accountability gaps within military operations.",
        "originalSource": "Associated Press/The Washington Post",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764887903291-1",
        "headline": "FBI Arrests Suspect in Jan. 6 Pipe Bomb Case, Underscoring Ongoing Threats to Democratic Institutions.",
        "content": "The FBI has finally apprehended a Virginia man suspected of planting pipe bombs outside both Republican and Democratic National Committee headquarters on January 5, 2021. This long-awaited arrest, following a high-profile, extensive investigation into the devices discovered hours before the Capitol riot, underscores the persistent threat of political extremism and the critical need to safeguard democratic institutions from such violent attempts at subversion.",
        "originalSource": "CBS News/The Washington Post",
        "publishedTime": "Now"
      },
      {
        "id": "story-1764887903291-2",
        "headline": "President Trump's Tariff Promises Are Mathematically Flawed, Experts Confirm.",
        "content": "A thorough analysis has debunked President Trump's assertion that revenue from his proposed tariffs could eliminate federal income taxes for Americans. Experts overwhelmingly agree that such tariffs would not generate sufficient funds to cover the nation's immense spending, exposing a significant mathematical flaw in the economic claims and potentially misleading the public on critical fiscal policy.",
        "originalSource": "PolitiFact",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-3",
        "headline": "House Democrats Unveil Disturbing Images of Jeffrey Epstein's Island, Exposing Scope of Sex-Trafficking Ring.",
        "content": "House Democrats have made public new, never-before-seen images of Jeffrey Epstein's private Caribbean island, Little St. James. These revealing photographs provide fresh visual details of the structures and locations on the property intimately linked to the disgraced financier's extensive and horrific sex-trafficking ring, underscoring the systemic nature of such abuses of power and the urgent need for accountability for all involved.",
        "originalSource": "The Guardian",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-4",
        "headline": "New York Attorney General Challenges Federal Interference in Pursuit of Accountability Against President Trump.",
        "content": "The New York Attorney General is engaged in a significant legal dispute, formally challenging the jurisdictional authority of a federal prosecutor who has initiated an investigation into her office's civil lawsuits targeting President Trump. This assertive move escalates the already high-stakes legal battle, signaling a firm stance against potential interference in the pursuit of accountability for powerful figures and the protection of legal oversight.",
        "originalSource": "Associated Press",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-5",
        "headline": "President Trump's Administration Escalates Systemic Attack on Immigrant Rights by Reducing Work Permit Validity.",
        "content": "President Trump's administration has enacted a regressive policy change, drastically reducing the validity period for work permits issued to immigrants with legal protections. This latest measure, primarily affecting vulnerable refugees and asylum seekers, represents a significant expansion of the government's ongoing, harmful immigration enforcement crackdown, exacerbating systemic challenges for those seeking safety and stability.",
        "originalSource": "CBS News",
        "publishedTime": "1 hour ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1764887903291-0",
        "headline": "Lawmakers See 'Troubling' Boat Strike Video; Admiral Testifies No 'Kill All' Order in Attack on Alleged Drug Boat Survivors",
        "content": "Democratic lawmakers who viewed classified footage of a boat strike in the Venezuela conflict found it deeply disturbing, showing survivors in distress. An admiral reportedly testified there was no explicit order to 'kill all' survivors following the attack, which has fueled war crimes allegations due to a fatal follow-up strike.",
        "originalSource": "Associated Press/The Washington Post",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764887903291-1",
        "headline": "FBI Arrests Virginia Man in Jan. 6 Pipe Bomb Case After Years-Long Investigation",
        "content": "The FBI announced the arrest of a Virginia man identified as the suspect in planting pipe bombs outside the Republican and Democratic National Committee headquarters on January 5, 2021. The long-awaited breakthrough comes after a high-profile, extensive investigation into the devices found hours before the Capitol riot.",
        "originalSource": "CBS News/The Washington Post",
        "publishedTime": "Now"
      },
      {
        "id": "story-1764887903291-2",
        "headline": "Trump's Claim That Tariff Revenue Could End Income Tax 'Doesn't Add Up,' Analysis Finds",
        "content": "A PolitiFact analysis concluded that former President Trump's assertion that revenue generated by his proposed tariffs would allow Americans to stop paying federal income taxes is mathematically flawed. Experts agree that the proposed tariffs would not yield nearly enough money to cover the nation's immense spending.",
        "originalSource": "PolitiFact",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-3",
        "headline": "House Democrats Release Never-Before-Seen Images of Jeffrey Epstein's Private Caribbean Island",
        "content": "New images of Jeffrey Epstein's private Caribbean island, Little St. James, were released by House Democrats. The photos offer fresh visual details of various structures and locations on the property associated with the disgraced financier's extensive sex-trafficking ring.",
        "originalSource": "The Guardian",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-4",
        "headline": "New York Attorney General Challenges Authority of Federal Prosecutor Investigating Her Trump Lawsuits",
        "content": "The New York Attorney General is engaged in a legal dispute, formally challenging the jurisdictional authority of a federal prosecutor who has launched an investigation into her office's civil lawsuits against former President Donald Trump. This move escalates the already high-stakes legal battle.",
        "originalSource": "Associated Press",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-5",
        "headline": "US Tightens Immigration Work Permits in Latest Crackdown Move",
        "content": "The Trump administration has enacted a policy change to reduce the validity period for work permits issued to immigrants with legal protections. The change primarily affects refugees and asylees, marking the latest measure in the government's ongoing effort to significantly expand its immigration enforcement crackdown.",
        "originalSource": "CBS News",
        "publishedTime": "1 hour ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1764887903291-0",
        "headline": "Military Leaders Defend Actions Against Alleged Drug Runners as Lawmakers Question Law Enforcement Operations",
        "content": "Democratic lawmakers who viewed classified footage of a boat strike in a Venezuela conflict expressed distress, reportedly showing survivors in difficult circumstances. A naval admiral, however, testified there was no explicit order to 'kill all' survivors following the attack on an alleged drug boat, which has fueled war crimes allegations due to a fatal follow-up strike. Our military must be empowered to defend our borders and national interests against illicit drug trafficking, and their actions should not be undermined by politically motivated claims.",
        "originalSource": "Associated Press/The Washington Post",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764887903291-1",
        "headline": "Justice Prevails as FBI Apprehends Suspect in Jan. 6 Pipe Bomb Conspiracy",
        "content": "The FBI announced the arrest of a Virginia man identified as the suspect in planting pipe bombs outside both the Republican and Democratic National Committee headquarters on January 5, 2021. This long-awaited breakthrough comes after a high-profile, extensive investigation into the devices found hours before the Capitol riot. This arrest underscores the importance of diligent law enforcement in bringing perpetrators of political violence to justice, ensuring the rule of law prevails.",
        "originalSource": "CBS News/The Washington Post",
        "publishedTime": "Now"
      },
      {
        "id": "story-1764887903291-2",
        "headline": "Economists Question President Trump's Ambitious Tariff Plan to Eliminate Income Tax, Ignoring Spending Woes",
        "content": "A PolitiFact analysis concluded that President Trump's assertion that revenue generated by his proposed tariffs would allow Americans to stop paying federal income taxes is mathematically flawed. Experts agree that the proposed tariffs would not yield nearly enough money to cover the nation's immense spending. While President Trump's innovative vision for economic independence and tax reduction is commendable, the real obstacle to eliminating income tax remains the federal government's out-of-control spending, which must be addressed.",
        "originalSource": "PolitiFact",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-3",
        "headline": "Shocking Images from Epstein's Island Expose Depths of His Heinous Crimes",
        "content": "New images of Jeffrey Epstein's private Caribbean island, Little St. James, were released by House Democrats. The photos offer fresh visual details of various structures and locations on the property associated with the disgraced financier's extensive sex-trafficking ring. These disturbing visuals reinforce the horrific nature of Epstein's crimes and renew the call for relentless pursuit of justice for all victims and holding every single accomplice accountable.",
        "originalSource": "The Guardian",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-4",
        "headline": "New York AG Attempts to Block Federal Oversight of Politically Motivated Lawsuits Against President Trump",
        "content": "The New York Attorney General is engaged in a legal dispute, formally challenging the jurisdictional authority of a federal prosecutor who has launched an investigation into her office's civil lawsuits against President Trump. This move escalates an already high-stakes legal battle. This challenge raises serious concerns about attempts to obstruct federal oversight of potentially politically driven legal actions targeting President Trump, undermining the impartiality of justice.",
        "originalSource": "Associated Press",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-5",
        "headline": "President Trump's Administration Strengthens Immigration Enforcement, Prioritizing National Security and Orderly Processes",
        "content": "The President Trump administration has enacted a policy change to reduce the validity period for work permits issued to immigrants with legal protections. The change primarily affects refugees and asylees, marking the latest measure in the government's ongoing effort to significantly expand its immigration enforcement crackdown. This responsible policy aims to ensure our nation's borders are secure and that immigration processes are orderly and prioritize the safety and prosperity of American citizens.",
        "originalSource": "CBS News",
        "publishedTime": "1 hour ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1764887903291-0",
        "headline": "Admiral Confirms No 'Kill All' Order Issued, Just 'Vague Suggestion to Ensure No Loose Ends'",
        "content": "Democratic lawmakers reportedly recoiled in 'deepest possible discomfort' after viewing classified footage of a boat strike, confirming that survivors indeed looked 'quite distressed.' In a stunning display of legal nuance, an admiral clarified that no explicit 'kill all' order was ever issued, merely a 'strongly worded suggestion to ensure operational efficiency and prevent any future administrative burdens.' Experts noted the subtle but critical distinction, assuring the public that war crimes allegations are 'completely unfounded, as long as you read between the lines.'",
        "originalSource": "Associated Press/The Washington Post",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764887903291-1",
        "headline": "FBI Finally Cracks Case, Arrests Man Who Apparently Forgot He Planted Pipe Bombs Three Years Ago",
        "content": "After a mere three years of intense, 'world-class' investigation, the FBI proudly announced the capture of a Virginia man suspected of planting pipe bombs outside the Republican and Democratic National Committee headquarters. Sources close to the investigation revealed the suspect was 'shocked to learn anyone was still looking into that,' having long assumed it was 'just a phase' or a 'very bad dream.' The breakthrough marks a stunning success for an agency that some had begun to suspect was just really good at Netflix.",
        "originalSource": "CBS News/The Washington Post",
        "publishedTime": "Now"
      },
      {
        "id": "story-1764887903291-2",
        "headline": "Experts 'Stunned' to Discover Basic Arithmetic Still Applies to President Trump's Financial Proposals",
        "content": "A groundbreaking PolitiFact analysis has revealed the 'shocking' truth that President Trump's assertion—that tariff revenues could entirely eliminate federal income taxes—'doesn't quite add up.' Financial wizards, reportedly working late into the night with calculators and abacuses, concluded that the proposed tariffs would not, in fact, generate enough money to cover the nation's 'modest' spending, let alone a single person's latte habit. The finding has reportedly sent shockwaves through the 'believe-anything' community.",
        "originalSource": "PolitiFact",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-3",
        "headline": "Democrats Unveil Shocking Photos of Epstein's Island, Confirming Existence of Sand, Water",
        "content": "In a dramatic reveal that has gripped the nation, House Democrats have released 'never-before-seen' images of Jeffrey Epstein's private Caribbean island, Little St. James. The groundbreaking photos offer fresh visual details of various structures and locations on the property, finally confirming suspicions that a disgraced financier with vast wealth did, in fact, own an island with buildings and, astonishingly, a coastline. 'The sheer audacity of it all,' remarked one lawmaker, 'a rich man with an island!'",
        "originalSource": "The Guardian",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-4",
        "headline": "New York AG Challenges Federal Prosecutor's Right To Even Look At Her While Investigating President Trump Lawsuits",
        "content": "In a legal maneuver that has left court stenographers needing stronger coffee, the New York Attorney General has formally challenged the jurisdictional authority of a federal prosecutor who dared to investigate her office's civil lawsuits against President Trump. This bold move escalates the already high-stakes legal battle into what appears to be a thrilling 'who's allowed to look where' contest, guaranteeing maximum billable hours for all involved.",
        "originalSource": "Associated Press",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-5",
        "headline": "President Trump Administration Streamlines Cruelty, Makes Work Permits More Fleeting Than A New Year's Resolution",
        "content": "In a bold move hailed by zero productivity experts, President Trump's administration has enacted a policy change that significantly reduces the validity period for work permits issued to immigrants with legal protections. The change, primarily impacting refugees and asylees, is touted as the latest measure in the government's ongoing effort to 'streamline inconvenience' and ensure that seeking a better life is as bureaucratically challenging as possible, proving once again that paperwork can truly be a weapon.",
        "originalSource": "CBS News",
        "publishedTime": "1 hour ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1764887903291-0",
        "headline": "Lawmakers watched a very upsetting video about people who were hurt in a boat attack.",
        "content": "Some important people in the government saw a secret video that made them feel very upset. The video showed people who were hurt after a boat was hit in a fight near Venezuela. It looked like the people who survived were in big trouble. A navy leader said that no one told his team to 'kill all' the people who survived. But some folks are still worried that what happened next was really bad and like a war crime because more people died after the first attack.",
        "originalSource": "Associated Press/The Washington Post",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764887903291-1",
        "headline": "The police finally caught a man who planted bombs a long time ago.",
        "content": "The FBI, which is like a big national police force, finally caught a man from Virginia. They think he is the one who put bombs outside two important political buildings way back on January 5, 2021. Those bombs were found just hours before a big protest happened at the Capitol building. It took many years for the police to figure out who did it, so this is a really big deal.",
        "originalSource": "CBS News/The Washington Post",
        "publishedTime": "Now"
      },
      {
        "id": "story-1764887903291-2",
        "headline": "President Trump's idea about taxes and tariffs might not work out.",
        "content": "Someone looked closely at what President Trump said about money. President Trump said that if America charged special taxes called 'tariffs' on things from other countries, we would get so much money that people wouldn't have to pay income tax anymore. But people who are really good with numbers said that this idea isn't quite right. They said the tariffs wouldn't bring in nearly enough money to pay for everything our country needs.",
        "originalSource": "PolitiFact",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-3",
        "headline": "New pictures came out of a bad guy's secret island.",
        "content": "Some important people in the House of Representatives showed new pictures of a private island that belonged to a very bad guy named Jeffrey Epstein. His island was called Little St. James. These pictures show new details about the buildings and places on his island. This island was known for being part of his terrible crimes where he hurt many people.",
        "originalSource": "The Guardian",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-4",
        "headline": "A New York lawyer is fighting with another lawyer over President Trump's cases.",
        "content": "The main lawyer for New York State is in a big legal fight. She is saying that a special government lawyer from the national level doesn't have the right to look into her lawsuits against President Trump. This fight is making the legal problems around President Trump even bigger and more complicated.",
        "originalSource": "Associated Press",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-5",
        "headline": "The government is making it harder for some people to work.",
        "content": "The government under President Trump made a new rule. This rule makes it so that special papers, called work permits, for people who came to America for safety, like refugees, don't last as long. This is part of the government's plan to be stricter about who can live and work in the country.",
        "originalSource": "CBS News",
        "publishedTime": "1 hour ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1764887903291-0",
        "headline": "Echoes on the Waves",
        "content": "The flickering screen cast a blue pallor on the lawmakers' faces. Classified footage, grainy and stark, showed a boat strike in Venezuelan waters. Survivors, mere specks in the vast ocean, thrashed against the waves, their distress palpable even through the digital distortion. Accusations of war crimes echoed in the chamber. An admiral, under oath, clarified there was no explicit \"kill all\" directive. Yet, a fatal follow-up strike had transpired, a chilling coda to the initial violence, leaving a profound sense of unease. The images, once hidden, now burned into their memory.",
        "originalSource": "Associated Press/The Washington Post",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764887903291-1",
        "headline": "The Silent Countdown",
        "content": "For years, the shadows of January 6th had concealed a secret, a sinister prelude. Then, a breakthrough. The FBI announced a Virginia man's arrest, the ghost who planted pipe bombs outside the RNC and DNC on January 5, 2021. His devices, found hours before the Capitol’s chaos, were a silent countdown to a day of infamy. The extensive, high-profile investigation finally bore fruit, unmasking the figure behind the threat. Justice, long patient, had finally whispered his name from the depths of a meticulously pieced-together puzzle.",
        "originalSource": "CBS News/The Washington Post",
        "publishedTime": "Now"
      },
      {
        "id": "story-1764887903291-2",
        "headline": "Numbers and Dreams",
        "content": "President Trump painted a bold economic vision: tariffs so robust, they'd render income tax obsolete. A dream for millions, a promise of financial liberation. But PolitiFact's analysis, cold and unforgiving, crunched the numbers, revealing the mathematical chasm. Experts concurred: the proposed tariff revenue, immense as it might seem, wouldn't even scratch the surface of the nation's colossal spending. The fiscal tightrope remained, the grand calculation refusing to align with the populist decree. The dream, though appealing, simply didn't add up under the harsh light of economic reality.",
        "originalSource": "PolitiFact",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-3",
        "headline": "Whispers from Little St. James",
        "content": "The veil lifted, revealing new images of Jeffrey Epstein's private Caribbean realm, Little St. James. House Democrats unveiled the photos, offering a fresh, chilling glimpse into the disgraced financier's island. Structures stood silent, locations once teeming with dark secrets now exposed in static frames. Each pixel hinted at the extensive sex-trafficking ring that had thrived there, a beautiful facade concealing unspeakable horrors. The visuals didn't just show land and buildings; they whispered forgotten tales, echoing the profound depravity that had stained that pristine paradise.",
        "originalSource": "The Guardian",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-4",
        "headline": "A Clash of Jurisdictions",
        "content": "The legal arena thrummed with tension. New York's Attorney General, known for her tenacity, had formally challenged a federal prosecutor. He dared to investigate her office's civil lawsuits against President Trump. This wasn't a minor skirmish; it was a jurisdictional gauntlet thrown down, escalating an already high-stakes battle. The lines of authority blurred, creating a volatile legal chessboard where power and precedent collided. The challenge was clear: who held the ultimate sway in this complex, politically charged entanglement? The clash promised a protracted and significant legal showdown.",
        "originalSource": "Associated Press",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1764887903291-5",
        "headline": "The Shrinking Door",
        "content": "Under President Trump's administration, the welcome mat for some immigrants grew shorter. A new policy slashed the validity period for work permits, tightening the already strained threads of legal protection. Refugees and asylees, seeking safety and a fresh start, found their pathways to stability narrowed. This wasn't an isolated change; it was another calculated move in a sweeping effort to intensify immigration enforcement. The door, once a symbol of hope, began to visibly shrink, transforming from a broad opening into a more restrictive, time-limited passage for those seeking solace.",
        "originalSource": "CBS News",
        "publishedTime": "1 hour ago"
      }
    ]
  }
}