{
  "timestamp": 1765042383534,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1765042309082-0",
        "headline": "Supreme Court Will Decide the Fate of Birthright Citizenship, Upholding Fundamental Rights Against President Trump's Executive Order",
        "content": "The Supreme Court has agreed to hear a pivotal case challenging the legality of a controversial executive order signed by President Trump that seeks to dismantle birthright citizenship in the United States. This decision carries profound implications for immigration law, constitutional rights, and the very fabric of American society, as progressive advocates warn of the order's deeply anti-immigrant and exclusionary aims.",
        "originalSource": "PBS News",
        "publishedTime": "17 hours ago"
      },
      {
        "id": "story-1765042309082-1",
        "headline": "Disturbing Video Reveals US Military's Second Deadly Strike on Civilian Survivors, Raising Urgent Questions About Accountability and Protocols",
        "content": "New video evidence has surfaced, suggesting that survivors of a US boat strike in the Caribbean were left clinging to wreckage for over an hour before the Pentagon authorized a second, deadly follow-up attack. This horrifying revelation is fueling calls from Democrats and human rights organizations for an expanded inquiry into the incident, demanding accountability for systemic failures in military procedures and rules of engagement that led to such a tragic loss of life.",
        "originalSource": "The Guardian",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765042309082-2",
        "headline": "FBI Arrest in Jan. 6 Pipe Bomb Investigation Highlights Persistent Threat of Political Extremism and Domestic Terrorism",
        "content": "The FBI has reportedly made an arrest in the long-running investigation into the pipe bombs discovered near the DNC and RNC headquarters in Washington D.C., placed just hours before the January 6th Capitol attack. This development underscores the grave and persistent threat of political extremism and domestic terrorism that continues to challenge democratic institutions, with the suspect reportedly identified as a supporter of President Trump's agenda.",
        "originalSource": "CBS News",
        "publishedTime": "24 hours ago"
      },
      {
        "id": "story-1765042309082-3",
        "headline": "CDC Panel's Decision to Revoke Infant Hepatitis B Vaccine Recommendation Endangers Public Health and Undermines Science-Based Policy",
        "content": "An advisory panel appointed by the CDC under its new director, RFK Jr., has voted to drop the long-standing recommendation for the hepatitis B vaccine to be given to infants at birth. This alarming decision has sparked immediate and widespread fears among medical experts and public health advocates, who warn of the dangerous precedent it sets for the US childhood vaccine schedule and the potential erosion of science-based public health policy in favor of misinformation.",
        "originalSource": "PBS News",
        "publishedTime": "18 hours ago"
      },
      {
        "id": "story-1765042309082-4",
        "headline": "Media Consolidation Deepens as Netflix Acquires Warner Bros., Raising Concerns About Market Monopolies and Cultural Diversity",
        "content": "In a massive move poised to reshape the entertainment industry, Netflix has reportedly struck a deal to acquire Warner Bros. Discovery. This significant consolidation of media assets immediately raises critical questions about market monopolies, the shrinking landscape for independent content creators, and the potential impact on cultural diversity and consumer choice in an increasingly concentrated industry.",
        "originalSource": "The Guardian",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765042309082-5",
        "headline": "Texas Flood 911 Calls Expose Devastating Human Cost of Climate Crisis and Inadequate Infrastructure",
        "content": "Emergency services have released harrowing audio from 911 calls made during the recent catastrophic flooding in Texas, which tragically captured the chaotic and desperate final moments of several individuals pleading for urgent rescue from rapidly rising waters and structural damage. These calls starkly reveal the devastating human cost of the escalating climate crisis and expose systemic failures in infrastructure and disaster preparedness that disproportionately impact vulnerable communities.",
        "originalSource": "Associated Press (via PBS News)",
        "publishedTime": "17 hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1765042309082-0",
        "headline": "Supreme Court to decide constitutionality of Trump's order ending birthright citizenship",
        "content": "The Supreme Court has agreed to hear a major case challenging the legality of a controversial executive order signed by President Trump that seeks to end birthright citizenship in the United States. The decision will have profound implications for immigration law and constitutional rights.",
        "originalSource": "PBS News",
        "publishedTime": "17 hours ago"
      },
      {
        "id": "story-1765042309082-1",
        "headline": "US airstrike survivors clung to boat wreckage for an hour before second deadly attack, video shows",
        "content": "New video evidence suggests that survivors of a US boat strike in the Caribbean were clinging to wreckage for over an hour before the Pentagon authorized a second, deadly follow-up strike. Democrats are now pressing for an expanded inquiry into the incident and military procedures.",
        "originalSource": "The Guardian",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765042309082-2",
        "headline": "FBI makes arrest in probe of pipe bombs placed in D.C. on eve of Jan. 6",
        "content": "The FBI has reportedly made an arrest in the long-running investigation into the pipe bombs discovered near the DNC and RNC headquarters in Washington D.C., placed just hours before the January 6th Capitol attack. The suspect is believed to be a Trump supporter.",
        "originalSource": "CBS News",
        "publishedTime": "24 hours ago"
      },
      {
        "id": "story-1765042309082-3",
        "headline": "RFK-appointed CDC panel drops hepatitis B vaccine at birth recommendation",
        "content": "An advisory panel appointed by the CDC under its new director, RFK Jr., has voted to drop the long-standing recommendation for the hepatitis B vaccine to be given to infants at birth, sparking immediate fears among medical experts for the US childhood vaccine schedule.",
        "originalSource": "PBS News",
        "publishedTime": "18 hours ago"
      },
      {
        "id": "story-1765042309082-4",
        "headline": "Netflix inks deal for troubled Hollywood giant Warner Bros.",
        "content": "In a massive move for the entertainment industry, Netflix has reportedly struck a deal to acquire Warner Bros. Discovery, signaling a major consolidation of media assets and raising questions about the future of one of Hollywood's oldest studios and its extensive content library.",
        "originalSource": "The Guardian",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765042309082-5",
        "headline": "Newly released 911 calls from Texas floods reveal chaotic and desperate pleas for rescues",
        "content": "Emergency services have released audio from 911 calls made during the recent catastrophic flooding in Texas, which tragically captured the chaotic and desperate final moments of several individuals pleading for urgent rescue from the rapidly rising waters and structural damage.",
        "originalSource": "Associated Press (via PBS News)",
        "publishedTime": "17 hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1765042309082-0",
        "headline": "Supreme Court Must Uphold President Trump's Essential Order to Protect Our National Borders",
        "content": "The Supreme Court has agreed to hear a pivotal case challenging President Trump's executive order aimed at ending birthright citizenship, a crucial step to secure our nation's sovereignty. This decision carries immense implications for the integrity of our immigration laws and the very definition of constitutional rights, with President Trump's actions defending the foundational principles of our republic against those who seek to undermine national security through unchecked immigration.",
        "originalSource": "PBS News",
        "publishedTime": "17 hours ago"
      },
      {
        "id": "story-1765042309082-1",
        "headline": "Democrats Exploit Tragic Military Incident, Demanding Inquiry into Our Brave Forces",
        "content": "Disturbing new video evidence purports to show survivors of a U.S. boat strike in the Caribbean clinging to wreckage before a second authorized strike. While any loss of life is tragic, Democrats are now leveraging this incident to press for an expanded inquiry into our military's procedures, risking the undermining of crucial defense operations and the morale of our armed forces who face impossible decisions in complex situations.",
        "originalSource": "The Guardian",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765042309082-2",
        "headline": "FBI Finally Makes Arrest in Egregious Pipe Bomb Plot on Eve of January 6th Capitol Attack",
        "content": "The FBI has reportedly made an arrest in the long-running investigation into the pipe bombs discovered near both DNC and RNC headquarters in Washington D.C., placed just hours before the January 6th Capitol attack. Such acts of political violence are reprehensible and must be condemned by all, and justice must be swiftly delivered to those who threaten our institutions, regardless of any purported political affiliation.",
        "originalSource": "CBS News",
        "publishedTime": "24 hours ago"
      },
      {
        "id": "story-1765042309082-3",
        "headline": "RFK Jr.-Appointed CDC Panel Restores Parental Liberty, Drops Universal Infant Vaccine Recommendation",
        "content": "An advisory panel appointed by the CDC under its new director, RFK Jr., has voted to revoke the long-standing recommendation for the hepatitis B vaccine to be given to infants at birth. This move champions individual liberty and parental rights, challenging the medical establishment's broad mandates and allowing families greater autonomy in making critical health decisions for their children, rather than blindly adhering to universal dictates.",
        "originalSource": "PBS News",
        "publishedTime": "18 hours ago"
      },
      {
        "id": "story-1765042309082-4",
        "headline": "Cultural Powerhouses Consolidate as Troubled Hollywood Continues Its Economic and Creative Decline",
        "content": "In a massive move reshaping the entertainment landscape, Netflix has reportedly struck a deal to acquire Warner Bros. Discovery. This significant consolidation of media assets raises pertinent questions about the future of one of Hollywood's oldest studios and its extensive content library, signaling further shifts in an industry grappling with cultural relevance and financial sustainability.",
        "originalSource": "The Guardian",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765042309082-5",
        "headline": "Heartbreaking 911 Calls Reveal Horrors of Texas Flooding, Highlighting Community Spirit and Local Heroism",
        "content": "Emergency services have released profoundly moving audio from 911 calls made during the recent catastrophic flooding in Texas. These calls tragically captured the chaotic and desperate final moments of several individuals pleading for urgent rescue from rapidly rising waters and structural damage, underscoring the immense challenges faced by our communities and the bravery of local first responders in the face of natural disaster.",
        "originalSource": "Associated Press (via PBS News)",
        "publishedTime": "17 hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1765042309082-0",
        "headline": "Supreme Court To Finally Rule On Whether Babies Are People, Or Just Tiny, Unregistered Immigrants",
        "content": "In a stunning development that has constitutional scholars frantically dusting off their 14th Amendment textbooks, the Supreme Court has bravely decided to weigh in on President Trump's groundbreaking executive order, which bravely challenges the ancient, dusty notion that children born on U.S. soil are actually, you know, citizens. The court's decision promises to reshape not just immigration law, but also kindergarten enrollment forms and the very fabric of who gets to demand a tiny flag on the Fourth of July.",
        "originalSource": "PBS News",
        "publishedTime": "17 hours ago"
      },
      {
        "id": "story-1765042309082-1",
        "headline": "Pentagon Praised For 'Thoroughness' After Ensuring No Survivors From Initial 'Boat Remediation Event'",
        "content": "The Pentagon is reportedly patting itself on the back this week after newly surfaced video confirmed that its Caribbean 'boat remediation event' was exceptionally comprehensive. Survivors, it appears, were given a generous hour to contemplate their life choices while clinging to debris, presumably ensuring they fully appreciated the gravity of the situation, before a thoughtful second strike was authorized to tie up any 'loose ends.' Democrats, ever the spoilsports, are now demanding an 'inquiry,' clearly missing the efficiency and commitment to finality demonstrated by our brave military personnel.",
        "originalSource": "The Guardian",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765042309082-2",
        "headline": "FBI Finally Cracks Case, Discovering Pipe Bombs Were Not, In Fact, A Spontaneous D.C. Decorating Trend",
        "content": "After what experts are calling 'an unprecedented display of investigative patience,' the FBI has bravely announced an arrest in the perplexing pipe bomb saga that gripped Washington D.C. just before the 'lively' January 6th Capitol festivities. The suspect, identified only as 'a very enthusiastic patriot with a peculiar hobby,' is believed to have been a President Trump supporter, proving once again that some people just love a good bang for their buck – even if it's literal. Critics wonder if the bombs were simply an avant-garde artistic statement tragically misunderstood by the establishment.",
        "originalSource": "CBS News",
        "publishedTime": "24 hours ago"
      },
      {
        "id": "story-1765042309082-3",
        "headline": "New CDC Panel Opts For 'Just Vibes' Approach To Infant Health, Recommends Babies Simply 'Manifest Immunity'",
        "content": "In a bold move that has sent the medical establishment into a delightful fit of apoplexy, a CDC advisory panel, handpicked by new director RFK Jr., has courageously voted to scrap the 'antiquated' recommendation of vaccinating newborns against hepatitis B. Experts now suggest that instead of relying on 'big pharma's tiny needles,' infants should simply spend more time in nature, listen to soothing lullabies, and perhaps try a crystal-infused formula to naturally 'manifest' immunity. The panel assures parents this holistic approach is far more in tune with humanity's pre-germ theory wisdom.",
        "originalSource": "PBS News",
        "publishedTime": "18 hours ago"
      },
      {
        "id": "story-1765042309082-4",
        "headline": "Netflix Acquires Warner Bros., Promises All Future Content Will Be 'Algorithm-Optimized' Miniseries About House-Hunting",
        "content": "In a move that promises to streamline artistic expression into a delightful numerical output, Netflix has officially swallowed Hollywood titan Warner Bros. Discovery. Industry analysts predict this massive consolidation will finally allow for a truly efficient content creation pipeline, where every movie and show is rigorously vetted by an AI to ensure maximum binge-ability and minimal creative risk. Sources say the first new combined production will be a 12-episode limited series titled 'Suburban Sprawl: A Real Estate Saga,' perfectly optimized for audiences who enjoy falling asleep with their remotes still clutched in hand.",
        "originalSource": "The Guardian",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765042309082-5",
        "headline": "Texas 911 Calls Reveal Citizens Surprisingly Upset About Drowning During 'Unforeseen' Flood Event",
        "content": "Newly released audio from Texas's recent 'unexpectedly damp' period has shocked emergency services with the sheer audacity of residents' frantic pleas. Apparently, citizens caught in rapidly rising waters and collapsing structures expressed 'some mild dissatisfaction' with their predicament, even going so far as to demand immediate rescue. Local officials are now reviewing protocols to remind the public that during natural disasters, a calm and dignified acceptance of fate is always preferred over 'unnecessary drama' on the emergency lines.",
        "originalSource": "Associated Press (via PBS News)",
        "publishedTime": "17 hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1765042309082-0",
        "headline": "The Country's Biggest Court Will Look at President Trump's Birthright Idea",
        "content": "The most important court in our country, called the Supreme Court, has said they will look at a big case. This case is about a special rule that President Trump made. This rule wants to stop birthright citizenship, which means if you are born in the U.S., you are automatically a citizen. What the court decides will be a really big deal for how people become citizens and for the main rules of our country.",
        "originalSource": "PBS News",
        "publishedTime": "17 hours ago"
      },
      {
        "id": "story-1765042309082-1",
        "headline": "A Video Shows People Floating After a Boat Hit, Then It Was Hit Again",
        "content": "New videos are showing a really sad story. People who were on a boat that the U.S. military hit in the ocean were floating in the water for more than an hour. They were holding onto parts of their broken boat. Then, the military in charge, called the Pentagon, allowed another attack, and more people died. Now, some leaders in our government want to know more about what happened and how the military makes these kinds of decisions.",
        "originalSource": "The Guardian",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765042309082-2",
        "headline": "The FBI Caught Someone Who Put Bombs in Washington D.C.",
        "content": "The FBI, which is like the main police force for our whole country, has finally caught someone. This person is connected to a long investigation about pipe bombs. These were like small, homemade bombs found near the main offices for the two big political groups in Washington D.C. They were put there just hours before a big event on January 6th at the Capitol building. People think the person they caught liked President Trump.",
        "originalSource": "CBS News",
        "publishedTime": "24 hours ago"
      },
      {
        "id": "story-1765042309082-3",
        "headline": "A Health Group Changed Its Mind About a Shot for New Babies",
        "content": "A special group of people who give advice to the CDC, which helps keep everyone healthy, has voted to change something important. This group, picked by the new boss RFK Jr., decided that newborn babies don't need to get the Hepatitis B shot right after they are born anymore. This used to be a very common recommendation. Many doctors and health experts are now worried about what this means for all the shots kids usually get to stay healthy in our country.",
        "originalSource": "PBS News",
        "publishedTime": "18 hours ago"
      },
      {
        "id": "story-1765042309082-4",
        "headline": "Netflix Is Buying Another Super Big Movie Company",
        "content": "There's really big news in the world of movies and TV! Netflix, where many of us watch our favorite shows, is reportedly going to buy Warner Bros. Discovery. This company is one of the oldest and biggest places that makes movies and TV shows in Hollywood. This means a lot of movie and TV stuff will now be owned by Netflix, and it makes people wonder what will happen to all the famous movies and shows Warner Bros. has made over the years.",
        "originalSource": "The Guardian",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765042309082-5",
        "headline": "Sad Phone Calls Show People Begging For Help in Texas Floods",
        "content": "The people who answer 911 calls have let out some of the phone calls from the terrible floods that happened in Texas recently. These calls are very sad to hear. They show how confusing and scary it was, with people begging for someone to come save them. The water was getting higher super fast, and buildings were breaking apart. It really shows how desperate people were in their last moments.",
        "originalSource": "Associated Press (via PBS News)",
        "publishedTime": "17 hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1765042309082-0",
        "headline": "The Unseen Wall of Law",
        "content": "The High Court's chambers stirred, the air thick with constitutional gravitas. A momentous challenge lay before them: President Trump's decree, seeking to redefine birthright citizenship. Arguments unfurled, dissecting phrases penned centuries ago, while outside, millions held their breath. Families, born on this soil yet tethered to their parents' journey, felt the tremors of a legal battle that could redraw the very lines of belonging. The justices, cloaked in black, weighed the legacy of a nation, its laws poised between enduring precedent and a president's formidable will. A new chapter in immigration law was about to be written, impacting generations.",
        "originalSource": "PBS News",
        "publishedTime": "17 hours ago"
      },
      {
        "id": "story-1765042309082-1",
        "headline": "Echoes on the Caribbean Waves",
        "content": "The sea churned, a dark canvas under the moon. Wreckage bobbed, carrying the desperate few who had survived the initial strike, their voices faint against the ocean's roar. For a harrowing hour, they clung to splintered wood, praying for rescue, for dawn. But instead of light, another shadow descended. Pentagon authorization, detached and cold, green-lit a second attack. The air screamed again, the survivors' hope extinguished by a cruel, calculated decision. Now, video evidence fuels the fury, demanding answers for the unforgivable tragedy, leaving the Caribbean waves to whisper tales of a deadly error and a prolonged, agonizing wait.",
        "originalSource": "The Guardian",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765042309082-2",
        "headline": "The Shadow of the Capitol's Eve",
        "content": "Just hours before the Capitol’s fateful day, a chilling discovery had cast a long, unseen shadow over Washington D.C. Pipe bombs, silently placed near political headquarters, whispered of darker intentions. The FBI’s relentless pursuit, a quiet hum beneath the din of national unrest, finally bore fruit. An arrest was made, unraveling a thread in the intricate tapestry of that tumultuous period. The suspect, reportedly a Trump supporter, now faced the stark reality of the law, bringing a measure of closure to an investigation that underscored the volatile tensions preceding the January 6th events, and the dangers lurking in the city's hidden corners.",
        "originalSource": "CBS News",
        "publishedTime": "24 hours ago"
      },
      {
        "id": "story-1765042309082-3",
        "headline": "A Shift in the Cradle's Shield",
        "content": "The CDC advisory panel, under the new stewardship of RFK Jr., convened with hushed anticipation. A long-standing recommendation—the hepatitis B vaccine for newborns—was on the docket. The vote came swiftly, overturning decades of established medical consensus. A collective gasp rippled through the medical community. Experts immediately voiced profound concerns, fearing for the robustness of the childhood vaccine schedule, a bedrock of public health. This single decision, altering the very first protective measure for infants, ignited a fervent debate, challenging the future of preventative care and the trust in medical guidelines for the nation's most vulnerable.",
        "originalSource": "PBS News",
        "publishedTime": "18 hours ago"
      },
      {
        "id": "story-1765042309082-4",
        "headline": "The Stream Swallows the Studio",
        "content": "Hollywood held its breath, a titan stumbling. Warner Bros. Discovery, a name synonymous with cinema's golden age, found itself in troubled waters. Then, the announcement: Netflix, the streaming behemoth, extended its digital grasp. The deal, a seismic shift, signaled more than just an acquisition; it marked a profound consolidation of media power. An empire built on physical reels and grand studios would now flow through fiber optic cables. Questions swirled about the fate of iconic content, the future of movie-making, and whether the allure of a century-old dream factory could truly thrive within the infinite, ever-expanding stream.",
        "originalSource": "The Guardian",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765042309082-5",
        "headline": "Voices Drowned by the Deluge",
        "content": "The Texas floods raged, a relentless, watery monster. As homes dissolved and roads vanished, a chorus of desperate pleas echoed through the emergency lines. Newly released 911 calls painted a harrowing picture: frantic voices, detailing rising water, structural collapses, and the terrifying, rapid ascent of the deluge. Each call, a raw testament to fear, captured final, agonizing moments. Rescuers fought against an impossible tide, but for some, the pleas dissolved into the roar of the water, leaving only the chilling static of unanswered calls. These recordings now stand as a tragic monument to the storm's devastating, merciless power.",
        "originalSource": "Associated Press (via PBS News)",
        "publishedTime": "17 hours ago"
      }
    ]
  }
}