{
  "timestamp": 1765547331314,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1765547249830-0",
        "headline": "President Trump Condemns Bipartisan Effort to Protect Fair Elections After Redistricting Scheme Fails.",
        "content": "President Trump expressed strong disapproval of Indiana Senate Republicans who, in a rare move, collaborated with Democrats to reject a controversial proposal to redraw the state's congressional map. This bipartisan rejection highlights a systemic issue where attempts to manipulate electoral maps for partisan gain often face scrutiny. President Trump's subsequent threat to support a primary challenger against the GOP State Senate leader underscores the intense political pressure exerted on those who resist efforts to undermine democratic processes through gerrymandering.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765547249830-1",
        "headline": "President Trump's Pardon for Convicted Election Violator Raises Concerns Over Executive Power and Election Integrity.",
        "content": "President Trump's decision to pardon Tina Peters, a former Colorado county clerk convicted of facilitating unauthorized access to voting machines, has ignited significant debate. This action is particularly contentious as presidential pardon power traditionally applies to federal offenses, leading to widespread questioning about the scope and potential abuse of executive clemency. Critics argue such pardons undermine the rule of law and send a dangerous message regarding accountability for actions that jeopardize election integrity.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "9 hours ago"
      },
      {
        "id": "story-1765547249830-2",
        "headline": "Climate Crisis Displaces Tens of Thousands in Washington State as Severe Flooding Exposes Infrastructure Vulnerabilities.",
        "content": "Massive rainfall has caused severe flooding, widespread road closures, and necessitated numerous rescues across Washington state, leading Governor Bob Ferguson to declare a statewide emergency. This crisis, intensified by the escalating climate crisis, has forced tens of thousands of residents from their homes in high-risk areas. The urgent evacuation orders highlight the critical need for robust infrastructure development and proactive climate adaptation strategies to protect communities disproportionately affected by extreme weather events.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765547249830-3",
        "headline": "President Trump's Expanded Sanctions Against Venezuela Further Destabilize a Nation Already Facing Humanitarian Crisis.",
        "content": "The Trump administration has escalated its economic pressure on Venezuela, imposing new sanctions on three nephews of President Nicolás Maduro and six oil tankers. While framed as an effort to destabilize the regime by disrupting its revenue, such measures often disproportionately harm ordinary Venezuelan citizens already enduring a severe humanitarian crisis. Critics argue that these broad sanctions represent an interventionist foreign policy that can exacerbate societal suffering and undermine national sovereignty rather than fostering genuine political change.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1765547249830-4",
        "headline": "Federal Judge Orders Release of Kilmar Ábrego García, Challenging Trump Administration's Expanded Immigration Detention Policies.",
        "content": "A federal judge in Maryland has ordered the immediate release of Kilmar Ábrego García from Immigration and Customs Enforcement (ICE) custody, bringing an end to his prolonged detention. This high-profile legal victory underscores critical concerns about due process and human rights within the Trump administration's expanded immigration enforcement framework, highlighting the systemic issues faced by non-citizens targeted for detention and potential removal.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765547249830-5",
        "headline": "House Democrats Challenge DHS Secretary on Inhumane Deportation Policies Targeting U.S. Military Veterans.",
        "content": "During a contentious hearing on immigration operations, House Democrats confronted Homeland Security Secretary Kristi Noem with the egregious case of a U.S. military veteran who received a removal order. Lawmakers demanded accountability for the Trump administration's policies that lead to the detention and potential deportation of those who have served the nation, highlighting the systemic injustice and moral bankruptcy of such practices against veterans and other non-citizens.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "14 hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1765547249830-0",
        "headline": "Trump blasts Indiana Republican Senate leader after redistricting effort blocked in rare GOP rebuke.",
        "content": "President Trump sharply criticized Indiana Senate Republicans after they joined Democrats to vote down a controversial plan to redraw the state's congressional map. The President indicated he would support a primary challenger against the GOP State Senate leader following the bipartisan rejection of the proposed electoral map changes.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765547249830-1",
        "headline": "Trump announces pardon for Colorado clerk Tina Peters convicted of election machine breach.",
        "content": "President Trump granted a pardon to Tina Peters, a former Colorado county clerk convicted in state court of allowing unauthorized access to voting machines. The action drew attention as the presidential pardon power is widely understood to apply only to federal crimes, sparking debate over the scope of the executive clemency.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "9 hours ago"
      },
      {
        "id": "story-1765547249830-2",
        "headline": "Tens of thousands ordered to evacuate in Washington state amid severe flooding.",
        "content": "Heavy rainfall has triggered significant flooding, numerous rescues, and widespread road closures across Washington state, prompting Governor Bob Ferguson to declare a statewide emergency. Local authorities issued urgent evacuation orders for tens of thousands of residents in areas considered high-risk due to the rapidly rising and dangerous floodwaters.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765547249830-3",
        "headline": "U.S. expands sanctions against Venezuela, targeting three of Maduro's nephews and six oil tankers.",
        "content": "The Trump administration ramped up its pressure campaign on Venezuela, imposing new sanctions on three nephews of President Nicolás Maduro and six shipping vessels accused of transporting the nation's oil. This measure is part of the administration's ongoing effort to destabilize the regime by cutting off its critical revenue streams amid international tensions.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1765547249830-4",
        "headline": "Kilmar Ábrego García released from ICE custody following federal judge's immediate order.",
        "content": "A federal judge in Maryland ordered the immediate release of Kilmar Abrego Garcia from Immigration and Customs Enforcement custody following his prolonged detention. The ruling concluded a high-profile legal battle that focused on the detention and potential removal of non-citizens under the Trump administration's expanded immigration enforcement policies.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765547249830-5",
        "headline": "House Democrats confront DHS Secretary Noem with veteran issued U.S. removal order.",
        "content": "Homeland Security Secretary Kristi Noem was confronted by House Democrats during a hearing on immigration operations, with one lawmaker presenting a U.S. military veteran who was issued a removal order. Democrats pushed for answers regarding the administration’s policies and practices concerning the detention and potential deportation of veterans and non-citizens.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "14 hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1765547249830-0",
        "headline": "President Trump Condemns Indiana GOP for Betraying Voters on Redistricting.",
        "content": "President Trump issued a stern rebuke to Indiana Senate Republicans who, in a rare act of disunity, aligned with Democrats to reject a significant plan to redraw the state's congressional map. Signaling his unwavering commitment to electoral integrity and principled leadership, President Trump announced his support for a primary challenger against the GOP State Senate leader, holding establishment figures accountable for obstructing essential reforms and failing to uphold conservative principles.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765547249830-1",
        "headline": "President Trump Boldly Pardons Tina Peters, Champion of Election Integrity.",
        "content": "Demonstrating unwavering resolve in the fight for transparent elections, President Trump issued a full pardon to Tina Peters, the former Colorado county clerk who faced state conviction for her efforts to investigate voting machine vulnerabilities. This decisive act underscores President Trump's commitment to supporting those who courageously challenge the status quo and demand accountability in our electoral processes, pushing back against a system that often silences truth-tellers. The move, while sparking expected debate among legal elites regarding the scope of presidential clemency, firmly establishes President Trump's readiness to defend liberty and ensure justice for patriots.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "9 hours ago"
      },
      {
        "id": "story-1765547249830-2",
        "headline": "Washington State Confronts Devastating Floods, Tens of Thousands Evacuated.",
        "content": "Washington state is grappling with severe widespread flooding, a natural disaster that has led to numerous emergency rescues and extensive road closures. Governor Bob Ferguson declared a statewide emergency as heavy rainfall caused rapidly rising and dangerous floodwaters, forcing local authorities to issue urgent evacuation orders for tens of thousands of residents in high-risk areas. Communities are demonstrating resilience and working together to navigate these challenging conditions, with citizens heeding warnings to ensure safety.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765547249830-3",
        "headline": "President Trump Unleashes New Sanctions to Cripple Maduro's Corrupt Venezuelan Regime.",
        "content": "In a resolute display of American leadership against tyranny, President Trump's administration has intensified its pressure campaign on the socialist regime in Venezuela. New sanctions have been imposed on three nephews of dictator Nicolás Maduro and six shipping vessels instrumental in transporting the nation's oil, directly targeting the regime's illicit financial networks. This decisive action is a critical part of President Trump's ongoing strategy to destabilize the oppressive regime by cutting off its vital revenue streams, aiming to restore freedom and democracy to the suffering Venezuelan people amidst escalating international tensions.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1765547249830-4",
        "headline": "Federal Judge's Order Releases Non-Citizen, Raising Concerns for Immigration Enforcement.",
        "content": "A federal judge in Maryland has ordered the immediate release of Kilmar Abrego Garcia from Immigration and Customs Enforcement (ICE) custody, concluding a prolonged detention battle. This judicial intervention, which overrides the enforcement actions of ICE, raises significant questions about the balance of power and the challenges facing national security under President Trump's critical immigration enforcement policies. The ruling brings renewed focus to the ongoing legal battles concerning the detention and potential removal of non-citizens, underscoring the complexities of maintaining sovereign borders and upholding the rule of law.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765547249830-5",
        "headline": "House Democrats Use Political Theater to Attack Secretary Noem on Immigration Enforcement.",
        "content": "In a display of transparent political maneuvering, House Democrats confronted Homeland Security Secretary Kristi Noem during a hearing on immigration operations, parading a U.S. military veteran who had been issued a removal order. This orchestrated event saw Democrats attempting to badger the Secretary for answers regarding the President Trump administration’s firm policies and practices concerning the detention and potential deportation of both veterans and other non-citizens. The administration remains steadfast in its commitment to upholding immigration laws and ensuring national security, despite attempts by political opponents to undermine these crucial efforts.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "14 hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1765547249830-0",
        "headline": "President Trump Declares Indiana GOP Leader 'Persona Non Grata' After State Senate Commits Unthinkable Act Of Independent Thought",
        "content": "President Trump, in a move widely applauded by his personal thought-police brigade, issued a scathing denouncement of Indiana Senate Republicans who dared to vote against a controversial redistricting plan. The President, visibly aghast that a state-level legislative body might harbor opinions not directly downloaded from his own mind, announced he would personally fund a primary challenger for the 'renegade' GOP State Senate leader, ensuring that such 'acts of rebellion' against the grand vision of electoral cartography are swiftly and brutally punished.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765547249830-1",
        "headline": "President Trump Pardons Colorado Clerk For State Crime, Citing 'Universal Presidential Authority' Over All Known Multiverses",
        "content": "In a bold assertion of executive power, President Trump issued a full pardon to Tina Peters, a former Colorado county clerk convicted in state court for unauthorized access to voting machines. Legal scholars immediately scrambled to update their textbooks on 'The Concept of Presidential Pardon Power,' which apparently now extends beyond mere federal crimes and likely encompasses parking violations, overdue library books, and any perceived slights against the cosmic order, all thanks to the President's 'absolute and totally legitimate' authority.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "9 hours ago"
      },
      {
        "id": "story-1765547249830-2",
        "headline": "Washington State Flooding So Severe, Salmon Reportedly Seen Arguing Over Optimal Kayak Lanes In Starbucks",
        "content": "Torrential downpours have transformed Washington state into a veritable Venice of the Pacific Northwest, prompting Governor Bob Ferguson to declare a statewide emergency. Tens of thousands of residents received urgent evacuation orders, with authorities warning that the rapidly rising floodwaters were approaching 'unprecedented levels of liquid inconvenience.' Eyewitnesses reported observing local wildlife, particularly salmon, engaging in heated debates over prime real estate in submerged coffee shops, further highlighting the surreal nature of the unfolding aquatic catastrophe.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765547249830-3",
        "headline": "President Trump Imposes Sanctions On Maduro's Pet Hamster, Six Miniature Poodle Tankers In Escalating Venezuelan Pressure Campaign",
        "content": "In a stunning display of precision diplomacy, the President Trump administration ramped up its pressure campaign on Venezuela, imposing new sanctions on three nephews of President Nicolás Maduro, six shipping vessels, and, reportedly, Maduro's favorite artisanal cheese grater. This highly targeted measure, which also included six miniature poodle-sized oil tankers, is part of the administration's ongoing effort to destabilize the regime by cutting off its critical revenue streams, down to the last drop of Venezuelan's famously robust, black-market hamster food.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1765547249830-4",
        "headline": "ICE Custody System Briefly Crashes After Single Federal Judge Realizes It's Not Supposed To Be A Lifetime Subscription",
        "content": "In a truly bewildering turn of events for the U.S. Immigration and Customs Enforcement (ICE), a federal judge in Maryland issued an immediate order for the release of Kilmar Abrego Garcia, who had apparently been enjoying an extended, involuntary 'vacation' in ICE custody. The ruling reportedly sent shockwaves through the agency, as many employees had long assumed that once an individual entered ICE's care, they automatically received a 'platinum, never-ending, all-inclusive' detention package, irrespective of legal precedent or human rights.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765547249830-5",
        "headline": "House Democrats Present DHS Secretary Noem With Decorated Veteran, Who Is Then Promptly Offered A Tour Of Canada",
        "content": "During a contentious House hearing on immigration, Democrats staged a dramatic confrontation with Homeland Security Secretary Kristi Noem, proudly presenting a U.S. military veteran who, for reasons known only to the omniscient algorithms of the DHS, had been issued a removal order. Lawmakers pressed for answers, while the veteran, looking bewildered, was reportedly handed a pamphlet detailing the picturesque landscapes and excellent healthcare options available just across the northern border, in case the 'misunderstanding' couldn't be resolved quickly.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "14 hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1765547249830-0",
        "headline": "President Trump is Upset with a Leader in Indiana",
        "content": "President Trump got really mad at some leaders in Indiana. They voted against his plan to change how voting maps look, which is called redistricting. It means drawing lines on a map to decide who gets to vote for which politician. President Trump said he might help someone else run against the Indiana leader because he was so unhappy.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765547249830-1",
        "headline": "President Trump Helps a Lady Who Broke Rules",
        "content": "President Trump said he would forgive a lady named Tina Peters. She used to be in charge of elections in Colorado, and she got in trouble for letting people mess with voting machines without permission. People are talking about this a lot because presidents usually only forgive people for crimes against the whole country, not for state crimes.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "9 hours ago"
      },
      {
        "id": "story-1765547249830-2",
        "headline": "Lots of People Must Leave Their Homes in Washington",
        "content": "It rained super hard in Washington state, and now there's lots of flooding everywhere! The water is really high and dangerous. Because of this, the Governor said it was an emergency, and many roads are closed. Thousands and thousands of people have been told to leave their homes quickly because it's not safe.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765547249830-3",
        "headline": "America Puts More Rules on Venezuela's Leaders",
        "content": "President Trump's government put more tough rules on Venezuela. They made it harder for the leader of Venezuela, Nicolás Maduro, and his family to do business. They also stopped six big boats that carry oil from Venezuela. This is all to try and make things difficult for Maduro's government and stop them from getting money.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1765547249830-4",
        "headline": "A Man Got Out of Jail Because a Judge Said So",
        "content": "A judge in Maryland said that a man named Kilmar Abrego Garcia had to be let out of jail right away. He had been held by a group called ICE (Immigration and Customs Enforcement) for a long time. This was a big court case about how President Trump's government handles people who are not citizens of America.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765547249830-5",
        "headline": "Important Leaders Ask Tough Questions About a Soldier",
        "content": "Some leaders in the government, called House Democrats, asked the person in charge of Homeland Security, Kristi Noem, some hard questions. They showed her a soldier who fought for our country but was told he might have to leave America. The Democrats wanted to know why President Trump's government was trying to send soldiers and other non-citizens away.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "14 hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1765547249830-0",
        "headline": "The Cartographer's Shadow",
        "content": "The lines were drawn, then erased. In Indiana, a controversial map, meant to reshape the state’s political landscape, crumbled under a rare bipartisan rebuke. Senate Republicans, siding with their Democratic counterparts, voted it down. The Capitol buzzed. News reached President Trump, who saw not a political compromise, but a betrayal. His sharp words cut through the quiet halls, promising a reckoning. A primary challenger, he hinted, would soon emerge to unseat the very leader who dared to defy the redrawing. The political chess game continued, but this time, the board was shaken by a presidential roar.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765547249830-1",
        "headline": "A Question of Power",
        "content": "In Colorado, Tina Peters, a county clerk, faced the consequences of her actions. Convicted of breaching election machines, her future seemed sealed by state law. Then, a presidential decree echoed across the nation. President Trump, exercising his clemency, announced a pardon. The news sent ripples, not just of relief for Peters, but of constitutional debate. Legal scholars murmured, questioning the reach of such power. A presidential pardon traditionally applied to federal crimes, yet here it was, touching a state conviction. The act, unconventional and bold, ignited a fresh conversation about the very boundaries of executive authority.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "9 hours ago"
      },
      {
        "id": "story-1765547249830-2",
        "headline": "The Rising Tide",
        "content": "The sky wept for days, an unending torrent that transformed tranquil rivers into raging beasts. Across Washington state, the waters swelled, reclaiming land, swallowing roads, and isolating communities. Rescues became commonplace, sirens wailing against the backdrop of constant rain. Governor Bob Ferguson declared an emergency, but the threat was immediate, personal. Tens of thousands received the urgent command: evacuate. Their homes, their lives, now precarious islands in a vast, dark sea. Families packed hurriedly, fear a silent passenger, as the dangerous floodwaters continued their relentless, terrifying ascent. The state held its breath, waiting for the storm to pass.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "12 hours ago"
      },
      {
        "id": "story-1765547249830-3",
        "headline": "Choke Point",
        "content": "Across the seas, a new front opened in the quiet war against Venezuela. The Trump administration, tightening its grip, declared a fresh wave of sanctions. The targets were precise: three nephews of President Nicolás Maduro, their ties to the regime deemed critical. But the pressure didn’t stop there. Six colossal oil tankers, silent behemoths of commerce, were also blacklisted, accused of ferrying the nation’s lifeblood. This was more than a punitive measure; it was a strategic move. A deliberate choke point, designed to sever the regime's vital revenue streams, hoping to destabilize the very foundations of its power.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1765547249830-4",
        "headline": "A Judge's Decree",
        "content": "For Kilmar Abrego Garcia, time in ICE custody had stretched, a prolonged limbo beneath the shadow of potential removal. His case became a legal battleground, a test of the Trump administration's amplified immigration policies, which had cast a wide net over non-citizens. Then, a voice of authority cut through the legal fray. From Maryland, a federal judge's order arrived, immediate and decisive: release. The gate, so long closed, finally swung open. It was more than just one man's freedom; it was a moment that underscored the judiciary’s power, a counterpoint to the executive's enforcement.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765547249830-5",
        "headline": "A Soldier's Burden",
        "content": "The hearing room crackled with tension. House Democrats, facing Homeland Security Secretary Kristi Noem, launched their attack. Their weapon: a U.S. military veteran, his face etched with a story of service, now branded with a removal order. A lawmaker presented him, a living testament to the administration's unforgiving immigration policies. The questions came sharp and fast: How could a nation cast out its protectors? What logic governed the detention and potential deportation of those who had worn the uniform, or any non-citizen? The veteran stood silently, his presence a powerful, unspoken indictment of a system grappling with its own humanity.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "14 hours ago"
      }
    ]
  }
}