{
  "timestamp": 1765658286471,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1765658214109-0",
        "headline": "Tragic Loss of US Lives in Syria Underscores Unending Cycle of Violence",
        "content": "Two U.S. service members and one American civilian interpreter tragically lost their lives, with three others wounded, in a Saturday ambush by an Islamic State gunman near Palmyra, Syria. This marks the first attack resulting in U.S. fatalities in the country since the fall of President Bashar Assad a year ago, highlighting the persistent and often unseen human cost of ongoing military engagements. While U.S. Central Command reported the gunman was killed, the incident prompts critical questions about long-term strategies and the safety of personnel in a perpetually unstable region, demanding a deeper investigation into the systemic conditions that allow such tragedies to persist.",
        "originalSource": "AP News / U.S. Central Command",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEzi0MMrtHBWUQRRTOjyEVLg8DXd2GS-pljbEy4HYuPXR4ZmJdXwK3xvPcXikLAzzuq9XaBVsMjvYe6m9FCsfjK8slblZLqy_3OUwzUSqtXY5dmv3c3ggQ-aZS1nKCM7rjy_yGiYa9DAcqwBBRQeKQ-f1ac6AIOZv_2qhmvQ0TMwkJ8vfC2IqO0KuzBMkCUzKkaDBWH17BLPhTukQWWq-6evJOh7mA=",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765658214109-1",
        "headline": "Democrats Demand Full Transparency as Epstein Photos Expose Elite Connections to Systemic Abuse",
        "content": "Democrats on the House Oversight Committee have released an initial selection of 19 photos from Jeffrey Epstein's vast estate, prominently featuring President Trump, Bill Clinton, and Prince Andrew. This carefully chosen release, from a trove of over 95,000 images, is a strategic move to pressure the current Republican administration into making the full Epstein files public before a looming deadline. The presence of such powerful figures, even without immediate context or suggestion of wrongdoing, serves as a stark reminder of the systemic impunity enjoyed by the wealthy and connected, demanding full disclosure and accountability in the face of alleged widespread exploitation.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyXOVsWGW0CNpoJXMvF5OIW3ubDhDb7WVJDHL1sNUztXgj_zUYNT1es7IJWGDg7wP9OEYF_1i6O2j0Qi-4EPfhkBOuOF6Oxg3scKSeVZ6m4TYtpiJPYBLawdmDncK9WhZHkZzeD_Pl4pcnci3PFGZQnr8eiM0a1cyPDiYMlW9rcgb7eOfS8qu7ddEdRA==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-2",
        "headline": "Federal Government Threatens New York Over License Issue, Highlighting Inconsistent Immigration Policies",
        "content": "U.S. Transportation Secretary Sean Duffy announced New York is the eighth state found to be issuing commercial driver's licenses (CDLs) to immigrants that remain valid beyond their legal residency. Duffy's immediate threat to withhold $73 million in highway funds unless the state corrects the system and revokes these licenses highlights a federal approach that often punishes states for bureaucratic inconsistencies rather than addressing the root causes of complex immigration and licensing challenges. This federal audit follows a fatal crash involving an unauthorized truck driver in Florida, raising concerns that the response disproportionately targets immigrant populations and potentially exacerbates economic precarity rather than fostering systemic solutions for all drivers.",
        "originalSource": "San Francisco Chronicle (AP)",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQF1pzE4g8Lzve4karYE_3KlKQGeB-lqYBF96h9cgMgu72FheXk66SH05GwSzEGRvAskYhfyDlG1UgcgEaI8tDBNiE6j5YNdKQktPJ07rG2TcRGrVj0C7oXr45b76aj5k0S9n_ymfX0EPLEJi1hMMvrOWQWEuRP9EqQmlVVKQ_BxOVVRcyg2yyoMlftZIhOnwymYlNBKQ681FWYgw37xR6isPhqk4rzBCA==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-3",
        "headline": "Questions Linger as Man's Tragic Death on Universal Roller Coaster Raises Concerns About Systemic Safety",
        "content": "The tragic death of 32-year-old Kevin Rodriguez Zavala on the Stardust Racers coaster at Universal Orlando's Epic Universe has been ruled an accident due to blunt-impact injuries. While a sheriff's office report stated that park workers followed procedures, the death of Zavala, who used a wheelchair and had spinal rods from a prior surgery, compels a deeper examination of systemic safety protocols, accessibility standards, and the adequacy of corporate oversight. This incident demands a critical review to ensure that amusement parks prioritize the safety and well-being of all guests, particularly those with disabilities, beyond merely adhering to minimum procedures.",
        "originalSource": "AP News (via WBOC)",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH6x0_aVABuD-2agg9v8x1MwaP3XlJex912CdfEPgHpLmonOCB0KnYlmL6zkYcF4jaxIfW_AN2WLeSuGSAphyHCjRqvurSZkLXiLiKtIThT8LdqKyJiTRs-gp60lXXYe3hMK7-9W7FMnaOxokGEA0mWP0m4cRsqWVYTj5mUNZoyMSCa2j1kpJRoGIL0nR5sa7S_9oe8ft-FRjSiXbT0Oqk9xo1AAn16otaXJKC6cLP80uG11SAD23tlZ6VqxrUb4-7KnyvPXJI6ryZcHE2zjIDYRBlckFgrB52NX1qZiw==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-4",
        "headline": "President Trump Administration's Stance on ASL Services Deemed Discriminatory, Undermining Accessibility Rights",
        "content": "In a legal filing, the President Trump administration has controversially argued that requiring real-time American Sign Language (ASL) interpretation for White House briefings would 'severely intrude on the President's prerogative to control the image he presents to the public.' This stance, part of its appeal against a federal judge's order stemming from a lawsuit by the National Association of the Deaf, prioritizes political image over fundamental civil rights and universal accessibility. Such an argument not only marginalizes the deaf community but also reflects a troubling pattern of governmental resistance to ensuring equitable access to crucial public information, challenging the very principles of inclusivity and democratic participation.",
        "originalSource": "PBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHixlvV1H9p5muPbfiXvatqtUN3iFV9aEnFyhPD5OhlI0AELkyyJxoDxVkZWpDCOwxD_rJ7q7Y6qg_tEMXsMW2_OwJjaeuJKhSpXBb9GTaGu_dxQfyylQCx6Y_HMxjG6NFD1MeFOZL_1Ac5suCeMtrAy8pavt163RPU1H5TrxNJFF-hrfPuFMIvkkSfomptCayozG1POBQgqfLC2wn_VJROwTHjQDtgINJIL6iIyjon7GPpb1WUI8Ju2w==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-5",
        "headline": "Multi-Million Dollar Settlement Highlights Catastrophic Systemic Failures Leading to Child's Tragic Death",
        "content": "A significant $31.5 million settlement has been awarded in a lawsuit filed on behalf of the two younger sisters of Arabella McCormack, an 11-year-old who tragically died from horrific torture and starvation in 2022. This substantial settlement holds multiple powerful parties—including the city, county, a school, and a church—accountable for a catastrophic systemic failure to intervene and report the severe child abuse. The case serves as a heartbreaking indictment of institutional neglect and the urgent need for profound reforms across all levels of child protection services, social safety nets, and community oversight to prevent such preventable tragedies from recurring.",
        "originalSource": "AP News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQF1LDsuiZbkboNf0wqtHL7b4Skure7IglVwGj4cCw-0XWsPvCY1Zp7Mqz5hpCTUAc98cfvJO6kI6lnYwA2BXcJlFZjxVTQEBwdYMYK8TIBdGF_WzXHjdLTMk3eP7UQnen6e3FX_67f2mTbjCFpxKMc4yJCy9D7N2w3e-PBkM1FGxN7SD3mChdpUNba23JUba7EjFxM=",
        "publishedTime": "Less than 24 hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1765658214109-0",
        "headline": "Two US troops, civilian interpreter killed in ambush by IS gunman in central Syria",
        "content": "Two U.S. service members and one American civilian interpreter were killed, and three others wounded, in a Saturday ambush by a lone Islamic State gunman near Palmyra, Syria. This is the first attack to inflict US fatalities in the country since the fall of President Bashar Assad a year ago. US Central Command reported the gunman was killed, and the attack is under investigation.",
        "originalSource": "AP News / U.S. Central Command",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEzi0MMrtHBWUQRRTOjyEVLg8DXd2GS-pljbEy4HYuPXR4ZmJdXwK3xvPcXikLAzzuq9XaBVsMjvYe6m9FCsfjK8slblZLqy_3OUwzUSqtXY5dmv3c3ggQ-aZS1nKCM7rjy_yGiYa9DAcqwBBRQeKQ-f1ac6AIOZv_2qhmvQ0TMwkJ8vfC2IqO0KuzBMkCUzKkaDBWH17BLPhTukQWWq-6evJOh7mA=",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765658214109-1",
        "headline": "House Democrats release photos of Trump, Clinton, and Andrew from Epstein's estate",
        "content": "Democrats on the House Oversight Committee released a selection of 19 photos from Jeffrey Epstein's estate, which prominently feature Donald Trump, Bill Clinton, and Prince Andrew. This initial release from a trove of over 95,000 images is intended to pressure the Republican administration to make the full Epstein files public before a looming deadline. No context or suggestion of wrongdoing accompanies the images.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyXOVsWGW0CNpoJXMvF5OIW3ubDhDb7WVJDHL1sNUztXgj_zUYNT1es7IJWGDg7wP9OEYF_1i6O2j0Qi-4EPfhkBOuOF6Oxg3scKSeVZ6m4TYtpiJPYBLawdmDncK9WhZHkZzeD_Pl4pcnci3PFGZQnr8eiM0a1cyPDiYMlW9rcgb7eOfS8qu7ddEdRA==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-2",
        "headline": "New York is the 8th state found to have improperly issued commercial driver's licenses to immigrants",
        "content": "U.S. Transportation Secretary Sean Duffy announced New York is the eighth state caught issuing CDLs to immigrants that remain valid after their legal residency expires. Duffy threatened to withhold $73 million in highway funds unless the state corrects the system and revokes the flawed licenses. The federal audit follows a fatal crash involving an unauthorized truck driver in Florida.",
        "originalSource": "San Francisco Chronicle (AP)",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQF1pzE4g8Lzve4karYE_3KlKQGeB-lqYBF96h9cgMgu72FheXk66SH05GwSzEGRvAskYhfyDlG1UgcgEaI8tDBNiE6j5YNdKQktPJ07rG2TcRGrVj0C7oXr45b76aj5k0S9n_ymfX0EPLEJi1hMMvrOWQWEuRP9EqQmlVVKQ_BxOVVRcyg2yyoMlftZIhOnwymYlNBKQ681FWYgw37xR6isPhqk4rzBCA==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-3",
        "headline": "Man's death on roller coaster at Universal Orlando Resort ruled accidental",
        "content": "The death of a 32-year-old man, Kevin Rodriguez Zavala, on the Stardust Racers coaster at Universal Orlando's Epic Universe was ruled an accident from blunt-impact injuries. A sheriff's office report detailed he was found slumped over with severe facial trauma but concluded park workers followed procedures. Zavala, who used a wheelchair, had spinal rods from a prior surgery.",
        "originalSource": "AP News (via WBOC)",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH6x0_aVABuD-2agg9v8x1MwaP3XlJex912CdfEPgHpLmonOCB0KnYlmL6zkYcF4jaxIfW_AN2WLeSuGSAphyHCjRqvurSZkLXiLiKtIThT8LdqKyJiTRs-gp60lXXYe3hMK7-9W7FMnaOxokGEA0mWP0m4cRsqWVYTj5mUNZoyMSCa2j1kpJRoGIL0nR5sa7S_9oe8ft-FRjSiXbT0Oqk9xo1AAn16otaXJKC6cLP80uG11SAD23tlZ6VqxrUb4-7KnyvPXJI6ryZcHE2zjIDYRBlckFgrB52NX1qZiw==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-4",
        "headline": "Trump administration says sign language services 'intrude' on Trump's ability to control his image",
        "content": "In a legal filing, the Trump administration argued that requiring real-time American Sign Language interpretation for White House briefings would 'severely intrude on the President's prerogative to control the image he presents to the public.' This controversial stance is part of its appeal against a federal judge's order stemming from a lawsuit filed by the National Association of the Deaf.",
        "originalSource": "PBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHixlvV1H9p5muPbfiXvatqtUN3iFV9aEnFyhPD5OhlI0AELkyyJxoDxVkZWpDCOwxD_rJ7q7Y6qg_tEMXsMW2_OwJjaeuJKhSpXBb9GTaGu_dxQfyylQCx6Y_HMxjG6NFD1MeFOZL_1Ac5suCeMtrAy8pavt163RPU1H5TrxNJFF-hrfPuFMIvkkSfomptCayozG1POBQgqfLC2wn_VJROwTHjQDtgINJIL6iIyjon7GPpb1WUI8Ju2w==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-5",
        "headline": "$31.5 million settlement reached in lawsuit over California girl's starvation death",
        "content": "A $31.5 million settlement was awarded in a lawsuit filed on behalf of the two younger sisters of Arabella McCormack, an 11-year-old who died from torture and starvation in 2022. The settlement holds multiple parties—including the city, county, a school, and a church—accountable for a systematic failure to intervene and report the horrific child abuse.",
        "originalSource": "AP News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQF1LDsuiZbkboNf0wqtHL7b4Skure7IglVwGj4cCw-0XWsPvCY1Zp7Mqz5hpCTUAc98cfvJO6kI6lnYwA2BXcJlFZjxVTQEBwdYMYK8TIBdGF_WzXHjdLTMk3eP7UQnen6e3FX_67f2mTbjCFpxKMc4yJCy9D7N2w3e-PBkM1FGxN7SD3mChdpUNba23JUba7EjFxM=",
        "publishedTime": "Less than 24 hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1765658214109-0",
        "headline": "Radical Islamic Terrorists Ambush and Kill Brave American Servicemen in Syria",
        "content": "The tragic loss of two courageous U.S. service members and an American civilian interpreter in a Saturday ambush by a lone Islamic State gunman near Palmyra, Syria, underscores the enduring threat of radical Islamic terrorism. This heinous act marks the first U.S. fatalities in the region since President Bashar Assad’s fall, a stark reminder of the sacrifices our military makes to protect our freedoms. U.S. Central Command confirmed the gunman was neutralized, and an investigation is underway into this assault on our national security.",
        "originalSource": "AP News / U.S. Central Command",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEzi0MMrtHBWUQRRTOjyEVLg8DXd2GS-pljbEy4HYuPXR4ZmJdXwK3xvPcXikLAzzuq9XaBVsMjvYe6m9FCsfjK8slblZLqy_3OUwzUSqtXY5dmv3c3ggQ-aZS1nKCM7rjy_yGiYa9DAcqwBBRQeKQ-f1ac6AIOZv_2qhmvQ0TMwkJ8vfC2IqO0KuzBMkCUzKkaDBWH17BLPhTukQWWq-6evJOh7mA=",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765658214109-1",
        "headline": "Democrats Politicize Epstein Files, Release Context-Free Photos of Prominent Figures",
        "content": "In a transparent attempt to politicize serious matters, House Democrats on the Oversight Committee have released a selection of just 19 photos from Jeffrey Epstein's estate, conspicuously featuring President Trump, Bill Clinton, and Prince Andrew. This selective leak from over 95,000 images is clearly designed to pressure the administration to release the full Epstein files, yet it completely lacks any context or suggestion of wrongdoing, serving merely as political fodder rather than genuine transparency.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyXOVsWGW0CNpoJXMvF5OIW3ubDhDb7WVJDHL1sNUztXgj_zUYNT1es7IJWGDg7wP9OEYF_1i6O2j0Qi-4EPfhkBOuOF6Oxg3scKSeVZ6m4TYtpiJPYBLawdmDncK9WhZHkZzeD_Pl4pcnci3PFGZQnr8eiM0a1cyPDiYMlW9rcgb7eOfS8qu7ddEdRA==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-2",
        "headline": "New York Endangers Public Safety, Illegally Issues Driver's Licenses to Undocumented Individuals",
        "content": "U.S. Transportation Secretary Sean Duffy has rightly called out New York as the eighth state to be caught improperly issuing commercial driver's licenses to individuals whose legal residency has expired, a blatant disregard for the rule of law and public safety. Duffy has sternly warned that $73 million in vital highway funds will be withheld unless the state immediately rectifies this system and revokes these flawed licenses. This federal audit rightly follows a tragic fatal crash involving an unauthorized truck driver, highlighting the critical need to enforce our laws and protect American citizens.",
        "originalSource": "San Francisco Chronicle (AP)",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQF1pzE4g8Lzve4karYE_3KlKQGeB-lqYBF96h9cgMgu72FheXk66SH05GwSzEGRvAskYhfyDlG1UgcgEaI8tDBNiE6j5YNdKQktPJ07rG2TcRGrVj0C7oXr45b76aj5k0S9n_ymfX0EPLEJi1hMMvrOWQWEuRP9EqQmlVVKQ_BxOVVRcyg2yyoMlftZIhOnwymYlNBKQ681FWYgw37xR6isPhqk4rzBCA==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-3",
        "headline": "Universal Orlando Roller Coaster Death Ruled Tragic Accident, Park Protocols Followed",
        "content": "The tragic death of 32-year-old Kevin Rodriguez Zavala on the Stardust Racers coaster at Universal Orlando's Epic Universe has been officially ruled an accident, resulting from blunt-impact injuries. A thorough sheriff's office report confirmed that park workers diligently followed all established procedures, concluding that this was a heartbreaking individual incident. Zavala, who utilized a wheelchair, had previously undergone surgery for spinal rods, underscoring the complexities involved in such personal circumstances.",
        "originalSource": "AP News (via WBOC)",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH6x0_aVABuD-2agg9v8x1MwaP3XlJex912CdfEPgHpLmonOCB0KnYlmL6zkYcF4jaxIfW_AN2WLeSuGSAphyHCjRqvurSZkLXiLiKtIThT8LdqKyJiTRs-gp60lXXYe3hMK7-9W7FMnaOxokGEA0mWP0m4cRsqWVYTj5mUNZoyMSCa2j1kpJRoGIL0nR5sa7S_9oe8ft-FRjSiXbT0Oqk9xo1AAn16otaXJKC6cLP80uG11SAD23tlZ6VqxrUb4-7KnyvPXJI6ryZcHE2zjIDYRBlckFgrB52NX1qZiw==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-4",
        "headline": "President Trump's Administration Defends Executive Prerogative in White House Briefings",
        "content": "In a significant legal filing, President Trump's administration has asserted that mandatory real-time American Sign Language interpretation for White House briefings would \"severely intrude on the President's prerogative to control the image he presents to the public.\" This principled stance is part of the administration’s appeal against a federal judge's order, stemming from a lawsuit, upholding the President’s inherent right to manage official communications effectively and without undue burden.",
        "originalSource": "PBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHixlvV1H9p5muPbfiXvatqtUN3iFV9aEnFyhPD5OhlI0AELkyyJxoDxVkZWpDCOwxD_rJ7q7Y6qg_tEMXsMW2_OwJjaeuJKhSpXBb9GTaGu_dxQfyylQCx6Y_HMxjG6NFD1MeFOZL_1Ac5suCeMtrAy8pavt163RPU1H5TrxNJFF-hrfPuFMIvkkSfomptCayozG1POBQgqfLC2wn_VJROwTHjQDtgINJIL6iIyjon7GPpb1WUI8Ju2w==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-5",
        "headline": "Justice Achieved for Starved California Girl as $31.5 Million Settlement Holds Negligent Parties Accountable",
        "content": "A substantial $31.5 million settlement has been secured in a lawsuit filed on behalf of the two younger sisters of Arabella McCormack, an 11-year-old who tragically succumbed to unspeakable torture and starvation in 2022. This crucial settlement holds multiple entities – including the city, county, a school, and a church – rightly accountable for a systematic and catastrophic failure to intervene and report the horrific child abuse, a stark reminder of the need for vigilant protection of our most vulnerable.",
        "originalSource": "AP News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQF1LDsuiZbkboNf0wqtHL7b4Skure7IglVwGj4cCw-0XWsPvCY1Zp7Mqz5hpCTUAc98cfvJO6kI6lnYwA2BXcJlFZjxVTQEBwdYMYK8TIBdGF_WzXHjdLTMk3eP7UQnen6e3FX_67f2mTbjCFpxKMc4yJCy9D7N2w3e-PBkM1FGxN7SD3mChdpUNba23JUba7EjFxM=",
        "publishedTime": "Less than 24 hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1765658214109-0",
        "headline": "Local Man Single-Handedly Resets Geopolitical Stability Clock in Syria With Surprise Ambush",
        "content": "A highly motivated individual, armed with what intelligence officials are now calling \"a very determined attitude,\" managed to successfully interrupt a year-long streak of *not* losing American lives in Syria. The Pentagon has launched an urgent investigation into how one person could be so incredibly impactful, suspecting a possible breach in the \"everyone else is busy\" protocol, as two US troops and an American civilian interpreter were tragically killed.",
        "originalSource": "AP News / U.S. Central Command",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEzi0MMrtHBWUQRRTOjyEVLg8DXd2GS-pljbEy4HYuPXR4ZmJdXwK3xvPcXikLAzzuq9XaBVsMjvYe6m9FCsfjK8slblZLqy_3OUwzUSqtXY5dmv3c3ggQ-aZS1nKCM7rjy_yGiYa9DAcqwBBRQeKQ-f1ac6AIOZv_2qhmvQ0TMwkJ8vfC2IqO0KuzBMkCUzKkaDBWH17BLPhTukQWWq-6evJOh7mA=",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765658214109-1",
        "headline": "Democrats Shockingly Unveil Photos of Famous People Existing in Same Room as Other Famous People",
        "content": "In a move that absolutely nobody saw coming, House Democrats released a highly curated collection of 19 photographs, proving conclusively that prominent figures like President Trump, Bill Clinton, and Prince Andrew once occupied the same general airspace as Jeffrey Epstein. With an additional 94,981 images still awaiting public scrutiny, sources suggest future releases might reveal politicians attending charity galas or even, gasp, dining in restaurants. The committee assures the public that while these photos exist, they contain absolutely no context whatsoever, which is somehow even more unsettling.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyXOVsWGW0CNpoJXMvF5OIW3ubDhDb7WVJDHL1sNUztXgj_zUYNT1es7IJWGDg7wP9OEYF_1i6O2j0Qi-4EPfhkBOuOF6Oxg3scKSeVZ6m4TYtpiJPYBLawdmDncK9WhZHkZzeD_Pl4pcnci3PFGZQnr8eiM0a1cyPDiYMlW9rcgb7eOfS8qu7ddEdRA==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-2",
        "headline": "New York Joins Elite Club of States That Apparently Don't Understand Expiration Dates",
        "content": "New York has proudly become the eighth state to discover that, much like a carton of milk, some legal residencies eventually expire, yet their commercial driver's licenses mysteriously do not. U.S. Transportation Secretary Sean Duffy, visibly exasperated, promised to hold the state's highway funds hostage for $73 million unless they quickly learn the fundamental concept of \"revoking things that are no longer valid.\" Critics wonder if the next federal audit will focus on states issuing driver's licenses to enthusiastic but unlicensed squirrels.",
        "originalSource": "San Francisco Chronicle (AP)",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQF1pzE4g8Lzve4karYE_3KlKQGeB-lqYBF96h9cgMgu72FheXk66SH05GwSzEGRvAskYhfyDlG1UgcgEaI8tDBNiE6j5YNdKQktPJ07rG2TcRGrVj0C7oXr45b76aj5k0S9n_ymfX0EPLEJi1hMMvrOWQWEuRP9EqQmlVVKQ_BxOVVRcyg2yyoMlftZIhOnwymYlNBKQ681FWYgw37xR6isPhqk4rzBCA==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-3",
        "headline": "Thrill-Seeker Accidentally Experiences More Thrills Than Intended on \"Stardust Racers\"",
        "content": "Universal Orlando's \"Stardust Racers\" coaster provided one 32-year-old man, Kevin Rodriguez Zavala, with a truly unforgettable experience, culminating in an accidental, yet remarkably severe, case of \"blunt-impact injuries.\" While investigators noted the man was found in a \"slumped over\" position with \"severe facial trauma,\" they were quick to confirm that park workers had meticulously followed every single procedure, right up until the moment an actual human died. The park assures guests that future rides will continue to adhere to all safety protocols, even if those protocols currently include 'sometimes people die, but it's an accident.'",
        "originalSource": "AP News (via WBOC)",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH6x0_aVABuD-2agg9v8x1MwaP3XlJex912CdfEPgHpLmonOCB0KnYlmL6zkYcF4jaxIfW_AN2WLeSuGSAphyHCjRqvurSZkLXiLiKtIThT8LdqKyJiTRs-gp60lXXYe3hMK7-9W7FMnaOxokGEA0mWP0m4cRsqWVYTj5mUNZoyMSCa2j1kpJRoGIL0nR5sa7S_9oe8ft-FRjSiXbT0Oqk9xo1AAn16otaXJKC6cLP80uG11SAD23tlZ6VqxrUb4-7KnyvPXJI6ryZcHE2zjIDYRBlckFgrB52NX1qZiw==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-4",
        "headline": "White House: Sign Language Interpreters Threaten President Trump's Carefully Curated Aura of Spontaneous Brilliance",
        "content": "The Trump administration has dramatically clarified its position on White House briefings, stating that the presence of real-time American Sign Language interpreters would \"severely intrude\" upon President Trump's undeniable ability to control the very specific, highly nuanced, and often improvisational image he projects to the public. Officials worry that silent hand gestures might accidentally convey an alternate message, or worse, distract from the President's signature verbal flourishes, thus diluting the pure, unadulterated essence of his messaging.",
        "originalSource": "PBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHixlvV1H9p5muPbfiXvatqtUN3iFV9aEnFyhPD5OhlI0AELkyyJxoDxVkZWpDCOwxD_rJ7q7Y6qg_tEMXsMW2_OwJjaeuJKhSpXBb9GTaGu_dxQfyylQCx6Y_HMxjG6NFD1MeFOZL_1Ac5suCeMtrAy8pavt163RPU1H5TrxNJFF-hrfPuFMIvkkSfomptCayozG1POBQgqfLC2wn_VJROwTHjQDtgINJIL6iIyjon7GPpb1WUI8Ju2w==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-5",
        "headline": "Bureaucracy Achieves Posthumous Victory: Child's Death Now Officially Worth $31.5 Million",
        "content": "In a landmark legal decision that proves money can, in fact, rectify anything, a California court has determined that the tragic, preventable death of 11-year-old Arabella McCormack was precisely worth $31.5 million. The hefty sum, intended for her surviving sisters, serves as a stark reminder to countless failing institutions—including a city, a county, a school, and even a church—that while they utterly failed to save a child, they are now admirably accountable with a checkbook.",
        "originalSource": "AP News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQF1LDsuiZbkboNf0wqtHL7b4Skure7IglVwGj4cCw-0XWsPvCY1Zp7Mqz5hpCTUAc98cfvJO6kI6lnYwA2BXcJlFZjxVTQEBwdYMYK8TIBdGF_WzXHjdLTMk3eP7UQnen6e3FX_67f2mTbjCFpxKMc4yJCy9D7N2w3e-PBkM1FGxN7SD3mChdpUNba23JUba7EjFxM=",
        "publishedTime": "Less than 24 hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1765658214109-0",
        "headline": "Some Brave American Soldiers and a Helper Died in a Fight Far Away in Syria",
        "content": "Two American soldiers and a grown-up who helps them talk to people sadly died when a bad guy from a group called Islamic State attacked them in a place called Syria. Three other people got hurt too. This was the first time American people died there in a whole year. The bad guy was also killed, and grown-ups are trying to figure out exactly what happened.",
        "originalSource": "AP News / U.S. Central Command",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEzi0MMrtHBWUQRRTOjyEVLg8DXd2GS-pljbEy4HYuPXR4ZmJdXwK3xvPcXikLAzzuq9XaBVsMjvYe6m9FCsfjK8slblZLqy_3OUwzUSqtXY5dmv3c3ggQ-aZS1nKCM7rjy_yGiYa9DAcqwBBRQeKQ-f1ac6AIOZv_2qhmvQ0TMwkJ8vfC2IqO0KuzBMkCUzKkaDBWH17BLPhTukQWWq-6evJOh7mA=",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765658214109-1",
        "headline": "Lawmakers Show Pictures of President Trump, Mr. Clinton, and Prince Andrew",
        "content": "Some lawmakers called Democrats showed everyone 19 pictures from a very rich person's house named Jeffrey Epstein. In these pictures, you can see President Trump, a past president named Bill Clinton, and Prince Andrew from England. They showed these pictures because they want the government to let everyone see all the other thousands of pictures and papers from Epstein's house. The lawmakers didn't say that anyone did anything wrong in the pictures, they just showed them.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyXOVsWGW0CNpoJXMvF5OIW3ubDhDb7WVJDHL1sNUztXgj_zUYNT1es7IJWGDg7wP9OEYF_1i6O2j0Qi-4EPfhkBOuOF6Oxg3scKSeVZ6m4TYtpiJPYBLawdmDncK9WhZHkZzeD_Pl4pcnci3PFGZQnr8eiM0a1cyPDiYMlW9rcgb7eOfS8qu7ddEdRA==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-2",
        "headline": "New York Gave Driver's Licenses Wrongly to Some People",
        "content": "The boss of all the roads and cars, Mr. Sean Duffy, said that New York is the eighth state that gave big truck driver's licenses (CDLs) to people who weren't supposed to have them anymore after their papers ran out. He said that if New York doesn't fix this problem and take back those licenses, they won't get $73 million for their roads. This all started because a truck driver who wasn't supposed to be driving caused a really bad accident in Florida.",
        "originalSource": "San Francisco Chronicle (AP)",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQF1pzE4g8Lzve4karYE_3KlKQGeB-lqYBF96h9cgMgu72FheXk66SH05GwSzEGRvAskYhfyDlG1UgcgEaI8tDBNiE6j5YNdKQktPJ07rG2TcRGrVj0C7oXr45b76aj5k0S9n_ymfX0EPLEJi1hMMvrOWQWEuRP9EqQmlVVKQ_BxOVVRcyg2yyoMlftZIhOnwymYlNBKQ681FWYgw37xR6isPhqk4rzBCA==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-3",
        "headline": "A Man's Sad Death on a Roller Coaster Was an Accident",
        "content": "A grown-up named Kevin Rodriguez Zavala, who was 32 years old, sadly died on a roller coaster called Stardust Racers at Universal Orlando's Epic Universe. People said it was an accident because he got hurt really bad. A police report said he was found hurt, but the people who worked at the park did everything right. Kevin used a wheelchair and had metal rods in his back from an old operation.",
        "originalSource": "AP News (via WBOC)",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH6x0_aVABuD-2agg9v8x1MwaP3XlJex912CdfEPgHpLmonOCB0KnYlmL6zkYcF4jaxIfW_AN2WLeSuGSAphyHCjRqvurSZkLXiLiKtIThT8LdqKyJiTRs-gp60lXXYe3hMK7-9W7FMnaOxokGEA0mWP0m4cRsqWVYTj5mUNZoyMSCa2j1kpJRoGIL0nR5sa7S_9oe8ft-FRjSiXbT0Oqk9xo1AAn16otaXJKC6cLP80uG11SAD23tlZ6VqxrUb4-7KnyvPXJI6ryZcHE2zjIDYRBlckFgrB52NX1qZiw==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-4",
        "headline": "President Trump's Team Thinks Sign Language Might Change His Message",
        "content": "President Trump's team said in a paper that having someone use sign language to explain what he says during White House meetings would 'get in the way' of President Trump showing himself the way he wants to. This idea is part of why they are fighting against what a judge said they should do. A group called the National Association of the Deaf wanted the sign language helpers there.",
        "originalSource": "PBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHixlvV1H9p5muPbfiXvatqtUN3iFV9aEnFyhPD5OhlI0AELkyyJxoDxVkZWpDCOwxD_rJ7q7Y6qg_tEMXsMW2_OwJjaeuJKhSpXBb9GTaGu_dxQfyylQCx6Y_HMxjG6NFD1MeFOZL_1Ac5suCeMtrAy8pavt163RPU1H5TrxNJFF-hrfPuFMIvkkSfomptCayozG1POBQgqfLC2wn_VJROwTHjQDtgINJIL6iIyjon7GPpb1WUI8Ju2w==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-5",
        "headline": "Lots of Money Will Go to Sisters After a Girl Died from Not Getting Food",
        "content": "Two younger sisters of a girl named Arabella McCormack, who was 11 and sadly died because she was hurt very badly and didn't get enough food, will get $31.5 million. This big money payment means that many grown-ups and places, like the city, the county, a school, and even a church, are being held responsible. They didn't do enough to help Arabella when she was being treated so terribly.",
        "originalSource": "AP News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQF1LDsuiZbkboNf0wqtHL7b4Skure7IglVwGj4cCw-0XWsPvCY1Zp7Mqz5hpCTUAc98cfvJO6kI6lnYwA2BXcJlFZjxVTQEBwdYMYK8TIBdGF_WzXHjdLTMk3eP7UQnen6e3FX_67f2mTbjCFpxKMc4yJCy9D7N2w3e-PBkM1FGxN7SD3mChdpUNba23JUba7EjFxM=",
        "publishedTime": "Less than 24 hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1765658214109-0",
        "headline": "Echoes in Palmyra",
        "content": "The Syrian desert stretched endlessly, holding its breath. A routine patrol, a shared joke, then the world exploded. A lone gunman, a ghost of a fading conflict, rose from the dust. Two American service members, their hopes and futures stolen, fell. Beside them, an interpreter, a bridge between worlds, silenced forever. Three more wounded, the air thick with the acrid scent of gunpowder and grief. The investigation would follow, the gunman dead, but the void left by their sacrifice near Palmyra would echo in the vast, unforgiving landscape.",
        "originalSource": "AP News / U.S. Central Command",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEzi0MMrtHBWUQRRTOjyEVLg8DXd2GS-pljbEy4HYuPXR4ZmJdXwK3xvPcXikLAzzuq9XaBVsMjvYe6m9FCsfjK8slblZLqy_3OUwzUSqtXY5dmv3c3ggQ-aZS1nKCM7rjy_yGiYa9DAcqwBBRQeKQ-f1ac6AIOZv_2qhmvQ0TMwkJ8vfC2IqO0KuzBMkCUzKkaDBWH17BLPhTukQWWq-6evJOh7mA=",
        "publishedTime": "Hours ago"
      },
      {
        "id": "story-1765658214109-1",
        "headline": "Shadows on the Island",
        "content": "The congressional committee unveiled a sliver of a hidden world, nineteen images plucked from ninety-five thousand. There, smiling or solemn, stood President Trump, Bill Clinton, and Prince Andrew, faces of power caught in the gilded cages of Jeffrey Epstein’s infamous estate. This initial release was a tactical maneuver, a calculated pressure on the Republican administration, urging them to expose the full truth before the deadline loomed. No context accompanied the stark photographs, yet the whispers of untold stories and unanswered questions hung heavy in the air, a persistent hum of intrigue.",
        "originalSource": "CBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEyXOVsWGW0CNpoJXMvF5OIW3ubDhDb7WVJDHL1sNUztXgj_zUYNT1es7IJWGDg7wP9OEYF_1i6O2j0Qi-4EPfhkBOuOF6Oxg3scKSeVZ6m4TYtpiJPYBLawdmDncK9WhZHkZzeD_Pl4pcnci3PFGZQnr8eiM0a1cyPDiYMlW9rcgb7eOfS8qu7ddEdRA==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-2",
        "headline": "Expired Journeys",
        "content": "New York became the eighth domino to fall, caught in a federal audit's unforgiving spotlight. Commercial driver's licenses, critical gateways to employment, had been improperly issued to immigrants, remaining valid long after legal residency expired. Secretary Sean Duffy's ultimatum was swift: fix the flawed system, revoke the illicit licenses, or lose $73 million in highway funds. The stakes were tragically high; a recent audit in Florida, prompted by a fatal crash involving an unauthorized truck driver, served as a stark reminder of the potential consequences. The roads ahead demanded accountability.",
        "originalSource": "San Francisco Chronicle (AP)",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQF1pzE4g8Lzve4karYE_3KlKQGeB-lqYBF96h9cgMgu72FheXk66SH05GwSzEGRvAskYhfyDlG1UgcgEaI8tDBNiE6j5YNdKQktPJ07rG2TcRGrVj0C7oXr45b76aj5k0S9n_ymfX0EPLEJi1hMMvrOWQWEuRP9EqQmlVVKQ_BxOVVRcyg2yyoMlftZIhOnwymYlNBKQ681FWYgw37xR6isPhqk4rzBCA==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-3",
        "headline": "Starlight's End",
        "content": "The Stardust Racers coaster promised exhilaration, a fleeting escape into a universe of thrills. For Kevin Rodriguez Zavala, 32, it became his final journey. Found slumped, severe facial trauma hinting at a violent end, his death was ruled accidental, attributed to blunt-impact injuries. He, who navigated life with a wheelchair and spinal rods from a prior surgery, had sought a moment of weightless joy. The sheriff's report concluded park workers followed every procedure, a cold comfort against the backdrop of shattered dreams at Universal Orlando’s Epic Universe.",
        "originalSource": "AP News (via WBOC)",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH6x0_aVABuD-2agg9v8x1MwaP3XlJex912CdfEPgHpLmonOCB0KnYlmL6zkYcF4jaxIfW_AN2WLeSuGSAphyHCjRqvurSZkLXiLiKtIThT8LdqKyJiTRs-gp60lXXYe3hMK7-9W7FMnaOxokGEA0mWP0m4cRsqWVYTj5mUNZoyMSCa2j1kpJRoGIL0nR5sa7S_9oe8ft-FRjSiXbT0Oqk9xo1AAn16otaXJKC6cLP80uG11SAD23tlZ6VqxrUb4-7KnyvPXJI6ryZcHE2zjIDYRBlckFgrB52NX1qZiw==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-4",
        "headline": "A Voice Unheard",
        "content": "The legal brief landed with a controversial thud. The Trump administration argued that mandatory real-time American Sign Language interpretation during White House briefings would \"severely intrude on the President's prerogative to control the image he presents to the public.\" This stance, part of an appeal against a federal judge's order, ignited a fresh debate. The National Association of the Deaf had sued, seeking equal access to information. Yet, the administration prioritized its curated narrative, risking a chasm of understanding for a community yearning for clear, direct communication from their leader.",
        "originalSource": "PBS News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHixlvV1H9p5muPbfiXvatqtUN3iFV9aEnFyhPD5OhlI0AELkyyJxoDxVkZWpDCOwxD_rJ7q7Y6qg_tEMXsMW2_OwJjaeuJKhSpXBb9GTaGu_dxQfyylQCx6Y_HMxjG6NFD1MeFOZL_1Ac5suCeMtrAy8pavt163RPU1H5TrxNJFF-hrfPuFMIvkkSfomptCayozG1POBQgqfLC2wn_VJROwTHjQDtgINJIL6iIyjon7GPpb1WUI8Ju2w==",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1765658214109-5",
        "headline": "The Weight of Neglect",
        "content": "The $31.5 million settlement was a grim acknowledgment, a price paid for a life stolen by unimaginable cruelty. Arabella McCormack, just eleven, had endured torture and starvation, a silent tragedy ending in 2022. Her two younger sisters, survivors of the same nightmare, would now bear the weight of this monetary justice. The city, county, a school, and a church—a network of supposed protectors—were held accountable. Each had failed, their collective inaction forming a systematic breach, allowing a child to suffer and die. The settlement closed a chapter, but the scars remained.",
        "originalSource": "AP News",
        "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQF1LDsuiZbkboNf0wqtHL7b4Skure7IglVwGj4cCw-0XWsPvCY1Zp7Mqz5hpCTUAc98cfvJO6kI6lnYwA2BXcJlFZjxVTQEBwdYMYK8TIBdGF_WzXHjdLTMk3eP7UQnen6e3FX_67f2mTbjCFpxKMc4yJCy9D7N2w3e-PBkM1FGxN7SD3mChdpUNba23JUba7EjFxM=",
        "publishedTime": "Less than 24 hours ago"
      }
    ]
  }
}