{
  "timestamp": 1764945880066,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1764945807434-0",
        "headline": "Horrifying Footage Reveals Systemic Disregard for Human Life in US Airstrike, Demanding Immediate Accountability",
        "content": "New footage, reportedly viewed by US senators, depicts two unarmed, shirtless men struggling to stay afloat for an hour after an initial US boat strike, only to be killed in a follow-up attack. This egregious act raises serious questions about the operational ethics, legality, and the systemic culture of military engagement that allows such profound human rights violations. The incident demands immediate and thorough investigation to ensure accountability and prevent future atrocities, highlighting the urgent need for transparency and civilian protection in all military operations.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764945807434-1",
        "headline": "Supreme Court Upholds Partisan Gerrymandering in Texas, Further Eroding Democratic Representation",
        "content": "In a severe blow to democratic principles, the Supreme Court has allowed Texas to proceed with a newly redistricted map that significantly favors the Republican party. This decision perpetuates partisan gerrymandering, systematically undermining fair representation and disenfranchising voters, particularly impacting communities of color. The ruling threatens to entrench structural inequalities in the 2026 election cycle and beyond, making it harder for marginalized groups to elect representatives who truly serve their interests, thereby demanding urgent electoral reform.",
        "originalSource": "AP News",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1764945807434-2",
        "headline": "Alleged Capitol Pipe Bomber Faces Justice, Highlighting Ongoing Threat of Domestic Extremism",
        "content": "The individual arrested in connection with placing pipe bombs near the US Capitol on the eve of January 6 is scheduled for an initial court appearance. This pivotal moment underscores the serious and ongoing threat of domestic extremism to American democracy. The FBI's long-running investigation and subsequent arrest highlight the critical need for accountability for those who sought to subvert democratic processes and sow terror, emphasizing the broader systemic issues of political polarization and disinformation that fuel such attacks.",
        "originalSource": "The Guardian",
        "publishedTime": "2 minutes ago"
      },
      {
        "id": "story-1764945807434-3",
        "headline": "President Trump's Lavish White House Ballroom Project Faces Architectural Dispute Amid Pressing National Crises",
        "content": "President Trump is reportedly replacing the chief architect for a planned White House ballroom project, a move said to stem from disagreements over design. This focus on lavish personal projects comes at a time when the nation faces numerous systemic crises, including housing insecurity, healthcare disparities, and climate change. The executive's apparent preoccupation with architectural grandeur, rather than addressing the urgent needs of ordinary citizens, highlights a troubling misalignment of priorities and resource allocation.",
        "originalSource": "CBS News",
        "publishedTime": "18 hours ago"
      },
      {
        "id": "story-1764945807434-4",
        "headline": "New US Immigration Policies Further Marginalize Vulnerable Workers, Exacerbating Systemic Inequalities",
        "content": "The U.S. government has announced new measures that will restrict and slow down the process for obtaining work permits for certain immigrants. This administrative change represents the latest expansion of anti-immigrant policies, creating unnecessary systemic barriers for vulnerable workers and families. These restrictions not only slow economic integration but also perpetuate a system of exploitation and xenophobia, rather than addressing the root causes of migration or acknowledging the significant contributions immigrants make to our society. Humane and comprehensive immigration reform is urgently needed.",
        "originalSource": "CBS News",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1764945807434-5",
        "headline": "Skyrocketing Rents Expose Deepening Housing Crisis and Systemic Failure to Protect Tenants",
        "content": "A new LendingTree analysis reveals that rents in the 50 largest U.S. cities have surged dramatically by hundreds of dollars per month since 2020. This alarming increase is not merely market fluctuation but a symptom of a systemic housing crisis, driven by corporate landlords, speculative investments, and inadequate government regulation. These skyrocketing costs disproportionately displace working-class families and marginalized communities, exacerbate homelessness, and perpetuate economic inequality, underscoring the urgent need for rent control, increased affordable housing development, and stronger tenant protections.",
        "originalSource": "CBS News",
        "publishedTime": "15 hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1764945807434-0",
        "headline": "US airstrike survivors clung to boat wreckage for an hour before second deadly attack, video shows",
        "content": "Footage seen by US senators reportedly showed two unarmed, shirtless men struggling to stay afloat for an hour after the initial boat strike before being killed in a follow-up attack, raising serious questions about the operation's legality.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764945807434-1",
        "headline": "Supreme Court allows Texas to use redrawn congressional map favorable to GOP",
        "content": "The Supreme Court ruled to let Texas use its newly redistricted map for now, which gives Republicans a significant advantage, potentially impacting the state's representation in the 2026 election cycle despite ongoing legal challenges to the map's fairness.",
        "originalSource": "AP News",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1764945807434-2",
        "headline": "Suspect in US Capitol pipe bomb plot to make first appearance in court",
        "content": "The individual arrested in connection with placing pipe bombs near the US Capitol on the eve of January 6 is scheduled to make his initial court appearance. The FBI's long-running investigation culminated in the recent arrest of the suspect in the nation's capital.",
        "originalSource": "The Guardian",
        "publishedTime": "2 minutes ago"
      },
      {
        "id": "story-1764945807434-3",
        "headline": "Trump hires new architect for White House ballroom construction",
        "content": "President Trump is replacing the chief architect for the planned White House ballroom project, though the original architect will remain on the team. Sources indicate the move follows disagreements between the President and the current firm over the construction plans and design elements.",
        "originalSource": "CBS News",
        "publishedTime": "18 hours ago"
      },
      {
        "id": "story-1764945807434-4",
        "headline": "U.S. tightens immigration work permits in latest move to expand crackdown",
        "content": "The U.S. government announced new measures to restrict and slow down the process for obtaining work permits for certain immigrants. This administrative change represents the latest effort by the current administration to expand its crackdown on both legal and illegal immigration pathways.",
        "originalSource": "CBS News",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1764945807434-5",
        "headline": "These U.S. cities have seen the biggest rent increases since 2020",
        "content": "A new analysis by LendingTree reveals that rents in the 50 largest U.S. cities have surged dramatically, increasing by hundreds of dollars per month over the last five years. The report highlights which major metropolitan areas are experiencing the most severe spike in housing costs.",
        "originalSource": "CBS News",
        "publishedTime": "15 hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1764945807434-0",
        "headline": "Accountability Demanded After Troubling Details Emerge From Military Operation",
        "content": "New footage reportedly viewed by U.S. senators shows unarmed men struggling for an hour after an initial boat strike before a follow-up attack, raising serious questions about military conduct and the necessity of a thorough investigation to uphold the integrity of our armed forces.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764945807434-1",
        "headline": "Supreme Court Upholds Texas' Sovereign Right to Determine Its Own Electoral Maps",
        "content": "The Supreme Court has rightly allowed Texas to implement its newly drawn congressional map, affirming the state's constitutional authority to manage its electoral processes. This decision ensures that Texans' representation will reflect the will of the people, despite partisan attempts to challenge the legitimate redistricting process.",
        "originalSource": "AP News",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1764945807434-2",
        "headline": "Justice System Takes Action Against Individual Accused of Capitol Pipe Bomb Plot",
        "content": "The individual apprehended in connection with placing pipe bombs near the U.S. Capitol on the eve of January 6th is scheduled for his initial court appearance. This underscores the unwavering commitment of our law enforcement to ensure accountability for those who threaten our nation's security and governmental institutions.",
        "originalSource": "The Guardian",
        "publishedTime": "2 minutes ago"
      },
      {
        "id": "story-1764945807434-3",
        "headline": "President Trump Asserts Vision for White House Ballroom Project with New Architect",
        "content": "President Trump is replacing the lead architect for the planned White House ballroom, though the original architect will remain on the team. This decisive move follows disagreements over design, demonstrating President Trump's hands-on approach to ensuring the White House's grandeur and historical significance are meticulously preserved and enhanced.",
        "originalSource": "CBS News",
        "publishedTime": "18 hours ago"
      },
      {
        "id": "story-1764945807434-4",
        "headline": "U.S. Government Strengthens Immigration Protocols to Prioritize National Interests",
        "content": "The U.S. government has announced new measures to restrict and slow the process for obtaining work permits for certain immigrants. These administrative changes represent the latest effort by this administration to reinforce border security and ensure that legal immigration pathways are orderly and prioritize the well-being of American citizens.",
        "originalSource": "CBS News",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1764945807434-5",
        "headline": "Government Policies Fueling Skyrocketing Rents in Major U.S. Cities",
        "content": "A new analysis highlights that rents in the 50 largest U.S. cities have surged dramatically, with increases of hundreds of dollars per month over the last five years. This alarming trend is a direct consequence of inflationary government spending and burdensome regulations that stifle free-market solutions and make housing unaffordable for hardworking Americans.",
        "originalSource": "CBS News",
        "publishedTime": "15 hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1764945807434-0",
        "headline": "Pentagon Lauded For Meticulous Follow-Up Strikes After Survivors Demonstrate Alarming Resilience",
        "content": "New footage reveals military drone operators displayed unparalleled patience, allowing two unarmed boat-strike survivors a full hour to reflect on their life choices and flail for dramatic effect before delivering a second, more conclusive blow. Critics, however, continue to bafflingly question the 'legality' of making sure no loose ends remain, prompting the military to remind everyone about the importance of thoroughness in all operations, especially those involving water.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764945807434-1",
        "headline": "Supreme Court Declares Texas Redistricting Map 'Fair,' As Long As You're A Republican And Enjoy Winning",
        "content": "In a stunning display of judicial wisdom, the Supreme Court has generously allowed Texas to proceed with its newly gerrymandered congressional map, which, by sheer coincidence, just happens to give Republicans a virtually insurmountable advantage. Legal experts are now scrambling to redefine 'fairness' as 'a mathematical certainty that one party will dominate,' with many praising the map's artistic ability to make inconvenient votes simply vanish into thin air ahead of the 2026 election cycle.",
        "originalSource": "AP News",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1764945807434-2",
        "headline": "After Two Years, FBI Finally Locates Capitol Pipe Bomb Suspect Who Was Reportedly Just Waiting For An Invitation To Court",
        "content": "The individual accused of orchestrating the highly elusive Capitol pipe bomb plot on the eve of January 6th is finally making his initial court appearance, much to the relief of a nation that spent two years wondering if the FBI was just playing a very long game of 'peek-a-boo.' Investigators credited their groundbreaking strategy of 'eventually looking where the suspect was' for the dramatic breakthrough, with sources confirming the suspect was found meticulously polishing the pipe bombs, patiently awaiting arrest.",
        "originalSource": "The Guardian",
        "publishedTime": "2 minutes ago"
      },
      {
        "id": "story-1764945807434-3",
        "headline": "President Trump Fires White House Ballroom Architect For Insufficient Levels Of Pure Gold And Monumental Grandeur",
        "content": "President Trump has reportedly replaced the lead architect for the planned White House ballroom, citing profound disagreements over the project's 'lack of ambition' and 'unacceptable subtlety.' Sources close to the President indicated he was deeply disappointed that the original design did not feature a solid gold ceiling, diamond-encrusted chandeliers, and a functioning roller coaster, preferring a more 'presidential' aesthetic that truly screams 'opulence so loud it makes other opulence look like a Tuesday afternoon.' The original architect, however, will remain on the team in an advisory capacity, presumably to learn the true meaning of excess.",
        "originalSource": "CBS News",
        "publishedTime": "18 hours ago"
      },
      {
        "id": "story-1764945807434-4",
        "headline": "U.S. Government Unveils Revolutionary New Plan To Tackle Immigration: Make Absolutely Everything Slower",
        "content": "In a bold move to 'streamline' national security and 'enhance' bureaucratic efficiency, the U.S. government has proudly announced groundbreaking new measures to restrict and intentionally prolong the process for obtaining immigrant work permits. Officials lauded the innovative strategy, stating that by making every step of the legal immigration pathway excruciatingly difficult and mind-numbingly slow, they can effectively 'crack down' on the very concept of people working. Experts anticipate a record number of new forms will be required, each with at least 17 confusing checkboxes and a mandatory three-week waiting period for ink to dry.",
        "originalSource": "CBS News",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1764945807434-5",
        "headline": "New Report Confirms Rent Now Costs More Than Your Soul In Major U.S. Cities, Slightly Less Than A Small Private Island",
        "content": "A groundbreaking analysis by LendingTree has confirmed what millions of Americans already suspected: simply existing in major U.S. cities now comes with a monthly premium that rivals the GDP of some small nations. Rents in the 50 largest metropolitan areas have reportedly 'surged dramatically' by 'hundreds of dollars,' leading many to question if 'affordable housing' is now just a quirky historical anecdote. Landlords, meanwhile, are reportedly considering additional charges for 'breathing the air' and 'enjoying the distant view of an apartment you can't afford.'",
        "originalSource": "CBS News",
        "publishedTime": "15 hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1764945807434-0",
        "headline": "Sad Video Shows Men Attacked Twice in the Water",
        "content": "US senators saw a video where two men who didn't have weapons and weren't wearing shirts were trying to stay alive in the water for a whole hour after their boat was hit. Then, another attack happened, and they were killed. This makes people wonder if what happened was fair or allowed by the law.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764945807434-1",
        "headline": "Top Court Says Texas Can Use New Election Map",
        "content": "The most important court in the country said that Texas can use its new map for elections right now. This new map helps one political group, the Republicans, win more easily. Even though some people are saying the map isn't fair, it might change how Texas is represented in future elections, starting in 2026.",
        "originalSource": "AP News",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1764945807434-2",
        "headline": "Person Who Planted Bombs Will Go To Court",
        "content": "Someone who was arrested for putting bombs near the big building where laws are made (the US Capitol) before January 6th is going to court for the first time. The FBI, which is like a super police force, had been looking for this person for a long time and finally caught them in Washington D.C.",
        "originalSource": "The Guardian",
        "publishedTime": "2 minutes ago"
      },
      {
        "id": "story-1764945807434-3",
        "headline": "President Trump Gets A New Architect For The White House",
        "content": "President Trump is getting a different main architect to help build a new big fancy room, called a ballroom, at the White House. The old architect will still be part of the team, but President Trump and the company they hired had some disagreements about how it should look and be built.",
        "originalSource": "CBS News",
        "publishedTime": "18 hours ago"
      },
      {
        "id": "story-1764945807434-4",
        "headline": "US Makes It Harder To Get Work Papers For Immigrants",
        "content": "The government in the U.S. said it will make it tougher and take longer for some people who come from other countries (immigrants) to get papers that let them work here. This is the newest way the government is trying to control who comes into the country and works, whether they came legally or not.",
        "originalSource": "CBS News",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1764945807434-5",
        "headline": "Rent Prices Have Gone Way Up In Many Cities",
        "content": "A new study found that the cost to rent a home in the 50 biggest cities in the U.S. has gone up a lot. People are paying hundreds of dollars more each month than they did five years ago. The study shows which big cities are having the biggest problem with super high housing costs.",
        "originalSource": "CBS News",
        "publishedTime": "15 hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1764945807434-0",
        "headline": "The Ocean's Cruel Deception",
        "content": "The first blast tore through their vessel, a splintered testament to sudden war. For an hour, two men, stripped bare by the ocean’s fury, clung to the wreckage. Hope, a fragile thing, flickered with each passing wave as they fought the current, their bodies weary, their eyes scanning the horizon for rescue. They saw the approaching craft, a silhouette against the sun, not as salvation but as a harbinger. A second, precise strike erased them from the water, leaving only echoes of a silent question about justice and the unseen depths of conflict.",
        "originalSource": "The Guardian",
        "publishedTime": "1 hour ago"
      },
      {
        "id": "story-1764945807434-1",
        "headline": "A Cartographer's Shadow",
        "content": "The Supreme Court’s gavel fell, reshaping the very landscape of Texas. Lines on a map, once mere ink, now dictated destinies, drawing borders that favored one side over the other. Republicans watched, pleased, as the new congressional districts solidified their grip on power, a political advantage stretching toward the 2026 elections. Though protests of unfairness echoed in legal chambers, for now, the map stood. Each newly defined boundary, a silent testament to the enduring power of a pen stroke to alter the voice of a state, year after year.",
        "originalSource": "AP News",
        "publishedTime": "14 hours ago"
      },
      {
        "id": "story-1764945807434-2",
        "headline": "Echoes of the Eve",
        "content": "For years, the shadows of January 6th lingered, punctuated by the mystery of the pipe bombs. Near the Capitol, on that tumultuous eve, devices had been placed, a sinister prelude to chaos. The FBI’s relentless pursuit, a quiet hum in the background of a nation’s memory, finally bore fruit. In the nation’s capital, an arrest was made. Now, the individual believed responsible would face the public glare, their first court appearance set to unravel the threads of a long-held secret, and perhaps, bring answers to a nation still asking why.",
        "originalSource": "The Guardian",
        "publishedTime": "2 minutes ago"
      },
      {
        "id": "story-1764945807434-3",
        "headline": "A Grand Design Disagreement at the White House",
        "content": "The blueprint for the new White House ballroom lay spread, a vision of grandeur that clashed with reality. President Trump, ever the builder, found his grand aesthetic at odds with the current chief architect’s plans. Whispers of creative differences, of soaring ceilings versus functional elegance, filled the West Wing. A new architect, hand-picked, would now steer the project, tasked with translating President Trump's precise vision into marble and gold. The original master would stay, a silent observer to the unfolding drama of design, as President Trump sought to leave his indelible mark on the nation's most famous residence.",
        "originalSource": "CBS News",
        "publishedTime": "18 hours ago"
      },
      {
        "id": "story-1764945807434-4",
        "headline": "The Narrowing Path",
        "content": "A chill wind blew through immigration offices. The government had announced new decrees, tightening the gates, slowing the flow. Work permits, once a beacon of hope for many seeking a new life, would now be harder to obtain, the process laden with fresh hurdles. This wasn't a whisper of change, but a clear administrative shout, expanding the crackdown on those seeking entry, whether through legal or illegal avenues. For countless souls across the globe, the American dream, already distant, now felt a little further out of reach, caught in the bureaucratic tightening.",
        "originalSource": "CBS News",
        "publishedTime": "15 hours ago"
      },
      {
        "id": "story-1764945807434-5",
        "headline": "Walls of Rising Rent",
        "content": "The city skyline stretched, a glittering promise, but for many, it was a promise slipping away. A new report painted a grim picture: rents in America’s largest cities had skyrocketed since 2020. Hundreds of dollars added to monthly bills, transforming once-manageable apartments into unattainable luxuries. Families squeezed budgets, young professionals delayed dreams of homeownership, all caught in the relentless upward creep of housing costs. The vibrant pulse of urban life, once accessible, now beat behind walls of rising rent, leaving many to wonder where they truly belonged in the concrete jungle.",
        "originalSource": "CBS News",
        "publishedTime": "15 hours ago"
      }
    ]
  }
}