{
  "timestamp": 1765429251803,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1765429174317-0",
        "headline": "U.S. Imperialism Escalates as Oil Tanker Seizure Threatens Venezuelan Sovereignty",
        "content": "The seizure of a Venezuelan oil tanker by American forces represents a dangerous escalation of U.S. interventionist policy, further destabilizing a nation already reeling from relentless economic sanctions. This aggressive move, framed as part of a 'pressure campaign,' primarily harms the Venezuelan people by disrupting their vital economic lifelines and undermining national sovereignty, rather than addressing any legitimate concerns. It exposes a pattern of U.S. foreign policy that prioritizes resource control and regime change over diplomatic solutions and human welfare.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765429174317-1",
        "headline": "Federal Reserve's Rate Cuts Continue to Fail Working Families While Protecting Corporate Profits",
        "content": "The Federal Reserve's third consecutive interest rate cut by 0.25 percentage points, ostensibly to 'stabilize and stimulate growth,' highlights a persistent failure to address the root causes of economic instability and inequality. While these cuts may temporarily buoy financial markets and corporate profits, they do little to alleviate the burden of soaring inflation and stagnant wages for working-class families. This approach demonstrates a systemic bias towards protecting capital, rather than implementing meaningful policies that ensure economic justice and a living wage for all.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765429174317-2",
        "headline": "Massive Defense Bill Passed, Diverting Billions from Critical Social Needs to the Military-Industrial Complex",
        "content": "The House of Representatives' passage of the annual defense bill, while including a raise for troop pay, represents another egregious allocation of public funds towards an ever-expanding military-industrial complex. This bipartisan endorsement of massive military spending, authorizing significant overhauls to weapons procurement, diverts crucial resources that could otherwise address pressing domestic issues like healthcare, education, and climate change. It underscores a systemic problem where prioritizing instruments of war consistently trumps investing in the well-being and security of the American people at home. The internal friction between the Republican-controlled Congress and President Trump's administration regarding military management does little to address the fundamental issue of disproportionate defense spending.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765429174317-3",
        "headline": "President Trump Deploys Xenophobic Rhetoric, Blaming Immigrants Instead of Addressing Systemic Affordability Crisis",
        "content": "During a supposedly focused speech on economic affordability, President Trump once again weaponized his platform to launch a lengthy, baseless diatribe against immigrants. This transparent tactic serves to scapegoat vulnerable populations for systemic economic failures and divert public attention from the real causes of the affordability crisis, such as corporate greed and regressive tax policies. Such dehumanizing rhetoric fuels division and distracts from the urgent need for genuine solutions that benefit all residents, not just those privileged by current power structures.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765429174317-4",
        "headline": "Republican Infighting Threatens Vital ACA Subsidies, Endangering Healthcare Access for Millions",
        "content": "The internal power struggle within the House Republican party, as 'moderates' challenge Speaker Mike Johnson over extending Affordable Care Act subsidies, threatens to strip millions of Americans of essential healthcare access. While Democrats push for a straightforward three-year extension, the GOP's inability to build consensus around a viable alternative before tax credits expire demonstrates a profound systemic failure to prioritize public health over ideological rigidity. This ongoing political maneuvering places the burden squarely on working families and vulnerable populations, highlighting the urgent need for a healthcare system that guarantees access as a human right, rather than a commodity subject to partisan bickering.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765429174317-5",
        "headline": "President Trump's Administration Proposes Invasive Social Media Surveillance, Eroding Privacy for Global Travelers",
        "content": "The President Trump administration's proposal to demand five years of social media history from foreign tourists seeking visa-free entry represents a dangerous expansion of the surveillance state and a profound invasion of privacy. This draconian measure, justified under the guise of 'security,' sets a chilling precedent that could disproportionately target and discriminate against individuals based on their online expressions. It further alienates global citizens and undermines fundamental privacy rights, contributing to a climate of fear and suspicion rather than fostering international cooperation.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "9 hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1765429174317-0",
        "headline": "U.S. Seizes Oil Tanker Off The Coast of Venezuela, Escalating Tensions With Maduro",
        "content": "American forces have seized an oil tanker near the Venezuelan coast, a significant escalation in tensions between the United States and the Nicolás Maduro regime. This action comes amid a continuous U.S. pressure campaign against the country's oil-dependent economy, marking a new phase in the ongoing diplomatic and military standoff.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765429174317-1",
        "headline": "Federal Reserve Cuts Interest Rates by 0.25 Percentage Points in Third Straight Cut",
        "content": "The Federal Reserve has decided to cut interest rates by 0.25 percentage points, marking the third consecutive reduction as central bankers grapple with mixed economic signals. The move is a response to persistent economic issues, including higher inflation and a perceived slowing labor market, aiming to stabilize and stimulate growth.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765429174317-2",
        "headline": "House Passes Annual Defense Bill to Raise Troop Pay and Overhaul Weapons Purchases",
        "content": "The U.S. House of Representatives passed the annual defense bill, authorizing funding to raise troop pay and implement significant overhauls to weapons procurement systems. The bill passed with a substantial majority (312-112) but highlights ongoing friction between the Republican-controlled Congress and the Trump administration regarding the management of the military.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765429174317-3",
        "headline": "Trump's Affordability Speech Turns Into A Rant Against Immigrants",
        "content": "During a scheduled speech focused on the topic of economic affordability, President Donald Trump reportedly shifted his focus, dedicating a significant portion of his remarks to deliver a lengthy diatribe against immigrants. The unplanned departure from the affordability theme highlights the administration's continued emphasis on stringent immigration rhetoric.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765429174317-4",
        "headline": "House GOP Moderates Revolt Against Johnson on Health Care as ACA Subsidies Set to Expire",
        "content": "House Republican moderates are attempting to force a vote on extending Affordable Care Act subsidies, challenging Speaker Mike Johnson's leadership. Democrats are pushing for a three-year extension with no reforms, while Republicans remain divided and have yet to build consensus around an alternative plan before the tax credits expire.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765429174317-5",
        "headline": "U.S. Proposes Requiring Foreign Tourists to Submit 5 Years of Social Media History",
        "content": "The Trump administration is proposing a new requirement for visitors from countries that participate in the visa-free travel program. These foreign tourists would be asked to submit five years of their social media history for security screening before they are allowed to enter the United States, a measure raising privacy concerns.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "9 hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1765429174317-0",
        "headline": "America Takes Decisive Action Against Maduro Regime, Seizing Oil Tanker to Uphold Freedom",
        "content": "American forces have seized an oil tanker near the Venezuelan coast, a significant and commendable escalation in tensions between the United States and the tyrannical Nicolás Maduro regime. This decisive action comes amid President Trump's continuous pressure campaign against the country's oil-dependent socialist economy, marking a necessary phase in the ongoing standoff to restore liberty and protect American interests from oppressive forces.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765429174317-1",
        "headline": "Federal Reserve's Latest Rate Cut Raises Concerns Amid Economic Uncertainty",
        "content": "The Federal Reserve has decided to cut interest rates by 0.25 percentage points, marking the third consecutive reduction as central bankers grapple with mixed economic signals. This intervention is a response to persistent economic issues, including higher inflation and a perceived slowing labor market, yet many warn it risks devaluing the dollar and artificially manipulating markets rather than fostering genuine, sustainable growth driven by free enterprise.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765429174317-2",
        "headline": "Congress Approves Vital Defense Bill to Bolster Our Military and Support Brave Troops",
        "content": "The U.S. House of Representatives passed the annual defense bill, authorizing crucial funding to raise troop pay and implement significant overhauls to weapons procurement systems. The bill passed with a substantial majority, demonstrating a bipartisan commitment to our brave servicemen and women. While debates within the Republican-controlled Congress and the President Trump administration continue regarding the most efficient management of the military, the ultimate goal remains a strong, prepared defense for our nation.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765429174317-3",
        "headline": "President Trump Highlights Critical Link Between Secure Borders and Economic Affordability for All Americans",
        "content": "During a scheduled speech focused on economic affordability, President Trump powerfully shifted his focus, dedicating a significant portion of his remarks to deliver a firm stance against unchecked immigration. This crucial departure from the initial theme underscores the administration's unwavering commitment to secure borders, recognizing that uncontrolled immigration strains public resources and suppresses wages, thereby directly impacting the affordability and prosperity for hardworking American citizens.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765429174317-4",
        "headline": "GOP Strives for True Healthcare Reform as ACA Subsidies Loom",
        "content": "House Republican moderates are attempting to force a vote on extending the Affordable Care Act subsidies, posing a challenge to Speaker Mike Johnson's leadership as conservatives seek to dismantle the flawed 'Obamacare' system. Democrats are pushing for a costly three-year extension with no reforms, while Republicans remain dedicated to building consensus around an alternative, market-driven plan that reduces government overreach and empowers individuals before these taxpayer-funded credits expire.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765429174317-5",
        "headline": "Protecting American Citizens: Trump Administration Proposes Vital Security Measures for Foreign Travelers",
        "content": "The President Trump administration is proposing a crucial new requirement for visitors from countries participating in the visa-free travel program. These foreign tourists would be asked to submit five years of their social media history for security screening before they are allowed to enter the United States. This measure, while raising predictable privacy concerns from some, is a necessary and prudent step to enhance national security and protect American citizens from potential threats in an increasingly dangerous world.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "9 hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1765429174317-0",
        "headline": "U.S. Navy 'Borrows' Venezuelan Oil Tanker for 'Extended Test Drive,' Citing 'Unsatisfied Curiosity'",
        "content": "In a bold move that analysts are calling 'peak petty theft,' American forces have \"liberated\" an oil tanker from the vicinity of the Venezuelan coast. The Pentagon assures everyone this isn't an 'escalation' so much as a 'spirited game of geopolitical tag' with the Nicolás Maduro regime. Sources close to the operation confirmed the U.S. was simply 'curious what kind of gas mileage it gets' and needed to 'take it for a spin' amidst its ongoing, 'totally not aggressive' campaign against Venezuela's rather oil-dependent economy. This marks a thrilling new chapter in the diplomatic and military 'we-just-wanted-to-see-what-was-inside' standoff.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765429174317-1",
        "headline": "Federal Reserve Announces Interest Rates Now Just 'Slightly Less Painful' Following Third Consecutive Reduction",
        "content": "In a move that has economists scrambling to update their 'slightly less terrible' economic models, the Federal Reserve has heroically slashed interest rates by a full quarter of a percentage point. This marks the third straight reduction, prompting whispers that central bankers might be playing a high-stakes game of 'pin the tail on the donkey' with the national economy. The Fed insists this tiny tweak is a brilliant response to 'mixed signals' – which apparently include 'screaming signals' from inflation and a labor market that's merely 'ambling along like a confused sloth.' The goal, naturally, is to 'stabilize' things by making them just a *little* bit less unstable, and 'stimulate' growth by nudging it with a feather.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765429174317-2",
        "headline": "House Approves Defense Bill That Guarantees Troops Brand New, Slightly Shinier Helmets, Plus More Tanks We Don't Need",
        "content": "The U.S. House of Representatives, in a display of bipartisan commitment to perpetually updating the nation's arsenal, has triumphantly passed the annual defense bill. The legislation, which guarantees a pay raise for troops (now they can afford that avocado toast!) and promises 'significant overhauls' to weapons procurement, mostly ensures we’ll buy more stealth bombers that aren't *quite* stealthy enough and drones that can deliver pizza. While the bill passed with an overwhelming majority, it mostly served as another exciting opportunity for the Republican-controlled Congress and the President Trump administration to playfully bicker over who gets to choose the color scheme for the next generation of super-secret squirrel combat boots.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765429174317-3",
        "headline": "President Trump's 'Affordability' Speech Miraculously Explains How Immigrants Make Everything Too Expensive, Apparently",
        "content": "In a stunning display of oratorical gymnastics, President Trump's eagerly anticipated speech on 'economic affordability' took an unforeseen detour, seamlessly transitioning into a comprehensive, hour-long exposition on... immigrants. Audience members reported that the President skillfully connected the dots between the rising cost of living and, well, the mere existence of people from other countries. This 'unplanned' yet entirely predictable narrative shift, where 'affordable groceries' became 'not enough wall,' merely underscores the administration's unwavering commitment to making sure everyone knows *exactly* who to blame for everything, especially high prices.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765429174317-4",
        "headline": "House GOP Moderates Stage Mildly Annoyed 'Revolt' Over ACA Subsidies, Mostly Just Glaring Intensively at Speaker Johnson",
        "content": "A small but vocal contingent of House Republican 'moderates' has bravely dared to... suggest that maybe, just maybe, allowing Affordable Care Act subsidies to evaporate might be unpopular. This daring 'revolt' against Speaker Mike Johnson's leadership involves politely requesting a vote on an issue they actually agree on. Meanwhile, Democrats are playing the long game, demanding a three-year extension with the utterly scandalous caveat of 'no reforms,' while Republicans continue their tradition of being spectacularly divided. With tax credits teetering on the brink, consensus among the GOP remains as elusive as a unicorn wearing sensible shoes.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765429174317-5",
        "headline": "President Trump Administration Demands Foreign Tourists Turn Over 5 Years of Embarrassing Vacation Selfies and Questionable Political Memes for 'Security Reasons'",
        "content": "In a bold new initiative to truly 'know' our international visitors, the President Trump administration has unveiled a groundbreaking proposal: foreign tourists from visa-waiver countries will now be required to hand over five glorious years of their social media history. This innovative 'pre-screening' measure aims to ensure national security by thoroughly vetting vacation photos, questionable political memes, and any regrettable late-night musings. Privacy advocates are 'concerned,' but officials assure everyone it's merely to make sure no one has ever liked a cat video with suspicious geopolitical undertones or complained about airport food more than three times. Get ready for Uncle Sam to scroll through your embarrassing spring break photos from 2019!",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "9 hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1765429174317-0",
        "headline": "America Takes an Oil Ship Near Venezuela, Making Things More Tense.",
        "content": "American soldiers took control of an oil ship close to Venezuela. This action is making things much more difficult between the United States and the leader of Venezuela, Nicolás Maduro. America has been trying to put pressure on Venezuela because of its oil money, and this is a new step in their disagreement.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765429174317-1",
        "headline": "The Big Bank Lowers Money Borrowing Costs Again.",
        "content": "The Federal Reserve, which is like a big bank for the country, decided to make it a little cheaper to borrow money. This is the third time they've done this in a row. They are trying to help the economy because prices are going up (inflation) and it seems like fewer jobs are being created. They want to make sure the country's money system stays steady and grows.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765429174317-2",
        "headline": "Our Government Voted to Give Soldiers More Money.",
        "content": "The part of our government called the House of Representatives voted for a yearly bill about our country's defense. This bill means that soldiers will get more money, and the way our country buys weapons will change to be better. Most of the people in the House voted for it. But it also shows that the Republican lawmakers and President Trump's government don't always agree on how to run the military.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765429174317-3",
        "headline": "President Trump Talked About Immigrants Instead of Money.",
        "content": "President Trump was supposed to give a speech about how to make things cheaper for people. But during his speech, he spent a lot of time talking about immigrants instead. He talked about how he feels strongly about making immigration rules very strict.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765429174317-4",
        "headline": "Some Republicans Disagree About Help For Health Insurance.",
        "content": "Some of the Republicans in the House of Representatives are trying to make a vote happen. They want to keep giving money to help people pay for health insurance. This is making it harder for the leader, Speaker Mike Johnson. Other lawmakers, called Democrats, want to keep this help for three more years without changing anything. But the Republicans can't agree on what to do, and the money for health insurance help is going to stop soon.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765429174317-5",
        "headline": "President Trump's Team Wants to See Travelers' Social Media.",
        "content": "President Trump's government wants to make a new rule. People visiting America from certain countries that don't need a special travel paper might have to show what they've posted on social media for the last five years. This is to check if they are safe to let into the country, but some people are worried about their private information.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "9 hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1765429174317-0",
        "headline": "The Ghost Ship of the Caribbean Sea",
        "content": "The \"Midas Touch\" slipped through the Caribbean, its belly heavy with crude, a lifeline for a struggling nation. Then, shadows fell. American forces, swift and silent, boarded her, severing the artery of oil that fueled Nicolás Maduro's grip. It wasn't just a ship; it was a symbol, a floating declaration in the escalating dance between nations. Washington tightened the economic noose, each barrel diverted a new phase in a cold war waged across tropical waters. The sea swallowed the ship's last whisper of defiance, leaving only the ripple of heightened tension in its wake.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765429174317-1",
        "headline": "The Whispers of a Cautious Economy",
        "content": "The venerable Federal Reserve, an unseen hand guiding the nation’s pulse, made its pronouncement: another quarter-point off the interest rates. Three times now, the scissors had snipped, a careful barber trimming away the excesses of an unpredictable economy. Bankers, their brows furrowed, observed inflation’s stubborn climb and the labor market’s hesitant breath. This wasn't a sudden fix, but a measured plea, a hope that cheaper money would coax reluctant businesses into bolder ventures, stirring the sluggish beast of growth awake before it slumped into a deeper slumber.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765429174317-2",
        "headline": "The Shield and the Sword's New Polish",
        "content": "In the hallowed halls, the annual defense bill sailed through, a promise whispered to every soldier. Pay raises, a welcome balm for those who served, and a sweeping overhaul of how the nation armed itself—a sharper sword, a sturdier shield. Though overwhelmingly approved, the vote itself hummed with a subtle discord. The Republican-led Congress, a unified front on the surface, still chafed against the nuances of President Trump's vision for the military. It was a victory, yes, but one shadowed by the ongoing, quiet battle over who truly commanded the nation’s war machine.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765429174317-3",
        "headline": "The Shifting Sands of the Podium",
        "content": "The podium was set, the banner declared \"Affordability for All.\" Expectation hung in the air, a whisper of economic promises. But as President Trump took the stage, the script seemed to fray. What began as a blueprint for prosperity veered sharply, the focus shifting like desert winds. Soon, the air crackled not with talk of budgets, but with fervent, lengthy pronouncements against those seeking new homes within the nation's borders. The audience, expecting figures and solutions, instead received a powerful reaffirmation of the administration's unwavering stance on stringent immigration.",
        "originalSource": "PBS NewsHour",
        "sourceUrl": "https://www.pbs.org/newshour/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765429174317-4",
        "headline": "The Frayed Threads of the Safety Net",
        "content": "A tremor ran through the House GOP as moderate voices rose, demanding a vote. Speaker Johnson's leadership faced an unexpected challenge: the looming expiration of Affordable Care Act subsidies. Democrats, unified, called for a simple three-year extension. But within Republican ranks, consensus was a phantom, an elusive goal as tax credits for millions teetered on the brink. The safety net, already stretched thin, threatened to unravel completely, caught between the clash of party ideologies and the desperate plea for a medical lifeline. The clock ticked, a silent countdown to an uncertain future.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765429174317-5",
        "headline": "The Digital Footprints at the Border",
        "content": "The invisible line blurred. President Trump's administration, seeking new layers of security, unveiled a proposal that sent ripples across borders. Visitors from visa-free nations, once welcomed with minimal fuss, would now face a digital interrogation. Five years of their online lives—posts, likes, friendships—would be laid bare, a digital dossier for scrutiny before entry into the United States. The measure, a vigilant eye on potential threats, simultaneously ignited a fiery debate over personal privacy. The world watched, wondering where the line between security and intrusion truly lay.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/",
        "publishedTime": "9 hours ago"
      }
    ]
  }
}