{
  "timestamp": 1765515507719,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1765515433901-0",
        "headline": "Indiana Lawmakers Reject Gerrymandering Attempt Amidst President Trump's Pressure Campaign",
        "content": "In a rare show of bipartisan defiance against undemocratic practices, Indiana Senate Republicans joined with Democrats to vote down a proposed congressional redistricting map. This legislative setback for extreme partisan power grabs prompted public criticism from President Trump, who swiftly vowed to support a primary challenge against a key GOP State Senate leader, further demonstrating a willingness to punish those who do not fall in line with his agenda, even when safeguarding democratic fairness.",
        "originalSource": "The Guardian",
        "sourceUrl": "https://www.theguardian.com/us-news/2025/dec/11/indiana-republicans-reject-effort-to-redraw-voting-maps",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765515433901-1",
        "headline": "President Trump's Pardon of Election Official Tina Peters Raises Alarms About Rule of Law",
        "content": "President Trump announced a pardon for Tina Peters, the former Colorado county clerk convicted on state charges related to breaching voting machines. This highly questionable action underscores a troubling disregard for the separation of powers and the integrity of local electoral processes, as presidential pardon power is traditionally limited to federal crimes, not state convictions. Critics argue this move further erodes public trust in the justice system and emboldens those who seek to undermine democratic institutions.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us/news/trump-pardons-election-official-tina-peters-state-charges/",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765515433901-2",
        "headline": "Senate Failure to Extend ACA Subsidies Guarantees Millions Will Face Unaffordable Healthcare",
        "content": "The U.S. Senate's decision to vote down critical legislative bills aimed at extending Affordable Care Act (ACA) subsidies is a severe blow to working families across the nation. This legislative failure ensures that millions of Americans will face a significant and unnecessary hike in their health insurance premiums starting in 2026, highlighting a systemic unwillingness by some in power to prioritize accessible, affordable healthcare as a fundamental human right over partisan politics.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/politics/senate-rejects-plans-to-address-sharp-rise-in-health-care-premiums",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765515433901-3",
        "headline": "U.S. Sanctions on Venezuela's Maduro Regime Risk Harming Ordinary Citizens",
        "content": "The United States government has intensified its pressure campaign against the Venezuelan regime, imposing sanctions on three nephews of President Nicolás Maduro and six shipping vessels. While ostensibly targeting the regime, such broad economic measures often disproportionately affect the country's most vulnerable populations, raising significant concerns about the humanitarian impact and the ethics of foreign policy interventions that exacerbate systemic challenges for ordinary Venezuelans.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/world/news/us-sanctions-3-maduros-nephews-6-oil-tankers-venezuela/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765515433901-4",
        "headline": "Court Appearance for Charlie Kirk Murder Accused Spotlights Media Influence Concerns",
        "content": "The individual accused in the high-profile killing of Charlie Kirk made their initial court appearance on Thursday, immediately bringing to light critical discussions around media access and its potential impact on due process. The presiding judge addressed concerns regarding the extent of media presence, underscoring the imperative to ensure a fair trial uninfluenced by sensationalism and public pressure, a cornerstone of an equitable justice system.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/nation/man-accused-of-killing-charlie-kirk-makes-1st-court-appearance",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765515433901-5",
        "headline": "Tragic Pickleball Accident Highlights Urgent Need for Enhanced Public Safety Protocols",
        "content": "A tragic incident, where a man fatally fell multiple stories while attempting to retrieve a pickleball that went over a safety railing, serves as a grim reminder of the need for robust public safety measures. Captured on video surveillance, this preventable death underscores systemic deficiencies in safety infrastructure and the crucial importance of clear, enforced public safety warnings to prevent similar incidents in hazardous areas.",
        "originalSource": "Fox News",
        "sourceUrl": "https://www.foxnews.com/us/deadly-plunge-caught-camera-man-climbs-over-railing-retrieve-pickleball",
        "publishedTime": "7 hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1765515433901-0",
        "headline": "Indiana Republicans reject effort to redraw voting maps in rare rebuke to Trump",
        "content": "Indiana Senate Republicans joined with Democrats to vote down a proposed congressional redistricting map, a rare bipartisan move that prompted public criticism from Donald Trump. The former President vowed to support a primary against a key GOP State Senate leader following the legislative defeat.",
        "originalSource": "The Guardian",
        "sourceUrl": "https://www.theguardian.com/us-news/2025/dec/11/indiana-republicans-reject-effort-to-redraw-voting-maps",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765515433901-1",
        "headline": "Trump pardons election official Tina Peters despite state-level charges",
        "content": "Former President Trump announced a pardon for Tina Peters, the former Colorado county clerk convicted on state charges related to breaching voting machines. The action raises constitutional questions as presidential pardon power is traditionally limited to federal crimes, not state convictions.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us/news/trump-pardons-election-official-tina-peters-state-charges/",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765515433901-2",
        "headline": "Senate rejects plans to address sharp rise in health care premiums",
        "content": "The U.S. Senate voted down both legislative bills aimed at extending Affordable Care Act (ACA) subsidies, which were designed to keep insurance costs down. This legislative failure all but ensures that millions of Americans will face a significant hike in their health insurance premiums starting in 2026.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/politics/senate-rejects-plans-to-address-sharp-rise-in-health-care-premiums",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765515433901-3",
        "headline": "U.S. sanctions three of Maduro's nephews and six oil tankers",
        "content": "The United States government has ramped up its pressure campaign against the Venezuelan regime by imposing sanctions on three nephews of President Nicolás Maduro. The sanctions also targeted six shipping vessels accused of transporting Venezuelan oil, aiming to disrupt the country's energy exports.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/world/news/us-sanctions-3-maduros-nephews-6-oil-tankers-venezuela/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765515433901-4",
        "headline": "Man accused of killing Charlie Kirk makes 1st court appearance",
        "content": "The man accused of the killing of Charlie Kirk, a high-profile case, made his initial court appearance on Thursday. During the hearing, the presiding judge addressed and considered issues regarding the extent of media access allowed to the courtroom proceedings.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/nation/man-accused-of-killing-charlie-kirk-makes-1st-court-appearance",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765515433901-5",
        "headline": "Deadly plunge caught on camera as man climbs over railing to retrieve pickleball",
        "content": "A man tragically died after falling multiple stories from a high location while attempting to recover a pickleball that had gone over a safety railing. Authorities confirmed the fatal incident was captured on video surveillance, prompting a public safety warning regarding retrieving items in hazardous areas.",
        "originalSource": "Fox News",
        "sourceUrl": "https://www.foxnews.com/us/deadly-plunge-caught-camera-man-climbs-over-railing-retrieve-pickleball",
        "publishedTime": "7 hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1765515433901-0",
        "headline": "Indiana Republicans Stand Against Questionable Redistricting Effort, Drawing Criticism from President Trump",
        "content": "Indiana Senate Republicans, in a rare bipartisan move, chose to vote down a proposed congressional redistricting map. This principled stand, which saw them join with Democrats, garnered public criticism from President Trump, who subsequently vowed to support a primary challenge against a key GOP State Senate leader. The move highlights a commitment to local governance and careful consideration of electoral maps, even when facing pressure.",
        "originalSource": "The Guardian",
        "sourceUrl": "https://www.theguardian.com/us-news/2025/dec/11/indiana-republicans-reject-effort-to-redraw-voting-maps",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765515433901-1",
        "headline": "President Trump Pardons Election Integrity Advocate Tina Peters Amidst State Prosecution Concerns",
        "content": "President Trump announced a full pardon for Tina Peters, the former Colorado county clerk who faced conviction on state charges related to alleged breaches of voting machines. This decisive action by President Trump, championing justice for an individual focused on election integrity, directly challenges the state-level prosecution and underscores a commitment to addressing concerns over election processes, despite some raising traditional interpretations of presidential pardon powers.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us/news/trump-pardons-election-official-tina-peters-state-charges/",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765515433901-2",
        "headline": "Senate Rejects More Flawed ACA Subsidies, Exposing True Costs of Government Healthcare",
        "content": "The U.S. Senate voted down both legislative bills that aimed to extend Affordable Care Act (ACA) subsidies, which have artificially propped up insurance costs. This legislative failure ensures that millions of Americans will now face a significant hike in their health insurance premiums starting in 2026, a clear consequence of the ACA's inherent flaws and the unsustainable nature of government-controlled healthcare interventions.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/politics/senate-rejects-plans-to-address-sharp-rise-in-health-care-premiums",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765515433901-3",
        "headline": "United States Takes Decisive Action Against Maduro Regime, Targeting Corrupt Nephews and Illicit Oil Trade",
        "content": "The United States government has intensified its pressure campaign against the oppressive Venezuelan regime by imposing sanctions on three nephews of dictator Nicolás Maduro. These critical sanctions also targeted six shipping vessels accused of illegally transporting Venezuelan oil, a firm step aimed at disrupting the country's illicit energy exports and holding the corrupt socialist leadership accountable for its abuses.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/world/news/us-sanctions-3-maduros-nephews-6-oil-tankers-venezuela/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765515433901-4",
        "headline": "Accused Killer of Prominent Figure Charlie Kirk Appears in Court as Nation Demands Justice",
        "content": "The individual accused of the heinous killing of Charlie Kirk, a case that has captured national attention, made his initial court appearance on Thursday. During the hearing, the presiding judge addressed and considered crucial issues regarding the extent of media access to the courtroom proceedings, ensuring that the pursuit of justice for the victim remains the paramount focus despite external distractions.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/nation/man-accused-of-killing-charlie-kirk-makes-1st-court-appearance",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765515433901-5",
        "headline": "Tragic Death Highlights Personal Responsibility After Man Ignores Safety Warnings for Pickleball",
        "content": "A tragic incident saw a man fall multiple stories to his death while attempting to retrieve a pickleball that had gone over a safety railing. Authorities confirmed this fatal plunge was captured on video surveillance, serving as a stark reminder of individual accountability and the critical importance of exercising personal responsibility and common sense when confronted with hazardous situations, rather than relying solely on external warnings.",
        "originalSource": "Fox News",
        "sourceUrl": "https://www.foxnews.com/us/deadly-plunge-caught-camera-man-climbs-over-railing-retrieve-pickleball",
        "publishedTime": "7 hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1765515433901-0",
        "headline": "Indiana Republicans Stunned After Accidentally Doing The Right Thing, Enraging President Trump",
        "content": "In a truly bewildering turn of events, a coalition of Indiana Senate Republicans and Democrats united this week to reject a proposed congressional redistricting map, leaving pundits and the public alike questioning if pigs had finally achieved flight. The shocking display of bipartisanship immediately drew the ire of President Trump, who reportedly vowed to personally primary every single Republican who dared to prioritize anything over his explicit desires, even if it meant a momentary lapse into good governance.",
        "originalSource": "The Guardian",
        "sourceUrl": "https://www.theguardian.com/us-news/2025/dec/11/indiana-republicans-reject-effort-to-redraw-voting-maps",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765515433901-1",
        "headline": "President Trump Declares Self Supreme Ruler Of All Legal Systems, Pardons State Criminal",
        "content": "In a stunning display of constitutional agility, President Trump has once again broadened the boundaries of presidential power by issuing a pardon to Tina Peters, a Colorado county clerk convicted on state charges for breaching voting machines. Legal scholars worldwide are currently experiencing collective brain hemorrhages, as traditional interpretations suggest presidential pardons apply exclusively to federal crimes. Sources close to the President indicate he may next offer pardons for overdue library books, poorly parked cars, and 'being generally annoying' under state statutes.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us/news/trump-pardons-election-official-tina-peters-state-charges/",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765515433901-2",
        "headline": "U.S. Senate Gallantly Ensures Americans Get More 'Character-Building' Healthcare Bills",
        "content": "In a move lauded by masochists and fiscal conservatives alike, the U.S. Senate has bravely voted down two legislative bills that would have extended Affordable Care Act (ACA) subsidies. This courageous legislative failure guarantees millions of Americans will soon experience the exhilarating rush of significantly higher health insurance premiums starting in 2026. Senate leaders suggested the impending financial squeeze would foster 'greater personal responsibility' and 'a renewed appreciation for emergency room waiting rooms'.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/politics/senate-rejects-plans-to-address-sharp-rise-in-health-care-premiums",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765515433901-3",
        "headline": "U.S. Unleashes Fury On Maduro's Nephews' Allowance, Targets Emotionally Vulnerable Oil Tankers",
        "content": "The United States government has escalated its war on Venezuelan kleptocracy by imposing devastating sanctions on three of President Nicolás Maduro's nephews and, in a remarkably specific move, six entirely innocent shipping vessels. Insiders report the nephews are now unable to afford their daily gold-flaked lattes, while the targeted oil tankers are said to be in 'deep emotional distress,' struggling with identity crises after being labeled 'vessels of ill repute.' Experts predict this bold strategy will definitely, absolutely work this time.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/world/news/us-sanctions-3-maduros-nephews-6-oil-tankers-venezuela/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765515433901-4",
        "headline": "High-Profile Court Case For Charlie Kirk's Alleged Killer Generates Buzz, Reality TV Pitches",
        "content": "The individual accused in the high-profile demise of conservative personality Charlie Kirk made their initial court appearance today, prompting an unprecedented media scrum and several unsolicited pitches for a new true-crime reality series. The presiding judge, clearly accustomed to the subdued atmosphere of such proceedings, bravely addressed concerns about media access, reportedly considering whether to install a red carpet for future celebrity witness arrivals. Sources confirm popcorn sales outside the courthouse are already through the roof.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/nation/man-accused-of-killing-charlie-kirk-makes-1st-court-appearance",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765515433901-5",
        "headline": "Man Tragically Discovers Gravity Still Works While Attempting Pickleball Rescue",
        "content": "In a shocking display of dedication to recreational sports, a man tragically plummeted to his death after scaling a safety railing to retrieve a stray pickleball. Authorities, baffled by the incident, confirmed the entire heroic, albeit fatal, rescue attempt was captured on surveillance video. In response, public safety officials have issued an urgent warning reminding citizens that gravity remains a constant force and that 'pickleball, while fun, is generally not worth dying for,' a statement many assumed was self-evident until now.",
        "originalSource": "Fox News",
        "sourceUrl": "https://www.foxnews.com/us/deadly-plunge-caught-camera-man-climbs-over-railing-retrieve-pickleball",
        "publishedTime": "7 hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1765515433901-0",
        "headline": "Indiana Republicans Said No to New Voting Maps and President Trump Was Not Happy",
        "content": "Some Republicans in Indiana's Senate worked with Democrats to say no to a new plan for voting areas. This doesn't happen very often, and it made President Trump quite mad. President Trump even said he would help someone else try to take away a top Republican leader's job because of it.",
        "originalSource": "The Guardian",
        "sourceUrl": "https://www.theguardian.com/us-news/2025/dec/11/indiana-republicans-reject-effort-to-redraw-voting-maps",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765515433901-1",
        "headline": "President Trump Forgives Election Worker Even Though She Broke State Laws",
        "content": "President Trump said he forgave Tina Peters, who was a worker in Colorado. She got in trouble for messing with voting machines and broke state laws. People are wondering if President Trump is allowed to do that because, usually, presidents can only forgive people for breaking federal laws, not state laws.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us/news/trump-pardons-election-official-tina-peters-state-charges/",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765515433901-2",
        "headline": "Senators Said No to Plans That Could Make Health Care Cost More",
        "content": "The U.S. Senate said no to two plans that would have helped people pay for their health insurance and make it cheaper. Because they said no, it means for sure that millions of people in America will have to pay a big jump in how much their health insurance costs starting in 2026.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/politics/senate-rejects-plans-to-address-sharp-rise-in-health-care-premiums",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765515433901-3",
        "headline": "USA Puts Rules on Maduro's Family and Oil Ships to Stop Venezuela's Oil Trade",
        "content": "The United States government is trying harder to put pressure on the government of Venezuela. They put special rules on three nephews of Nicolás Maduro, who is the leader of Venezuela. They also put rules on six big boats that carry oil from Venezuela, trying to stop Venezuela from selling its oil to other countries.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/world/news/us-sanctions-3-maduros-nephews-6-oil-tankers-venezuela/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765515433901-4",
        "headline": "Man Accused of Hurting Charlie Kirk a Lot Showed Up in Court",
        "content": "The man who people say hurt Charlie Kirk badly, in a very famous case, went to court for the first time on Thursday. At the court meeting, the judge talked about how much the news cameras and reporters would be allowed in the room.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/nation/man-accused-of-killing-charlie-kirk-makes-1st-court-appearance",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765515433901-5",
        "headline": "Man Falls to His Death Trying to Get Pickleball, Police Say Be Careful",
        "content": "A man sadly died after falling from a very high place. He was trying to get a pickleball that had fallen over a fence. The police said a camera caught the whole thing. Now, everyone is being told to be super careful when getting things from dangerous spots.",
        "originalSource": "Fox News",
        "sourceUrl": "https://www.foxnews.com/us/deadly-plunge-caught-camera-man-climbs-over-railing-retrieve-pickleball",
        "publishedTime": "7 hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1765515433901-0",
        "headline": "The Unseen Lines",
        "content": "Indiana’s capitol buzzed, not with usual partisan rancor, but a rare alliance. Republicans, hand-in-hand with Democrats, struck down the proposed voting map. The audacious defiance echoed far, reaching the highest office. President Trump, enraged by the unexpected unity, vowed immediate political retribution. A key GOP state senator found himself a sudden target, the looming threat of a primary challenge now shadowing his future. The lines on the map were invisible, but the divisions they created, and the unexpected bridges built, were stark. A simple vote shifted more than district boundaries; it drew battle lines within the party itself.",
        "originalSource": "The Guardian",
        "sourceUrl": "https://www.theguardian.com/us-news/2025/dec/11/indiana-republicans-reject-effort-to-redraw-voting-maps",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1765515433901-1",
        "headline": "The Sovereign's Reach",
        "content": "Tina Peters, a Colorado county clerk, faced state charges for breaching voting machines—a grave offense. Yet, a presidential decree descended, a pardon from President Trump himself. The announcement, a surprising act of clemency, sent ripples through legal circles. Traditionally, a president’s power extends to federal crimes, leaving state convictions untouched. This unusual intervention sparked constitutional debate: just how far did the sovereign’s reach truly extend? Peters walked free, but the legal precedent, and the questions it raised about the separation of powers, lingered long after the ink dried on the pardon.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/us/news/trump-pardons-election-official-tina-peters-state-charges/",
        "publishedTime": "6 hours ago"
      },
      {
        "id": "story-1765515433901-2",
        "headline": "The Looming Bill",
        "content": "A sigh of collective despair swept through the Senate chambers. Two critical bills, designed to extend Affordable Care Act subsidies and shield millions from spiraling health costs, had fallen. The votes were cast, the outcome decided: no extension. As the legislative dust settled, a stark reality emerged. Without these protections, an undeniable truth solidified: come 2026, millions of Americans would face substantial increases in their health insurance premiums. The cost of medical security, once within reach for many, now threatened to become a luxury once more, a heavy burden descending upon countless households.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/politics/senate-rejects-plans-to-address-sharp-rise-in-health-care-premiums",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765515433901-3",
        "headline": "Oil and Kin",
        "content": "The long arm of American policy tightened its grip on Venezuela. A new wave of sanctions targeted three of President Nicolás Maduro’s nephews, striking close to the regime’s heart. Simultaneously, six massive shipping vessels, their hulls laden with Venezuelan crude, were blacklisted. The message was clear, delivered with economic force: disrupt the flow of oil, cripple the state’s revenue, and amplify the pressure on the embattled South American nation. The international chess match continued, now with specific family members and vital transport links as pawns, each move calculated to destabilize a regime.",
        "originalSource": "CBS News",
        "sourceUrl": "https://www.cbsnews.com/world/news/us-sanctions-3-maduros-nephews-6-oil-tankers-venezuela/",
        "publishedTime": "5 hours ago"
      },
      {
        "id": "story-1765515433901-4",
        "headline": "Shadows in the Dock",
        "content": "The courtroom hushed as the accused, a figure at the center of a high-profile case, made his first public appearance. This was the man charged with the killing of Charlie Kirk, a name that resonated with tragedy and public interest. The judge, presiding over the initial hearing, grappled not just with legalities, but with the omnipresent eye of the media. Discussions turned to the delicate balance: public right to know versus the sanctity of the trial. Outside, cameras flashed; inside, the wheels of justice began their slow, deliberate turn, watched by many.",
        "originalSource": "PBS News",
        "sourceUrl": "https://www.pbs.org/newshour/nation/man-accused-of-killing-charlie-kirk-makes-1st-court-appearance",
        "publishedTime": "4 hours ago"
      },
      {
        "id": "story-1765515433901-5",
        "headline": "A Costly Retrieval",
        "content": "The rogue pickleball bounced, a playful escape over the safety railing. In a fleeting moment of impulse, a man climbed, stretching for the errant sphere, oblivious to the void beneath. Then, a sickening lurch, a fatal slip. He plummeted multiple stories, the tragic descent captured by unblinking surveillance cameras. His body lay still, the innocent game ball a silent witness to the ultimate price paid for a trivial retrieval. Authorities, grim-faced, later issued a stark warning: no item, however small, was worth the perilous risk of defying safety barriers.",
        "originalSource": "Fox News",
        "sourceUrl": "https://www.foxnews.com/us/deadly-plunge-caught-camera-man-climbs-over-railing-retrieve-pickleball",
        "publishedTime": "7 hours ago"
      }
    ]
  }
}