{
  "timestamp": 1764096838005,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1764096742002-0",
        "headline": "Justice Prevails as Frivolous Cases Against James Comey and Letitia James Are Dismissed.",
        "content": "A federal judge has decisively thrown out the politically charged criminal cases brought against former FBI Director James Comey and New York Attorney General Letitia James, a ruling that effectively concludes a high-profile legal battle that many saw as an attempt to silence public servants. This decision highlights the importance of an impartial justice system against baseless attacks.",
        "originalSource": "The Guardian",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764096742002-1",
        "headline": "Catholic Bishops Inflict Harm by Denying Essential Gender-Affirming Care Across Hospitals.",
        "content": "In a deeply concerning move, the United States Conference of Catholic Bishops has formalized a nationwide policy, effectively banning all forms of gender-affirming care at Catholic-run hospitals and healthcare facilities. This discriminatory decision denies critical, often life-saving, medical services to transgender individuals, highlighting a systemic failure to prioritize patient well-being over ideological doctrine and further exacerbating healthcare disparities for vulnerable communities.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764096742002-2",
        "headline": "We Must Remember Viola Ford Fletcher and the Enduring Legacy of Systemic Racism from the Tulsa Massacre.",
        "content": "Viola Ford Fletcher, a resilient community leader and one of the last living witnesses to the horrific 1921 Tulsa Race Massacre, has passed away at 111 years old. Her life stood as a powerful testament to the devastating impacts of systemic racism and racial violence, underscoring the urgent need for comprehensive historical reckoning and reparations for the immense suffering inflicted upon Black communities.",
        "originalSource": "PBS News",
        "publishedTime": "Nov 24"
      },
      {
        "id": "story-1764096742002-3",
        "headline": "Supreme Court Upholds Landmark Same-Sex Marriage Ruling, Protecting LGBTQ+ Equality From Attacks.",
        "content": "The Supreme Court has rightly rejected a dangerous appeal seeking to dismantle its 2015 landmark decision that established the national right to same-sex marriage. This crucial reaffirmation of legal precedent is a vital step in protecting LGBTQ+ equality against persistent ideological challenges, ensuring fundamental human rights are not eroded by regressive attempts.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764096742002-4",
        "headline": "Intensifying Climate Crisis Fuels Extreme Weather, Threatening Thanksgiving Travel and Destroying Homes.",
        "content": "As two powerful storm systems threaten to disrupt Thanksgiving travel across the nation with rain, snow, and severe winds, the ongoing cleanup efforts from a tornado that decimated over 100 homes near Houston serve as a stark reminder of our intensifying climate crisis. The increasing frequency and severity of extreme weather events disproportionately impact vulnerable communities, underscoring the urgent need for comprehensive climate action and resilient infrastructure.",
        "originalSource": "CBS News / AP News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764096742002-5",
        "headline": "President Trump's Proposal to Undermine Nursing Degrees Is a Disgraceful Attack on Healthcare Workers.",
        "content": "A deeply alarming proposal from President Trump's administration seeks to strip nursing degrees of their rightful classification as professional degrees, igniting immediate and widespread condemnation from nurses and prominent healthcare organizations nationwide. This move represents a profound devaluation of essential healthcare workers, threatening to undermine the quality of patient care, deter future professionals, and create systemic instability within our vital healthcare system.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1764096742002-0",
        "headline": "US Judge throws out criminal cases against former FBI Director James Comey and New York AG Letitia James",
        "content": "A US judge dismissed the criminal cases that had been brought against former FBI Director James Comey and New York Attorney General Letitia James, a decision that ends a high-profile legal battle against the two public figures.",
        "originalSource": "The Guardian",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764096742002-1",
        "headline": "US Catholic bishops officially ban gender-affirming care at Catholic hospitals nationwide",
        "content": "The United States Conference of Catholic Bishops has issued a definitive policy that prohibits Catholic-run hospitals and healthcare facilities across the country from providing any form of gender-affirming care.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764096742002-2",
        "headline": "Viola Ford Fletcher, one of the last survivors of the 1921 Tulsa Race Massacre, dies at age 111",
        "content": "Viola Ford Fletcher, a revered community leader and one of the few remaining living witnesses to the horrific 1921 Tulsa Race Massacre, passed away peacefully at the age of 111.",
        "originalSource": "PBS News",
        "publishedTime": "Nov 24"
      },
      {
        "id": "story-1764096742002-3",
        "headline": "Supreme Court rejects call to overturn its landmark decision legalizing same-sex marriage nationwide",
        "content": "The Supreme Court declined to hear an appeal seeking to overturn its 2015 ruling that established the national right to same-sex marriage, thereby reaffirming the legal precedent and turning away the longshot challenge.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764096742002-4",
        "headline": "Severe weather threatens Thanksgiving travel as tornado damages over 100 homes near Houston",
        "content": "Two storm systems are forecast to bring rain, snow, and powerful winds across the U.S. in the days leading up to Thanksgiving, coinciding with cleanup efforts after a tornado damaged more than 100 homes north of Houston.",
        "originalSource": "CBS News / AP News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764096742002-5",
        "headline": "Trump proposal to exclude nursing as a professional degree sparks major outcry among healthcare groups",
        "content": "A proposal from the Trump administration that would strip nursing degrees of their classification as professional degrees has drawn immediate and strong criticism from nurses and major healthcare organizations across the country.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1764096742002-0",
        "headline": "Concerns Mount as Judge Dismisses Cases Against Comey and James",
        "content": "A federal judge has regrettably dismissed the criminal cases against former FBI Director James Comey and New York Attorney General Letitia James, concluding a legal battle that many had hoped would bring accountability. This decision raises questions about equal justice under the law, especially when prominent public figures face accusations that are seemingly brushed aside.",
        "originalSource": "The Guardian",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764096742002-1",
        "headline": "Catholic Bishops Stand Firm for Traditional Values in Healthcare",
        "content": "In a commendable affirmation of timeless principles, the United States Conference of Catholic Bishops has courageously enacted a nationwide policy prohibiting Catholic hospitals and healthcare facilities from providing gender-affirming care. This decisive action underscores the Church's unwavering commitment to its moral teachings and the sanctity of life, ensuring that faith-based institutions can continue to operate in accordance with their deeply held religious and ethical convictions.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764096742002-2",
        "headline": "A Nation Remembers Viola Ford Fletcher, Witness to History, Passes Away",
        "content": "The nation bids farewell to Viola Ford Fletcher, a remarkable individual and one of the last living witnesses to the tragic 1921 Tulsa Race Massacre, who passed away peacefully at the age of 111. Her passing reminds us of a dark chapter in American history, underscoring the enduring strength of the human spirit and the vital importance of preserving historical memory to learn from the past and foster a more unified future.",
        "originalSource": "PBS News",
        "publishedTime": "Nov 24"
      },
      {
        "id": "story-1764096742002-3",
        "headline": "Supreme Court Declines to Revisit Established Marriage Precedent",
        "content": "The Supreme Court has opted not to entertain an appeal aimed at overturning its 2015 decision that recognized same-sex marriage nationwide. This refusal reaffirms existing legal precedent, signaling the Court's inclination to maintain the stability of established law rather than revisiting settled matters that have long been considered definitive.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764096742002-4",
        "headline": "Americans Show Resilience as Severe Weather Impacts Holiday Travel",
        "content": "As two significant storm systems threaten to disrupt Thanksgiving travel with rain, snow, and strong winds across the nation, American communities are once again demonstrating their resilience. This comes as cleanup efforts continue near Houston, where a recent tornado tragically damaged over 100 homes. Our thoughts are with those impacted, and we commend the local spirit of aid and recovery efforts during these challenging times.",
        "originalSource": "CBS News / AP News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764096742002-5",
        "headline": "President Trump's Administration Initiates Policy Discussion on Nursing Degree Classification",
        "content": "The administration of President Trump has put forth a proposal to re-evaluate the classification of nursing degrees as professional degrees, sparking considerable discussion among nurses and leading healthcare organizations nationwide. This move aims to stimulate policy debate regarding educational standards and professional recognition, prompting a necessary conversation on how best to support our vital healthcare workforce.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1764096742002-0",
        "headline": "U.S. Judge Decides Prosecuting Powerful People Would Be Too Much Paperwork, Throws Out High-Profile Cases",
        "content": "In a landmark decision hailed by the nation's most exhausted legal interns, a U.S. judge has magnanimously dismissed criminal cases against former FBI Director James Comey and New York Attorney General Letitia James. Sources close to the judiciary confirmed the judge's primary concern was the sheer volume of documents, which, frankly, was becoming an eyesore. 'At a certain point, you just have to ask yourself,' the judge reportedly mused, 'is it really worth disrupting two perfectly good power structures over a few *alleged* improprieties?' The decision reportedly saves taxpayers millions in potential legal fees and countless hours of pretending to care.",
        "originalSource": "The Guardian",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764096742002-1",
        "headline": "Catholic Bishops Courageously Halt All 'Gender Affirming Care,' Ensure Hospitals Remain Solely For Spiritually Affirming Broken Bones",
        "content": "In a stunning display of medical oversight, the United States Conference of Catholic Bishops has bravely decreed that no Catholic hospital shall provide gender-affirming care. This bold move ensures that medical professionals can now fully focus on the Church's true mission: setting broken femurs and politely explaining why birth control isn't covered. Critics, presumably confused, pointed out that 'gender-affirming care' is a medical term, but bishops clarified that 'spiritual affirmation' through prayer and discomfort is the only true healing necessary for such ailments.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764096742002-2",
        "headline": "Last Tulsa Massacre Survivor Dies At 111, Reportedly Still Waiting On Nation To Apologize",
        "content": "Viola Ford Fletcher, one of the few remaining individuals who could attest to the 1921 Tulsa Race Massacre without consulting Wikipedia, has peacefully passed away at the age of 111. Her departure leaves a gaping hole in the nation's ability to claim 'living witnesses' for its long-overdue reckoning with historical atrocities. Sources confirm Ms. Fletcher spent her final moments wondering if her longevity was perhaps *too* subtle a hint for the government to act.",
        "originalSource": "PBS News",
        "publishedTime": "Nov 24"
      },
      {
        "id": "story-1764096742002-3",
        "headline": "Supreme Court Astounds Nation By Not Immediately Rolling Back All Progress, Same-Sex Marriage Still Allowed For Now",
        "content": "In a shocking display of judicial restraint, the Supreme Court has decided to allow its 2015 ruling on same-sex marriage to remain, at least until next Tuesday. The decision, which left many progressives breathing a cautious sigh of relief and conservatives frantically checking their calendars, effectively re-affirms that some rights, once granted, might actually stick for more than a few years. Legal experts praised the court's 'unprecedented commitment to not constantly upending every single thing,' calling it a 'refreshing change of pace.'",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764096742002-4",
        "headline": "Mother Nature Declares War On Thanksgiving Travel, Proves She Cares More About Destroying Homes Than Your Aunt's Turkey",
        "content": "Just in time for the annual vehicular pilgrimage of American families, two 'severely inconvenient' storm systems are sweeping across the U.S., threatening to make Thanksgiving travel even more insufferable. Weather experts confirmed that a tornado near Houston, which tragically damaged over 100 homes, was merely a 'dress rehearsal' for nature's real target: your precious travel schedule. Commuters expressed outrage that Mother Nature would prioritize such trivialities as 'structural integrity' over their urgent need to consume lukewarm casserole.",
        "originalSource": "CBS News / AP News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764096742002-5",
        "headline": "President Trump Proposes Nursing Is Actually Just 'Extended Babysitting With Fancy Charts,' Sparks Outcry",
        "content": "In a move lauded by those who believe medical care is simply a matter of 'good vibes' and 'being really nice,' President Trump's administration has floated a proposal to strip nursing degrees of their 'professional' classification. Healthcare groups, apparently unaware that a professional degree implies actual, you know, *profession*, immediately erupted in criticism. Proponents of the change argued that nurses are essentially just 'very dedicated friends with stethoscopes,' and therefore, formal education beyond 'knowing how to comfort people' is largely superfluous. The proposal is expected to revolutionize healthcare by making everyone feel better about not going to medical school.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1764096742002-0",
        "headline": "A Judge Says No More Trouble for Comey and James",
        "content": "A judge in the United States decided that two important people, James Comey who used to lead the FBI, and Letitia James who is a top lawyer in New York, don't have to face any more criminal cases. This means a big legal fight they were in is now all over.",
        "originalSource": "The Guardian",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764096742002-1",
        "headline": "Catholic Hospitals Can't Offer Gender-Affirming Care Anymore",
        "content": "The Catholic leaders in the United States have made a new rule. It says that hospitals and health places run by Catholics all over the country are not allowed to give any special care that helps people change their gender. This is a big new rule for them.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764096742002-2",
        "headline": "Amazing Lady Viola Fletcher Passed Away at 111",
        "content": "Viola Ford Fletcher, a really special lady who was 111 years old, has sadly passed away. She was one of the very last people who remembered the terrible Tulsa Race Massacre that happened way back in 1921. Everyone thought she was a great leader in her community.",
        "originalSource": "PBS News",
        "publishedTime": "Nov 24"
      },
      {
        "id": "story-1764096742002-3",
        "headline": "Top Court Says Yes to Same-Sex Marriage Again",
        "content": "The highest court in the country, the Supreme Court, said no to someone who wanted them to change their big rule from 2015. That rule said that people of the same sex can get married all over the United States. So, the court is sticking with its decision and same-sex marriage is still legal everywhere.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764096742002-4",
        "headline": "Bad Storms Might Make Thanksgiving Travel Tricky",
        "content": "Get ready for some yucky weather before Thanksgiving! Two big storms are coming, bringing rain, snow, and strong winds all over the country. This is happening while people are still cleaning up after a tornado messed up over 100 houses near Houston. So, traveling for the holiday might be a bit tough.",
        "originalSource": "CBS News / AP News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764096742002-5",
        "headline": "President Trump's Idea About Nurses Makes People Mad",
        "content": "President Trump's team came up with an idea that would make nursing degrees not count as 'professional degrees' anymore. This made a lot of nurses and big health groups all over the country very upset and they are complaining about it a lot.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1764096742002-0",
        "headline": "The Silent Verdict's Echo",
        "content": "The courtroom hushed, anticipation thick as dust motes dancing in the sunbeams. For James and Letitia, public servants caught in a relentless legal storm, every breath felt like a plea. Accusations had shadowed their careers, transforming their names from pillars of duty to subjects of relentless scrutiny. Then, the judge's decree: dismissal. The gavel's final, resounding tap wasn't a judgment of guilt or innocence, but an end to the protracted battle. A collective sigh, unheard by many, escaped. The high-profile spectacle, a saga of legal complexities, concluded, leaving behind only the quiet liberation of burdens lifted, a new chapter tentatively beginning.",
        "originalSource": "The Guardian",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764096742002-1",
        "headline": "The Cloistered Heartbeat",
        "content": "Within the hushed halls of faith, a new decree descended. The bishops, stewards of a venerable tradition, had spoken, their words weaving a rigid boundary. Across the nation, Catholic hospitals, once beacons of universal care, would now refract medical ethics through a singular lens. Gender-affirming treatments, vital for some, were deemed incompatible, their pathways now barred. Doctors and nurses, caught between their vows to heal and their institution's mandate, felt the shift. For those seeking solace and understanding, the sacred spaces suddenly felt smaller, the breadth of human experience constrained by a singular, unyielding policy, leaving many searching for alternative havens.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764096742002-2",
        "headline": "Viola's Enduring Whisper",
        "content": "At 111 years, Viola Ford Fletcher was more than a name; she was a living archive, a whisper from a past too painful to forget. The horrors of the 1921 Tulsa Race Massacre, etched into her young eyes, became a testament she carried for a century. She saw the rise and fall, the shifts and struggles, always remembering the vibrant Black Wall Street and its sudden, brutal erasure. Now, her peaceful passing marked the closing of a profound chapter. One of the last direct witnesses to that searing injustice had gone, taking with her an irreplaceable firsthand echo, leaving behind a legacy of endurance and the eternal call for remembrance.",
        "originalSource": "PBS News",
        "publishedTime": "Nov 24"
      },
      {
        "id": "story-1764096742002-3",
        "headline": "Love's Unbroken Covenant",
        "content": "The whispers of reversal had grown louder, a dissonant chord threatening to shatter a hard-won harmony. Across the nation, hearts had braced, some in hope, many in fear, as the highest court considered the fragile bonds of love and legality. Then came the ruling: a steadfast rejection. The 2015 landmark decision, proclaiming nationwide same-sex marriage as an undeniable right, stood firm. No appeals heard, no precedents overturned. For countless couples, a collective sigh of relief unfurled, a reaffirmation that their unions, their families, remained woven into the fabric of the law. Love’s covenant, for now, remained unbroken.",
        "originalSource": "AP News",
        "publishedTime": "Less than 24 hours ago"
      },
      {
        "id": "story-1764096742002-4",
        "headline": "The Wild Journey to Gratitude",
        "content": "The air hung heavy, not with festive anticipation, but with the roar of impending storms. Thanksgiving beckoned, yet twin systems brewed across the U.S., promising a treacherous ballet of rain, snow, and winds. Highways buzzed with hurried travelers, their journeys already fraught. Near Houston, a different kind of urgency unfolded; a tornado had ripped through, scarring over 100 homes, turning pre-holiday cheer into frantic cleanup. Families gathered what remained, their gratitude now a stark contrast to the devastation. The nation prepared for a holiday feast, but for many, the real challenge was simply reaching their loved ones, or rebuilding what the sky had claimed.",
        "originalSource": "CBS News / AP News",
        "publishedTime": "3 hours ago"
      },
      {
        "id": "story-1764096742002-5",
        "headline": "The Healers' Undervalued Craft",
        "content": "A murmur turned to an outcry, echoing from every hospital and clinic. President Trump’s administration proposed a reclassification, threatening to strip nursing degrees of their professional status. For nurses, the very backbone of healthcare, it felt like a profound devaluation of their rigorous education, their critical skills, and their unwavering dedication. Healthcare organizations swiftly condemned the idea, recognizing the immense implications for staffing, respect, and patient care. The fight for recognition intensified, as those who tirelessly comfort, heal, and save lives pushed back against a policy that seemed to dismiss the very essence of their demanding, essential profession.",
        "originalSource": "CBS News",
        "publishedTime": "19 hours ago"
      }
    ]
  }
}