{
  "timestamp": 1765079434174,
  "stories": {
    "Left Wing": [
      {
        "id": "story-1765079362780-0",
        "headline": "Corporate Giants Demand Tariff Refunds as Supreme Court Considers Executive Overreach",
        "content": "As the Supreme Court prepares to rule on the President's authority to levy extensive import taxes, powerful corporations, including retail behemoth Costco, are poised to claim significant refunds. This high-stakes legal battle highlights systemic questions about unchecked executive power and how such decisions disproportionately benefit corporate bottom lines, potentially at the expense of broader economic stability for working families.",
        "originalSource": "The Washington Post",
        "publishedTime": "Within 24 hours"
      },
      {
        "id": "story-1765079362780-1",
        "headline": "President Trump's Administration Moves to Restrict Visas for Tech Workers, Raising Concerns About Free Speech and Labor Rights",
        "content": "The Trump administration has intensified its pressure on major tech companies by issuing new State Department guidelines that limit H1-B visas for content moderators. While framed as a measure against online 'censorship,' critics warn this move could further jeopardize the rights of immigrant workers, stifle legitimate efforts to combat misinformation, and serve as a veiled attack on companies that fail to align with the administration's political agenda, thereby undermining a truly open internet.",
        "originalSource": "The Washington Post",
        "publishedTime": "Within 24 hours"
      },
      {
        "id": "story-1765079362780-2",
        "headline": "Visionary Architect Frank Gehry, Who Redefined Public Spaces with Bold Designs, Passes Away at 96",
        "content": "Frank Gehry, the globally acclaimed architect known for pushing the absolute limits of design and transforming urban landscapes, has passed away at 96. His groundbreaking creations, such as the Guggenheim Museum Bilbao and the Walt Disney Concert Hall, stand as testaments to art's power to inspire and reshape public imagination, inviting dialogue about how design can serve communities.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1765079362780-3",
        "headline": "Admiral's Report on Boat Strike Survivors Raises Questions About Military Action and Narratives Surrounding Drug Interdiction",
        "content": "Reports indicate an Admiral will brief lawmakers, asserting that survivors of a recent boat strike were actively pursuing a drug mission. This exclusive detail emerges amidst a controversial incident involving US military action, prompting critical questions about the justification and execution of such interventions, the potential for civilian casualties, and the official narratives presented in the wake of such fraught international encounters.",
        "originalSource": "The Wall Street Journal",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1765079362780-4",
        "headline": "Conservative Commentator Pete Hegseth Reportedly Challenges President Trump's Political Authority, Highlighting Internal Fissures",
        "content": "Fox News host and prominent conservative commentator Pete Hegseth is reportedly testing the boundaries of President Trump's 'No Scalps' political principle, signaling potential internal discord within the right-wing establishment. This evolving political narrative underscores the fragility of alliances and the power struggles unfolding within conservative media and politics, where loyalty tests are a constant feature.",
        "originalSource": "The Atlantic",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765079362780-5",
        "headline": "Pop Culture Icon Taylor Swift and Athlete Travis Kelce Reportedly Plan Upcoming Wedding",
        "content": "In news capturing significant public attention, pop music sensation Taylor Swift and NFL star Travis Kelce have reportedly finalized a date and selected a high-profile Rhode Island location for their much-anticipated wedding. Details continue to emerge about this union of two cultural figures, sparking widespread discussion across various media platforms.",
        "originalSource": "Yahoo",
        "publishedTime": "15 hours ago"
      }
    ],
    "Neutral": [
      {
        "id": "story-1765079362780-0",
        "headline": "Companies seek refunds from tariffs as Supreme Court decision looms.",
        "content": "A pending Supreme Court decision on the President's authority to impose sweeping import taxes could entitle major corporations, including Costco, to substantial refunds. The case focuses on whether the executive branch overstepped its powers.",
        "originalSource": "The Washington Post",
        "publishedTime": "Within 24 hours"
      },
      {
        "id": "story-1765079362780-1",
        "headline": "Trump's latest Big Tech pressure play: Restrict content moderator visas.",
        "content": "The Trump administration is cracking down on online censorship by issuing new guidance from the State Department, which restricts some tech workers, specifically content moderators, from receiving H1-B visas. This action targets Big Tech companies.",
        "originalSource": "The Washington Post",
        "publishedTime": "Within 24 hours"
      },
      {
        "id": "story-1765079362780-2",
        "headline": "Frank Gehry, who stretched architecture's boundaries, dies at 96.",
        "content": "Frank Gehry, the world-renowned architect celebrated for his wildly imaginative and boundary-stretching designs, has died at the age of 96. His iconic works include the Guggenheim Museum Bilbao and the Walt Disney Concert Hall.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1765079362780-3",
        "headline": "Survivors of Boat Strike Were Actively Continuing Drug Mission, Admiral to Tell Lawmakers.",
        "content": "An Admiral is reportedly set to inform lawmakers that the survivors of a recent boat strike were actively engaged in a drug mission. This exclusive report provides new details on the controversial incident involving US military action.",
        "originalSource": "The Wall Street Journal",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1765079362780-4",
        "headline": "Pete Hegseth Is Seriously Testing Trump's 'No Scalps' Rule.",
        "content": "Fox News host and conservative commentator Pete Hegseth is reportedly challenging one of President Trump's political principles, testing the limits of the 'No Scalps' rule. The developing political story is trending in national media.",
        "originalSource": "The Atlantic",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765079362780-5",
        "headline": "Taylor Swift Has Set a Date and a Venue for Her Wedding to Travis Kelce.",
        "content": "Pop superstar Taylor Swift and NFL tight end Travis Kelce have reportedly set a date and chosen a swanky Rhode Island venue for their highly anticipated wedding. Details are emerging about the celebrity couple's plans.",
        "originalSource": "Yahoo",
        "publishedTime": "15 hours ago"
      }
    ],
    "Right Wing": [
      {
        "id": "story-1765079362780-0",
        "headline": "Corporations Demand Tariff Refunds Amidst Looming Supreme Court Decision on Presidential Authority.",
        "content": "The Supreme Court is poised to consider the crucial question of presidential authority to impose vital import taxes, a power essential for safeguarding American industries and workers. This comes as large corporations, including retail giant Costco, are shamelessly seeking massive refunds, potentially undermining efforts to protect our nation's economic interests. This pivotal case will undoubtedly shape the balance of power and determine whether the executive branch can effectively defend our markets or if its authority will be unfairly curtailed by those who prioritize globalism over national prosperity.",
        "originalSource": "The Washington Post",
        "publishedTime": "Within 24 hours"
      },
      {
        "id": "story-1765079362780-1",
        "headline": "President Trump Fights Big Tech Censorship by Restricting Foreign Visas.",
        "content": "President Trump is once again leading the charge against the tyrannical practices of Big Tech, taking decisive action to curb their rampant online censorship. New guidance from the State Department, restricting H1-B visas for content moderators, directly targets these Silicon Valley behemoths who routinely silence conservative voices and manipulate public discourse. This crucial move defends American free speech and ensures that foreign workers are not used to undermine our cherished constitutional liberties, rightly putting America First.",
        "originalSource": "The Washington Post",
        "publishedTime": "Within 24 hours"
      },
      {
        "id": "story-1765079362780-2",
        "headline": "Renowned Architect Frank Gehry, Known for Distinctive Designs, Passes Away at 96.",
        "content": "Frank Gehry, an architect of considerable renown, has passed away at the age of 96. He was celebrated for his unique and often challenging designs that pushed the envelopes of conventional building. His legacy includes significant structures such as the Guggenheim Museum Bilbao and the Walt Disney Concert Hall, which stand as testaments to his prolific career and influence on contemporary architecture, leaving an indelible mark on the built environment for future generations.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1765079362780-3",
        "headline": "Admiral Confirms Boat Strike Survivors Continued Drug Mission, Justifying Military Action.",
        "content": "An Admiral is prepared to reveal to lawmakers crucial details confirming that survivors of a recent boat strike were, in fact, actively continuing a dangerous drug mission. This report underscores the vital role our military plays in combating illegal drug trafficking and protecting our nation's borders and citizens from the scourges of illicit substances. It provides essential context for the controversial incident, affirming the necessity of swift and decisive action against those who threaten our communities and national security.",
        "originalSource": "The Wall Street Journal",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1765079362780-4",
        "headline": "Conservative Voice Pete Hegseth Tests Boundaries of President Trump's Political Principles.",
        "content": "Esteemed Fox News host and conservative thought leader Pete Hegseth is reportedly engaging in a significant test of President Trump's well-known 'No Scalps' rule, a principle vital to maintaining loyalty and unity within the America First movement. This developing political discussion among conservatives highlights the robust and often passionate debates that strengthen our shared principles, even as it tests the limits of political fealty within the national conservative media landscape.",
        "originalSource": "The Atlantic",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765079362780-5",
        "headline": "Taylor Swift and Travis Kelce Reportedly Choose Date and Traditional Venue for Wedding.",
        "content": "Pop music icon Taylor Swift and NFL star Travis Kelce have reportedly finalized plans for their upcoming wedding, selecting a date and a fitting Rhode Island venue. This highly anticipated union of two prominent figures celebrates the timeless institution of marriage and brings much attention to the couple's personal commitment, with further details expected to emerge about their plans.",
        "originalSource": "Yahoo",
        "publishedTime": "15 hours ago"
      }
    ],
    "Satire": [
      {
        "id": "story-1765079362780-0",
        "headline": "Corporations Already Planning Champagne Showers as Supreme Court Considers Handing Them Billions",
        "content": "Major corporations, including bulk-buying giant Costco, are reportedly clearing out their liquor cabinets in anticipation of a pending Supreme Court decision. The Court is currently deliberating whether President Trump's authority to impose 'sweeping' import taxes was perhaps a *little* too sweeping, potentially entitling these companies to refunds so substantial, they'll need bigger vaults for all the cash.",
        "originalSource": "The Washington Post",
        "publishedTime": "Within 24 hours"
      },
      {
        "id": "story-1765079362780-1",
        "headline": "President Trump Unveils Bold Plan to Ensure Internet Remains Absolute Wild West",
        "content": "In a decisive move to 'protect free speech' and possibly ensure nobody ever feels safe online again, President Trump's administration has issued new State Department guidance. This genius policy restricts H1-B visas for content moderators, effectively guaranteeing that future online discourse will be indistinguishable from a comment section written by a rabid badger. Big Tech companies are reportedly scrambling to find new employees who can distinguish between 'kitten video' and 'sedition.'",
        "originalSource": "The Washington Post",
        "publishedTime": "Within 24 hours"
      },
      {
        "id": "story-1765079362780-2",
        "headline": "Frank Gehry, Architect Who Made Buildings Look Like They Were Melting, Finally Stops Melting Himself At 96",
        "content": "The world paused today to mourn Frank Gehry, the revolutionary architect whose designs consistently asked, 'What if a building was having a very public existential crisis?' Gehry, whose iconic works such as the Guggenheim Museum Bilbao and the Walt Disney Concert Hall often appeared to be on the verge of collapsing into a beautiful, metallic puddle, passed away peacefully at the ripe old age of 96, thankfully without any structural failures of his own.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1765079362780-3",
        "headline": "Drug Smugglers So Dedicated, They Continued Mission While Drowning, Admiral Reports",
        "content": "In a stunning display of commitment to their craft, survivors of a recent boat strike were reportedly still attempting to complete their drug mission even as they clung to debris and potentially screamed for help. An Admiral is set to inform lawmakers of this unparalleled entrepreneurial spirit, noting, 'You just don't see that kind of dedication to illegal enterprise anymore, it's almost admirable, in a very illegal way.'",
        "originalSource": "The Wall Street Journal",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1765079362780-4",
        "headline": "Pete Hegseth Dares to Suggest President Trump's Hair Is Not Actually Sentient",
        "content": "Fox News personality Pete Hegseth is reportedly engaging in an unprecedented game of political chicken with President Trump, brazenly questioning the 'No Scalps' rule. While sources confirm this rule is not about literal scalps, it is the unspoken understanding that one simply *does not* visibly disagree with the President. Insiders are holding their breath, wondering if Hegseth will be the first to discover the true, hair-raising consequences of such insubordination.",
        "originalSource": "The Atlantic",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765079362780-5",
        "headline": "Taylor Swift and Travis Kelce's Wedding To Be Declared Global Holiday, Economy Halts",
        "content": "The long-anticipated union of pop titan Taylor Swift and football demigod Travis Kelce is reportedly so monumental that world leaders are already discussing a potential global holiday in its honor. Sources close to the couple confirmed the Rhode Island venue choice, ensuring that a small, scenic New England town will now bear the impossible burden of hosting an event that could potentially shift tectonic plates and redefine the meaning of 'destination wedding.'",
        "originalSource": "Yahoo",
        "publishedTime": "15 hours ago"
      }
    ],
    "12-Year-Old": [
      {
        "id": "story-1765079362780-0",
        "headline": "Big Companies Might Get Money Back Because of a Big Law Case",
        "content": "A very important court called the Supreme Court is going to decide if President Trump was allowed to put extra taxes on stuff brought in from other countries. If the court says he did too much, then big stores like Costco might get a lot of money back from those taxes.",
        "originalSource": "The Washington Post",
        "publishedTime": "Within 24 hours"
      },
      {
        "id": "story-1765079362780-1",
        "headline": "President Trump Wants to Change Rules for Tech Company Workers",
        "content": "President Trump's team is making new rules that make it harder for some people who work for big internet companies, like those who decide what posts stay online, to come to America for work. This is aimed at big tech companies because of how they decide what people can see online.",
        "originalSource": "The Washington Post",
        "publishedTime": "Within 24 hours"
      },
      {
        "id": "story-1765079362780-2",
        "headline": "Famous Building Designer Frank Gehry Passed Away at Age 96",
        "content": "Frank Gehry, a really famous person who designed amazing buildings that looked like giant pieces of art, has died. He was 96 years old. Some of his most famous and cool buildings include the Guggenheim Museum in Spain and the Walt Disney Concert Hall.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1765079362780-3",
        "headline": "An Important Navy Guy Will Say Boat Crash Survivors Were Doing Bad Stuff",
        "content": "A very important leader in the Navy, called an Admiral, is going to tell the people who make our laws that some people who survived a boat accident were still trying to move illegal drugs. This news tells us more about a big fight that happened with the US military.",
        "originalSource": "The Wall Street Journal",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1765079362780-4",
        "headline": "A TV Guy Might Be Making President Trump Annoyed",
        "content": "Pete Hegseth, who talks on TV on Fox News, is doing something that might not follow President Trump's usual rules about how his friends and supporters should act. Lots of people on the news are talking about what's happening.",
        "originalSource": "The Atlantic",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765079362780-5",
        "headline": "Taylor Swift and Travis Kelce Are Planning Their Wedding Day!",
        "content": "The super famous singer Taylor Swift and the football star Travis Kelce have decided when and where they will get married! They picked a really fancy place in Rhode Island for their big day, and everyone is super excited to hear more details about their wedding.",
        "originalSource": "Yahoo",
        "publishedTime": "15 hours ago"
      }
    ],
    "Micro Fiction": [
      {
        "id": "story-1765079362780-0",
        "headline": "A Judge's Gavel",
        "content": "The boardrooms of giants like Costco held their breath, their ledgers swollen with potential refunds. Millions, perhaps billions, hinged on the Supreme Court's verdict. A single decision, poised to re-evaluate President Trump's sweeping import taxes, promised to unravel a complex web of executive power. Lawyers sharpened arguments, economists crunched numbers, all waiting for the gavel's fall. Was it an overreach, or a necessary lever? The answer, soon to be etched in precedent, would either flood corporate coffers or leave them forever dry, a silent echo of a high-stakes gamble.",
        "originalSource": "The Washington Post",
        "publishedTime": "Within 24 hours"
      },
      {
        "id": "story-1765079362780-1",
        "headline": "Digital Borders",
        "content": "In the vast digital arenas where information flowed like a river, new walls were rising. The State Department, under President Trump's direction, had quietly tightened the invisible strings, pulling back the welcome mat for certain tech workers. Content moderators, the unseen arbiters of online discourse, found their H1-B visa pathways narrowing. This wasn't about borders, but about bytes. Big Tech, accustomed to shaping narratives, now faced a direct challenge to its workforce, a silent battle over who truly controlled the digital conversation. The virtual gates were shifting, and the gatekeepers wondered if they were next.",
        "originalSource": "The Washington Post",
        "publishedTime": "Within 24 hours"
      },
      {
        "id": "story-1765079362780-2",
        "headline": "The Sculptor of Dreams",
        "content": "The world paused, a collective inhale, as the news spread: Frank Gehry, the maestro of metal and curve, had laid down his tools at 96. His name wasn't merely an architect's; it was a verb, an adjective, defining structures that dared to defy gravity and expectation. Bilbao's Guggenheim shimmered in memory, Los Angeles's Walt Disney Concert Hall hummed with phantom music. He sculpted dreams into steel and titanium, bending imagination into tangible art. Though his physical presence departed, his legacy stood, a testament to a spirit that saw beauty in the impossible, forever stretching the boundaries of what a building could be.",
        "originalSource": "The Washington Post",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1765079362780-3",
        "headline": "The Tide's Confession",
        "content": "The sea had swallowed its secrets for too long. Now, an Admiral prepared to lay bare the truth before hushed lawmakers. The survivors, pulled from the wreckage of the recent boat strike, weren't just victims; they were perpetrators, still clinging to their illicit cargo, their mission ongoing even amidst the chaos. The waves had broken their vessel, but not their resolve. This wasn't just a rescue; it was a capture, a stark revelation of the silent war fought just beneath the surface. The incident, shrouded in controversy, finally revealed its dark core, a testament to the persistent shadow of the drug trade.",
        "originalSource": "The Wall Street Journal",
        "publishedTime": "2 days ago"
      },
      {
        "id": "story-1765079362780-4",
        "headline": "A Political Gambit",
        "content": "In the intricate dance of Washington politics, an unspoken code often dictated loyalty: the \"No Scalps\" rule. It meant internal dissent was managed, not publicly flayed. But Pete Hegseth, the outspoken commentator, seemed to be twirling too close to the flame. His words, sharp and public, were testing the very fabric of President Trump's political doctrine. Was it a calculated risk, a bid for a new kind of influence, or a misstep? The political observers watched, dissecting every comment, waiting to see if the unwritten law would bend, or if Hegseth's challenge would redefine the boundaries of acceptable dissent within the power structure.",
        "originalSource": "The Atlantic",
        "publishedTime": "7 hours ago"
      },
      {
        "id": "story-1765079362780-5",
        "headline": "A Rhode Island Rendezvous",
        "content": "The whispers turned to shouts, and then to confirmed headlines: Taylor Swift, the global phenomenon, and Travis Kelce, the gridiron star, were setting their sails for matrimony. A date whispered, a Rhode Island estate confirmed—a stage worthy of their epic romance. The world, it seemed, collectively held its breath, awaiting the ultimate celebrity union. Fan theories buzzed, paparazzi lenses sharpened, ready to capture every detail of the pop princess's grandest production yet. This wasn't just a wedding; it was a cultural event, promising a symphony of glamour, love, and a Rhode Island sunset, forever binding music and sport.",
        "originalSource": "Yahoo",
        "publishedTime": "15 hours ago"
      }
    ]
  }
}